// ScriptStruct AnimBP_MountedTurret.AnimBP_MountedTurret_C.AnimBlueprintGeneratedConstantData
// Size: 0x178 (Inherited: 0x01)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData {
	char pad_1[0x7]; // 0x01(0x07)
	struct UAnimSequenceBase* ; // 0x08(0x08)
	struct FName ; // 0x10(0x04)
	int32_t ; // 0x14(0x04)
	struct UBlendSpace* ; // 0x18(0x08)
	struct FName ; // 0x20(0x04)
	int32_t ; // 0x24(0x04)
	struct UBlendProfile* ; // 0x28(0x08)
	struct UCurveFloat* ; // 0x30(0x08)
	enum class EAlphaBlendOption ; // 0x38(0x01)
	enum class EBlendListTransitionType ; // 0x39(0x01)
	char pad_3A[0x6]; // 0x3a(0x06)
	struct TArray<float> ; // 0x40(0x10)
	struct UAnimSequenceBase* ; // 0x50(0x08)
	enum class EAnimSyncMethod ; // 0x58(0x01)
	char pad_59[0x3]; // 0x59(0x03)
	struct FName ; // 0x5c(0x04)
	struct FName ; // 0x60(0x04)
	int32_t ; // 0x64(0x04)
	struct FInputScaleBiasClampConstants ; // 0x68(0x2c)
	float ; // 0x94(0x04)
	struct UAnimSequenceBase* ; // 0x98(0x08)
	struct FName ; // 0xa0(0x04)
	int32_t ; // 0xa4(0x04)
	struct FName ; // 0xa8(0x04)
	float ; // 0xac(0x04)
	enum class ESequenceEvalReinit ; // 0xb0(0x01)
	bool ; // 0xb1(0x01)
	char pad_B2[0x6]; // 0xb2(0x06)
	struct UAnimSequenceBase* ; // 0xb8(0x08)
	bool ; // 0xc0(0x01)
	enum class EAnimSyncMethod ; // 0xc1(0x01)
	enum class EAnimGroupRole ; // 0xc2(0x01)
	char pad_C3[0x1]; // 0xc3(0x01)
	struct FName ; // 0xc4(0x04)
	struct FAnimNodeFunctionRef ; // 0xc8(0x18)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0xe0(0x80)
	struct FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0x160(0x18)
};

// ScriptStruct AnimBP_MountedTurret.AnimBP_MountedTurret_C.AnimBlueprintGeneratedMutableData
// Size: 0x0c (Inherited: 0x01)
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData {
	char pad_1[0x3]; // 0x01(0x03)
	float __FloatProperty; // 0x04(0x04)
	float ; // 0x08(0x04)
};

