// ScriptStruct AnimBP_Mounted_Cannon.AnimBP_Mounted_Cannon_C.AnimBlueprintGeneratedConstantData
// Size: 0x118 (Inherited: 0x01)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData {
	char pad_1[0x3]; // 0x01(0x03)
	struct FName ; // 0x04(0x04)
	struct UBlendSpace* ; // 0x08(0x08)
	struct FName ; // 0x10(0x04)
	int32_t ; // 0x14(0x04)
	bool ; // 0x18(0x01)
	char pad_19[0x3]; // 0x19(0x03)
	float ; // 0x1c(0x04)
	struct FInputScaleBiasClampConstants ; // 0x20(0x2c)
	float ; // 0x4c(0x04)
	struct UAnimSequenceBase* ; // 0x50(0x08)
	bool ; // 0x58(0x01)
	enum class EAnimSyncMethod ; // 0x59(0x01)
	enum class EAnimGroupRole ; // 0x5a(0x01)
	char pad_5B[0x1]; // 0x5b(0x01)
	struct FName ; // 0x5c(0x04)
	struct FName ; // 0x60(0x04)
	int32_t ; // 0x64(0x04)
	struct FAnimNodeFunctionRef ; // 0x68(0x18)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x80(0x80)
	struct FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0x100(0x18)
};

// ScriptStruct AnimBP_Mounted_Cannon.AnimBP_Mounted_Cannon_C.AnimBlueprintGeneratedMutableData
// Size: 0x08 (Inherited: 0x01)
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData {
	char pad_1[0x3]; // 0x01(0x03)
	float __FloatProperty; // 0x04(0x04)
};

