// ScriptStruct ApplyMedkit_Athena_AnimBP.ApplyMedkit_Athena_AnimBP_C.AnimBlueprintGeneratedConstantData
// Size: 0x138 (Inherited: 0x01)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData {
	char pad_1[0x3]; // 0x01(0x03)
	struct FName ; // 0x04(0x04)
	bool ; // 0x08(0x01)
	char pad_9[0x3]; // 0x09(0x03)
	float ; // 0x0c(0x04)
	struct FInputScaleBiasClampConstants ; // 0x10(0x2c)
	float ; // 0x3c(0x04)
	struct UAnimSequenceBase* ; // 0x40(0x08)
	enum class EAnimSyncMethod ; // 0x48(0x01)
	enum class EAnimGroupRole ; // 0x49(0x01)
	char pad_4A[0x2]; // 0x4a(0x02)
	struct FName ; // 0x4c(0x04)
	struct UBlendProfile* ; // 0x50(0x08)
	struct UCurveFloat* ; // 0x58(0x08)
	bool ; // 0x60(0x01)
	enum class EAlphaBlendOption ; // 0x61(0x01)
	enum class EBlendListTransitionType ; // 0x62(0x01)
	char pad_63[0x5]; // 0x63(0x05)
	struct TArray<float> ; // 0x68(0x10)
	struct TArray<int32_t> ; // 0x78(0x10)
	struct FAnimNodeFunctionRef ; // 0x88(0x18)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0xa0(0x80)
	struct FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0x120(0x18)
};

// ScriptStruct ApplyMedkit_Athena_AnimBP.ApplyMedkit_Athena_AnimBP_C.AnimBlueprintGeneratedMutableData
// Size: 0x02 (Inherited: 0x01)
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData {
	char __ByteProperty; // 0x01(0x01)
};

