// WidgetBlueprintGeneratedClass Athena_ControllerDisconnectedModal.Athena_ControllerDisconnectedModal_C
// Size: 0x400 (Inherited: 0x3c0)
struct UAthena_ControllerDisconnectedModal_C : UAthenaControllerDisconnectedModal {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x3c0(0x08)
	struct UWidgetAnimation* Intro; // 0x3c8(0x08)
	struct UCommonActionWidget* ; // 0x3d0(0x08)
	struct UImage* ; // 0x3d8(0x08)
	struct UImage* Image_Separator_Down; // 0x3e0(0x08)
	struct UImage* Image_Separator_Up; // 0x3e8(0x08)
	struct ULightbox_C* Lightbox; // 0x3f0(0x08)
	struct UImage* ProgressSpinner; // 0x3f8(0x08)

	void BP_OnActivated(); // Function Athena_ControllerDisconnectedModal.Athena_ControllerDisconnectedModal_C.BP_OnActivated // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void ExecuteUbergraph_Athena_ControllerDisconnectedModal(int32_t EntryPoint); // Function Athena_ControllerDisconnectedModal.Athena_ControllerDisconnectedModal_C.ExecuteUbergraph_Athena_ControllerDisconnectedModal // (Final|UbergraphFunction) // @ game+0xdef49c
};

