// BlueprintGeneratedClass B_SMA_Athena_RealitySapling_Base.B_SMA_Athena_RealitySapling_Base_C
// Size: 0x1790 (Inherited: 0x15cf)
struct AB_SMA_Athena_RealitySapling_Base_C : AB_SMA_Athena_RealitySapling_Parent_C {
	char pad_15CF[0x1]; // 0x15cf(0x01)
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x15d0(0x08)
	struct UFXStaticMeshComponent_C* FX_SM_Adult2; // 0x15d8(0x08)
	struct UFXStaticMeshComponent_C* FX_SM_Young; // 0x15e0(0x08)
	struct UFXStaticMeshComponent_C* FX_SM_Adult; // 0x15e8(0x08)
	float Timeline_10_TeleportCurve_D9A8FB0E4CE60663501FE1AE011C419A; // 0x15f0(0x04)
	enum class ETimelineDirection Timeline_10__Direction_D9A8FB0E4CE60663501FE1AE011C419A; // 0x15f4(0x01)
	char pad_15F5[0x3]; // 0x15f5(0x03)
	struct UTimelineComponent* ; // 0x15f8(0x08)
	float Timeline_9_TeleportCurve_55DF9E5948978D8E6FA6E1ABCE789842; // 0x1600(0x04)
	enum class ETimelineDirection Timeline_9__Direction_55DF9E5948978D8E6FA6E1ABCE789842; // 0x1604(0x01)
	char pad_1605[0x3]; // 0x1605(0x03)
	struct UTimelineComponent* ; // 0x1608(0x08)
	float Timeline_8_SaplingDeathCurve_139D245C4C4EBA8133CF02957DF90C8D; // 0x1610(0x04)
	float Timeline_8_TeleportCurve_139D245C4C4EBA8133CF02957DF90C8D; // 0x1614(0x04)
	enum class ETimelineDirection Timeline_8__Direction_139D245C4C4EBA8133CF02957DF90C8D; // 0x1618(0x01)
	char pad_1619[0x7]; // 0x1619(0x07)
	struct UTimelineComponent* ; // 0x1620(0x08)
	float Timeline_7_SaplingDeathCurve_7EC87C1142C96CD18819DFB4BF89C2F5; // 0x1628(0x04)
	float Timeline_7_TeleportCurve_7EC87C1142C96CD18819DFB4BF89C2F5; // 0x162c(0x04)
	enum class ETimelineDirection Timeline_7__Direction_7EC87C1142C96CD18819DFB4BF89C2F5; // 0x1630(0x01)
	char pad_1631[0x7]; // 0x1631(0x07)
	struct UTimelineComponent* ; // 0x1638(0x08)
	float Timeline_6_SaplingDeathCurve_8FC09153404C8C71D0EC988D13EC1A9F; // 0x1640(0x04)
	float Timeline_6_TeleportCurve_8FC09153404C8C71D0EC988D13EC1A9F; // 0x1644(0x04)
	enum class ETimelineDirection Timeline_6__Direction_8FC09153404C8C71D0EC988D13EC1A9F; // 0x1648(0x01)
	char pad_1649[0x7]; // 0x1649(0x07)
	struct UTimelineComponent* ; // 0x1650(0x08)
	float Timeline_5_SaplingDeathCurve_406492E5422E06540C0864A0CCD1AEEE; // 0x1658(0x04)
	float Timeline_5_TeleportCurve_406492E5422E06540C0864A0CCD1AEEE; // 0x165c(0x04)
	enum class ETimelineDirection Timeline_5__Direction_406492E5422E06540C0864A0CCD1AEEE; // 0x1660(0x01)
	char pad_1661[0x7]; // 0x1661(0x07)
	struct UTimelineComponent* ; // 0x1668(0x08)
	float Timeline_4_TeleportCurve_EB255A274D796C981AC606BCF99A1C4E; // 0x1670(0x04)
	enum class ETimelineDirection Timeline_4__Direction_EB255A274D796C981AC606BCF99A1C4E; // 0x1674(0x01)
	char pad_1675[0x3]; // 0x1675(0x03)
	struct UTimelineComponent* ; // 0x1678(0x08)
	float Timeline_3_TeleportCurve_A53E94564F6D6B017390E1A6DD9D7289; // 0x1680(0x04)
	enum class ETimelineDirection Timeline_3__Direction_A53E94564F6D6B017390E1A6DD9D7289; // 0x1684(0x01)
	char pad_1685[0x3]; // 0x1685(0x03)
	struct UTimelineComponent* ; // 0x1688(0x08)
	float Timeline_2_TeleportCurve_0F0E77AA41EE01E28E8478B960279513; // 0x1690(0x04)
	enum class ETimelineDirection Timeline_2__Direction_0F0E77AA41EE01E28E8478B960279513; // 0x1694(0x01)
	char pad_1695[0x3]; // 0x1695(0x03)
	struct UTimelineComponent* ; // 0x1698(0x08)
	float Timeline_1_TeleportCurve_731E57F54E9CA3AF5205509DC7446811; // 0x16a0(0x04)
	enum class ETimelineDirection Timeline_1__Direction_731E57F54E9CA3AF5205509DC7446811; // 0x16a4(0x01)
	char pad_16A5[0x3]; // 0x16a5(0x03)
	struct UTimelineComponent* ; // 0x16a8(0x08)
	float Timeline_SaplingDeathCurve_D38AC9084B54852C08C36C88EC96EA78; // 0x16b0(0x04)
	float Timeline_TeleportCurve_D38AC9084B54852C08C36C88EC96EA78; // 0x16b4(0x04)
	enum class ETimelineDirection Timeline__Direction_D38AC9084B54852C08C36C88EC96EA78; // 0x16b8(0x01)
	char pad_16B9[0x7]; // 0x16b9(0x07)
	struct UTimelineComponent* Timeline; // 0x16c0(0x08)
	float SaplingTeleportCurve_SaplingDeathCurve_7EECB11B4DB9A59A3949E5B4CBD35360; // 0x16c8(0x04)
	float SaplingTeleportCurve_TeleportCurve_7EECB11B4DB9A59A3949E5B4CBD35360; // 0x16cc(0x04)
	enum class ETimelineDirection SaplingTeleportCurve__Direction_7EECB11B4DB9A59A3949E5B4CBD35360; // 0x16d0(0x01)
	char pad_16D1[0x7]; // 0x16d1(0x07)
	struct UTimelineComponent* SaplingTeleportCurve; // 0x16d8(0x08)
	float Scale_Scale_C417275D4E433B788B9B0BA7D5A33D3A; // 0x16e0(0x04)
	enum class ETimelineDirection Scale__Direction_C417275D4E433B788B9B0BA7D5A33D3A; // 0x16e4(0x01)
	char pad_16E5[0x3]; // 0x16e5(0x03)
	struct UTimelineComponent* Scale; // 0x16e8(0x08)
	float Timeline_0_EmissivePan_6840B3A143A88B7F3AEB75ACA63DB5A6; // 0x16f0(0x04)
	float Timeline_0_WPO_Wiggle_6840B3A143A88B7F3AEB75ACA63DB5A6; // 0x16f4(0x04)
	float Timeline_0_PetalsOpenming_6840B3A143A88B7F3AEB75ACA63DB5A6; // 0x16f8(0x04)
	enum class ETimelineDirection Timeline_0__Direction_6840B3A143A88B7F3AEB75ACA63DB5A6; // 0x16fc(0x01)
	char pad_16FD[0x3]; // 0x16fd(0x03)
	struct UTimelineComponent* ; // 0x1700(0x08)
	float PetalANimation_EmissivePan_A3115471471CBB0ED305B084690D3C9C; // 0x1708(0x04)
	float PetalANimation_WPO_Wiggle_A3115471471CBB0ED305B084690D3C9C; // 0x170c(0x04)
	float PetalANimation_PetalsOpenming_A3115471471CBB0ED305B084690D3C9C; // 0x1710(0x04)
	enum class ETimelineDirection PetalANimation__Direction_A3115471471CBB0ED305B084690D3C9C; // 0x1714(0x01)
	char pad_1715[0x3]; // 0x1715(0x03)
	struct UTimelineComponent* PetalANimation; // 0x1718(0x08)
	struct UMaterialInstanceDynamic* FX_Material_Adult_Petals; // 0x1720(0x08)
	struct UNiagaraComponent* NS_LocalPlayer_Adult; // 0x1728(0x08)
	struct USoundBase* IsGhostSound; // 0x1730(0x08)
	struct USoundBase* DestroyedSound; // 0x1738(0x08)
	struct USoundBase* TransplantedSound; // 0x1740(0x08)
	struct USoundBase* NourishedSound; // 0x1748(0x08)
	struct USoundBase* OwnedBabySaplingSound; // 0x1750(0x08)
	struct USoundBase* OwnedAdultSaplingSound; // 0x1758(0x08)
	struct UMaterialInstanceDynamic* FX_Material_Adult_GLow; // 0x1760(0x08)
	struct UMaterialInstanceDynamic* FX_Material_Young_Fronds; // 0x1768(0x08)
	struct UMaterialInstanceDynamic* FX_Material_Young_GLow; // 0x1770(0x08)
	struct UMaterialInstanceDynamic* FX_Material_Young_GlowSmall; // 0x1778(0x08)
	struct UMaterialInstanceDynamic* FX_Material_Adult_Spline; // 0x1780(0x08)
	struct USoundBase* RemovedSound; // 0x1788(0x08)

	void On Sapling Newly Transplanted(); // Function B_SMA_Athena_RealitySapling_Base.B_SMA_Athena_RealitySapling_Base_C.On Sapling Newly Transplanted // (Public|BlueprintCallable|BlueprintEvent) // @ game+0xdef49c
	void UserConstructionScript(); // Function B_SMA_Athena_RealitySapling_Base.B_SMA_Athena_RealitySapling_Base_C.UserConstructionScript // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0xdef49c
	void Scale__FinishedFunc(); // Function B_SMA_Athena_RealitySapling_Base.B_SMA_Athena_RealitySapling_Base_C.Scale__FinishedFunc // (BlueprintEvent) // @ game+0xdef49c
	void Scale__UpdateFunc(); // Function B_SMA_Athena_RealitySapling_Base.B_SMA_Athena_RealitySapling_Base_C.Scale__UpdateFunc // (BlueprintEvent) // @ game+0xdef49c
	void Timeline_0__FinishedFunc(); // Function B_SMA_Athena_RealitySapling_Base.B_SMA_Athena_RealitySapling_Base_C.Timeline_0__FinishedFunc // (BlueprintEvent) // @ game+0xdef49c
	void Timeline_0__UpdateFunc(); // Function B_SMA_Athena_RealitySapling_Base.B_SMA_Athena_RealitySapling_Base_C.Timeline_0__UpdateFunc // (BlueprintEvent) // @ game+0xdef49c
	void PetalANimation__FinishedFunc(); // Function B_SMA_Athena_RealitySapling_Base.B_SMA_Athena_RealitySapling_Base_C.PetalANimation__FinishedFunc // (BlueprintEvent) // @ game+0xdef49c
	void PetalANimation__UpdateFunc(); // Function B_SMA_Athena_RealitySapling_Base.B_SMA_Athena_RealitySapling_Base_C.PetalANimation__UpdateFunc // (BlueprintEvent) // @ game+0xdef49c
	void SaplingTeleportCurve__FinishedFunc(); // Function B_SMA_Athena_RealitySapling_Base.B_SMA_Athena_RealitySapling_Base_C.SaplingTeleportCurve__FinishedFunc // (BlueprintEvent) // @ game+0xdef49c
	void SaplingTeleportCurve__UpdateFunc(); // Function B_SMA_Athena_RealitySapling_Base.B_SMA_Athena_RealitySapling_Base_C.SaplingTeleportCurve__UpdateFunc // (BlueprintEvent) // @ game+0xdef49c
	void Timeline__FinishedFunc(); // Function B_SMA_Athena_RealitySapling_Base.B_SMA_Athena_RealitySapling_Base_C.Timeline__FinishedFunc // (BlueprintEvent) // @ game+0xdef49c
	void Timeline__UpdateFunc(); // Function B_SMA_Athena_RealitySapling_Base.B_SMA_Athena_RealitySapling_Base_C.Timeline__UpdateFunc // (BlueprintEvent) // @ game+0xdef49c
	void Timeline_1__FinishedFunc(); // Function B_SMA_Athena_RealitySapling_Base.B_SMA_Athena_RealitySapling_Base_C.Timeline_1__FinishedFunc // (BlueprintEvent) // @ game+0xdef49c
	void Timeline_1__UpdateFunc(); // Function B_SMA_Athena_RealitySapling_Base.B_SMA_Athena_RealitySapling_Base_C.Timeline_1__UpdateFunc // (BlueprintEvent) // @ game+0xdef49c
	void Timeline_2__FinishedFunc(); // Function B_SMA_Athena_RealitySapling_Base.B_SMA_Athena_RealitySapling_Base_C.Timeline_2__FinishedFunc // (BlueprintEvent) // @ game+0xdef49c
	void Timeline_2__UpdateFunc(); // Function B_SMA_Athena_RealitySapling_Base.B_SMA_Athena_RealitySapling_Base_C.Timeline_2__UpdateFunc // (BlueprintEvent) // @ game+0xdef49c
	void Timeline_3__FinishedFunc(); // Function B_SMA_Athena_RealitySapling_Base.B_SMA_Athena_RealitySapling_Base_C.Timeline_3__FinishedFunc // (BlueprintEvent) // @ game+0xdef49c
	void Timeline_3__UpdateFunc(); // Function B_SMA_Athena_RealitySapling_Base.B_SMA_Athena_RealitySapling_Base_C.Timeline_3__UpdateFunc // (BlueprintEvent) // @ game+0xdef49c
	void Timeline_4__FinishedFunc(); // Function B_SMA_Athena_RealitySapling_Base.B_SMA_Athena_RealitySapling_Base_C.Timeline_4__FinishedFunc // (BlueprintEvent) // @ game+0xdef49c
	void Timeline_4__UpdateFunc(); // Function B_SMA_Athena_RealitySapling_Base.B_SMA_Athena_RealitySapling_Base_C.Timeline_4__UpdateFunc // (BlueprintEvent) // @ game+0xdef49c
	void Timeline_5__FinishedFunc(); // Function B_SMA_Athena_RealitySapling_Base.B_SMA_Athena_RealitySapling_Base_C.Timeline_5__FinishedFunc // (BlueprintEvent) // @ game+0xdef49c
	void Timeline_5__UpdateFunc(); // Function B_SMA_Athena_RealitySapling_Base.B_SMA_Athena_RealitySapling_Base_C.Timeline_5__UpdateFunc // (BlueprintEvent) // @ game+0xdef49c
	void Timeline_6__FinishedFunc(); // Function B_SMA_Athena_RealitySapling_Base.B_SMA_Athena_RealitySapling_Base_C.Timeline_6__FinishedFunc // (BlueprintEvent) // @ game+0xdef49c
	void Timeline_6__UpdateFunc(); // Function B_SMA_Athena_RealitySapling_Base.B_SMA_Athena_RealitySapling_Base_C.Timeline_6__UpdateFunc // (BlueprintEvent) // @ game+0xdef49c
	void Timeline_7__FinishedFunc(); // Function B_SMA_Athena_RealitySapling_Base.B_SMA_Athena_RealitySapling_Base_C.Timeline_7__FinishedFunc // (BlueprintEvent) // @ game+0xdef49c
	void Timeline_7__UpdateFunc(); // Function B_SMA_Athena_RealitySapling_Base.B_SMA_Athena_RealitySapling_Base_C.Timeline_7__UpdateFunc // (BlueprintEvent) // @ game+0xdef49c
	void Timeline_8__FinishedFunc(); // Function B_SMA_Athena_RealitySapling_Base.B_SMA_Athena_RealitySapling_Base_C.Timeline_8__FinishedFunc // (BlueprintEvent) // @ game+0xdef49c
	void Timeline_8__UpdateFunc(); // Function B_SMA_Athena_RealitySapling_Base.B_SMA_Athena_RealitySapling_Base_C.Timeline_8__UpdateFunc // (BlueprintEvent) // @ game+0xdef49c
	void Timeline_9__FinishedFunc(); // Function B_SMA_Athena_RealitySapling_Base.B_SMA_Athena_RealitySapling_Base_C.Timeline_9__FinishedFunc // (BlueprintEvent) // @ game+0xdef49c
	void Timeline_9__UpdateFunc(); // Function B_SMA_Athena_RealitySapling_Base.B_SMA_Athena_RealitySapling_Base_C.Timeline_9__UpdateFunc // (BlueprintEvent) // @ game+0xdef49c
	void Timeline_10__FinishedFunc(); // Function B_SMA_Athena_RealitySapling_Base.B_SMA_Athena_RealitySapling_Base_C.Timeline_10__FinishedFunc // (BlueprintEvent) // @ game+0xdef49c
	void Timeline_10__UpdateFunc(); // Function B_SMA_Athena_RealitySapling_Base.B_SMA_Athena_RealitySapling_Base_C.Timeline_10__UpdateFunc // (BlueprintEvent) // @ game+0xdef49c
	void On Sapling Baby Planted(); // Function B_SMA_Athena_RealitySapling_Base.B_SMA_Athena_RealitySapling_Base_C.On Sapling Baby Planted // (Public|BlueprintCallable|BlueprintEvent) // @ game+0xdef49c
	void On Turned Into A Ghost(); // Function B_SMA_Athena_RealitySapling_Base.B_SMA_Athena_RealitySapling_Base_C.On Turned Into A Ghost // (Public|BlueprintCallable|BlueprintEvent) // @ game+0xdef49c
	void On Sapling Belongs to Local Player(); // Function B_SMA_Athena_RealitySapling_Base.B_SMA_Athena_RealitySapling_Base_C.On Sapling Belongs to Local Player // (Public|BlueprintCallable|BlueprintEvent) // @ game+0xdef49c
	void OnSaplingTransplanted(); // Function B_SMA_Athena_RealitySapling_Base.B_SMA_Athena_RealitySapling_Base_C.OnSaplingTransplanted // (BlueprintCallable|BlueprintEvent) // @ game+0xdef49c
	void On Sapling Partially Nurtured(); // Function B_SMA_Athena_RealitySapling_Base.B_SMA_Athena_RealitySapling_Base_C.On Sapling Partially Nurtured // (Net|NetReliableNetMulticast|BlueprintCallable|BlueprintEvent) // @ game+0xdef49c
	void OnSaplingNurtured(); // Function B_SMA_Athena_RealitySapling_Base.B_SMA_Athena_RealitySapling_Base_C.OnSaplingNurtured // (BlueprintCallable|BlueprintEvent) // @ game+0xdef49c
	void On End Of Life(); // Function B_SMA_Athena_RealitySapling_Base.B_SMA_Athena_RealitySapling_Base_C.On End Of Life // (Net|NetReliableNetMulticast|BlueprintCallable|BlueprintEvent) // @ game+0xdef49c
	void On Sapling Transplanting Away(); // Function B_SMA_Athena_RealitySapling_Base.B_SMA_Athena_RealitySapling_Base_C.On Sapling Transplanting Away // (BlueprintCallable|BlueprintEvent) // @ game+0xdef49c
	void ReceiveBeginPlay(); // Function B_SMA_Athena_RealitySapling_Base.B_SMA_Athena_RealitySapling_Base_C.ReceiveBeginPlay // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void ReceiveEndPlay(enum class EEndPlayReason EndPlayReason); // Function B_SMA_Athena_RealitySapling_Base.B_SMA_Athena_RealitySapling_Base_C.ReceiveEndPlay // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void ExecuteUbergraph_B_SMA_Athena_RealitySapling_Base(int32_t EntryPoint); // Function B_SMA_Athena_RealitySapling_Base.B_SMA_Athena_RealitySapling_Base_C.ExecuteUbergraph_B_SMA_Athena_RealitySapling_Base // (Final|UbergraphFunction) // @ game+0xdef49c
};

