// BlueprintGeneratedClass B_SMA_Athena_RealitySapling_Parent.B_SMA_Athena_RealitySapling_Parent_C
// Size: 0x15cf (Inherited: 0xef8)
struct AB_SMA_Athena_RealitySapling_Parent_C : ABuildingRealitySapling {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0xef8(0x08)
	struct UAudioComponent* AmbientLoop; // 0xf00(0x08)
	struct UNonPlayerConversationComponent_C* NonPlayerConversationComponent; // 0xf08(0x08)
	struct UBoxComponent* Box; // 0xf10(0x08)
	struct UStaticMeshComponent* StumpStaticMesh; // 0xf18(0x08)
	struct UStaticMeshComponent* YouthStaticMesh; // 0xf20(0x08)
	struct UStaticMeshComponent* BabyStaticMesh; // 0xf28(0x08)
	double FruitStartDistanceFromGround; // 0xf30(0x08)
	double FruitHorizDistanceFromCenter; // 0xf38(0x08)
	struct FScalableFloat NumFruitsToGrow; // 0xf40(0x28)
	struct TArray<struct FServerSpawnedFruitSlot> ServerSpawnedFruitSlot; // 0xf68(0x10)
	struct TArray<struct AActor*> ServerWeeds; // 0xf78(0x10)
	struct TArray<struct AActor*> ServerConsumables; // 0xf88(0x10)
	double YouthScale; // 0xf98(0x08)
	double BabyScale; // 0xfa0(0x08)
	int32_t NumTimesWeeded; // 0xfa8(0x04)
	char pad_FAC[0x4]; // 0xfac(0x04)
	struct AB_RealitySaplingsWeeds_Spawner_C* WeedSpawner; // 0xfb0(0x08)
	int32_t SaplingNurturedCountThisMatch; // 0xfb8(0x04)
	char pad_FBC[0x4]; // 0xfbc(0x04)
	struct FScalableFloat MaxWeedingTimes; // 0xfc0(0x28)
	struct FTimerHandle CreateFruitTimerHandle; // 0xfe8(0x08)
	bool bUseShortTimes; // 0xff0(0x01)
	char pad_FF1[0x3]; // 0xff1(0x03)
	int32_t PrevNumTimesWeeded; // 0xff4(0x04)
	bool Overrride Sapling Persistence; // 0xff8(0x01)
	char pad_FF9[0x7]; // 0xff9(0x07)
	double FruitAngleOffset; // 0x1000(0x08)
	int32_t ReviveCount_unrepped; // 0x1008(0x04)
	bool HasDied; // 0x100c(0x01)
	char pad_100D[0x3]; // 0x100d(0x03)
	struct UMaterialInstance* Dead Baby Material; // 0x1010(0x08)
	struct UFortWeakPointComponent* WeakPointComp; // 0x1018(0x08)
	struct TArray<struct UFortWeakPointComponent*> WeakPointCmps; // 0x1020(0x10)
	bool Debug; // 0x1030(0x01)
	char pad_1031[0x7]; // 0x1031(0x07)
	struct AFortPlayerController* Owning Player Controller Repped; // 0x1038(0x08)
	struct AFortPlayerStateAthena* Owning Player State Repped; // 0x1040(0x08)
	double SecondsWateredThisMatch; // 0x1048(0x08)
	struct FScalableFloat MaxTimesASaplingCanBeWateredPerMatch; // 0x1050(0x28)
	struct FScalableFloat NumSecondsWateredForReaction; // 0x1078(0x28)
	double LastWateredTime; // 0x10a0(0x08)
	struct FTimerHandle WaterTimerHandle; // 0x10a8(0x08)
	int32_t NumTimesWateredThisMatch; // 0x10b0(0x04)
	bool IsBeingWatered; // 0x10b4(0x01)
	bool DestroyedForTransplant; // 0x10b5(0x01)
	bool DestroyedFromAging; // 0x10b6(0x01)
	char pad_10B7[0x1]; // 0x10b7(0x01)
	int32_t NumCurrentWeeds; // 0x10b8(0x04)
	char pad_10BC[0x4]; // 0x10bc(0x04)
	struct FDateTime LastWeededDateTime; // 0x10c0(0x08)
	struct FTimespan DebugTimespanOffset; // 0x10c8(0x08)
	int32_t DayOffset; // 0x10d0(0x04)
	int32_t MinuteOffset; // 0x10d4(0x04)
	bool NeedsWeeding; // 0x10d8(0x01)
	char pad_10D9[0x3]; // 0x10d9(0x03)
	int32_t Fruit1State; // 0x10dc(0x04)
	int32_t Fruit2State; // 0x10e0(0x04)
	int32_t Fruit3State; // 0x10e4(0x04)
	enum class SaplingFruitVariants InitialSaplingFruitVariant; // 0x10e8(0x01)
	bool HasSpawnedMythic; // 0x10e9(0x01)
	bool isInSafeZone; // 0x10ea(0x01)
	char pad_10EB[0x5]; // 0x10eb(0x05)
	struct TArray<int32_t> Persistent Sapling Data Fruit States; // 0x10f0(0x10)
	struct FMulticastInlineDelegate SaplingUpdateEvent; // 0x1100(0x10)
	struct FRealitySaplingPersistentData MovedSaplingPersistentData; // 0x1110(0x60)
	struct USoundBase* FruitSpawnSound; // 0x1170(0x08)
	struct USoundBase* NurturedSound; // 0x1178(0x08)
	struct USoundBase* DamagedSound; // 0x1180(0x08)
	struct UMaterialInstance* Dead Youth Material; // 0x1188(0x08)
	struct UMaterialInstance* Dead Mature Material; // 0x1190(0x08)
	struct UMaterialInstance* Dead Stump Material; // 0x1198(0x08)
	bool SaplingTransplanted; // 0x11a0(0x01)
	char pad_11A1[0x7]; // 0x11a1(0x07)
	struct FRealitySaplingPersistentData PersistentDataWhenSpawned; // 0x11a8(0x60)
	struct USoundBase* PlantedSound; // 0x1208(0x08)
	struct AFortPlayerController* PlanterPlayerController; // 0x1210(0x08)
	struct FSaplingBPReppedData SaplingBPReppedData; // 0x1218(0x08)
	bool OverrideIsLocalPlayerSapling; // 0x1220(0x01)
	bool FruitFallsOffSaplingsWhenKilled; // 0x1221(0x01)
	char pad_1222[0x6]; // 0x1222(0x06)
	struct UStaticMeshComponent* Active Static Mesh Comp; // 0x1228(0x08)
	double MoveOnZAxis; // 0x1230(0x08)
	struct USoundBase* FruitGrowSound; // 0x1238(0x08)
	struct USoundBase* WitheringSound; // 0x1240(0x08)
	struct FScalableFloat DelayForPartialNurtureCelebration; // 0x1248(0x28)
	struct FScalableFloat DelayForNurtureFruitUpgrade; // 0x1270(0x28)
	struct FScalableFloat DelayForNurtureCelebration; // 0x1298(0x28)
	struct FScalableFloat MinNurturingLevel; // 0x12c0(0x28)
	bool HasBeenInitialized; // 0x12e8(0x01)
	bool IsGhost; // 0x12e9(0x01)
	char pad_12EA[0x6]; // 0x12ea(0x06)
	struct FScalableFloat MaturityLevelWhenGroundItemsShowUp; // 0x12f0(0x28)
	struct FScalableFloat SaplingsEnabled; // 0x1318(0x28)
	struct FScalableFloat MythicFruitEnabled; // 0x1340(0x28)
	struct TSoftObjectPtr<UTexture2D> OwningPlayerSocialAvatarIcon; // 0x1368(0x28)
	bool FoundMythic; // 0x1390(0x01)
	char pad_1391[0x7]; // 0x1391(0x07)
	struct FScalableFloat OverrideMinBabyFruitsAtStartOfMatch; // 0x1398(0x28)
	struct FScalableFloat OverrideMinYouthFruitsAtStartOfMatch; // 0x13c0(0x28)
	struct FScalableFloat OverrideMinAdultFruitsAtStartOfMatch; // 0x13e8(0x28)
	int32_t fruitStateCount; // 0x1410(0x04)
	int32_t youthCount; // 0x1414(0x04)
	int32_t adultCount; // 0x1418(0x04)
	int32_t babyConst; // 0x141c(0x04)
	int32_t youthConst; // 0x1420(0x04)
	int32_t adultConst; // 0x1424(0x04)
	struct FMulticastInlineDelegate SaplingDestroyedForTransplantEvent; // 0x1428(0x10)
	struct FMulticastInlineDelegate SaplingWeededByEnemyEvent; // 0x1438(0x10)
	struct FMulticastInlineDelegate SaplingHarvestedByEnemyEvent; // 0x1448(0x10)
	struct FMulticastInlineDelegate SaplingDamagedByEnemyEvent; // 0x1458(0x10)
	bool OkToNotify; // 0x1468(0x01)
	char pad_1469[0x7]; // 0x1469(0x07)
	struct FScalableFloat AutoWeedWhenWeedsCantBePlaced; // 0x1470(0x28)
	struct FScalableFloat NumFruitsToGrow_Uncommon; // 0x1498(0x28)
	struct FScalableFloat NumFruitsToGrow_Common; // 0x14c0(0x28)
	struct FScalableFloat NumFruitsToGrow_Rare; // 0x14e8(0x28)
	struct FScalableFloat NumFruitsToGrow_Legendary; // 0x1510(0x28)
	struct FScalableFloat NumFruitsToGrow_Epic; // 0x1538(0x28)
	struct FScalableFloat AutoLootFruitsWhenTooMany; // 0x1560(0x28)
	bool EnemyAttacking; // 0x1588(0x01)
	bool EnemyLooting; // 0x1589(0x01)
	char pad_158A[0x6]; // 0x158a(0x06)
	struct FScalableFloat RemoveAllFruitsWhenNeedsWeeding; // 0x1590(0x28)
	bool HasBegunPlay; // 0x15b8(0x01)
	bool HasHeldOffInitialize; // 0x15b9(0x01)
	char pad_15BA[0x2]; // 0x15ba(0x02)
	int32_t GrayAsInt; // 0x15bc(0x04)
	int32_t MythicAsBabyInt; // 0x15c0(0x04)
	int32_t TargetAsInt; // 0x15c4(0x04)
	int32_t GoldAsInt; // 0x15c8(0x04)
	enum class SaplingFruitVariants Gray; // 0x15cc(0x01)
	enum class SaplingFruitVariants MythicBaby; // 0x15cd(0x01)
	enum class SaplingFruitVariants Gold; // 0x15ce(0x01)

	void Check for Too Many Fruits at Rarity Level(bool ForceSilent); // Function B_SMA_Athena_RealitySapling_Parent.B_SMA_Athena_RealitySapling_Parent_C.Check for Too Many Fruits at Rarity Level // (Public|BlueprintCallable|BlueprintEvent) // @ game+0xdef49c
	void Get Num Fruits to Grow At Current Rarity(int32_t& RetVal); // Function B_SMA_Athena_RealitySapling_Parent.B_SMA_Athena_RealitySapling_Parent_C.Get Num Fruits to Grow At Current Rarity // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0xdef49c
	bool IsOkToAutoping(); // Function B_SMA_Athena_RealitySapling_Parent.B_SMA_Athena_RealitySapling_Parent_C.IsOkToAutoping // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0xdef49c
