// ScriptStruct BP_GrenadeLauncher.BP_GrenadeLauncher_C.AnimBlueprintGeneratedConstantData
// Size: 0x170 (Inherited: 0x01)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData {
	bool ; // 0x01(0x01)
	char pad_2[0x6]; // 0x02(0x06)
	struct UAnimSequenceBase* ; // 0x08(0x08)
	struct UAnimSequenceBase* ; // 0x10(0x08)
	struct FName ; // 0x18(0x04)
	int32_t ; // 0x1c(0x04)
	struct UAnimSequenceBase* ; // 0x20(0x08)
	struct FName ; // 0x28(0x04)
	int32_t ; // 0x2c(0x04)
	struct UAnimSequenceBase* ; // 0x30(0x08)
	struct FName ; // 0x38(0x04)
	int32_t ; // 0x3c(0x04)
	struct UAnimSequenceBase* ; // 0x40(0x08)
	struct FName ; // 0x48(0x04)
	int32_t ; // 0x4c(0x04)
	struct UAnimSequenceBase* ; // 0x50(0x08)
	struct FName ; // 0x58(0x04)
	int32_t ; // 0x5c(0x04)
	float ; // 0x60(0x04)
	struct FInputScaleBiasClampConstants ; // 0x64(0x2c)
	float ; // 0x90(0x04)
	char pad_94[0x4]; // 0x94(0x04)
	struct UAnimSequenceBase* ; // 0x98(0x08)
	bool ; // 0xa0(0x01)
	enum class EAnimSyncMethod ; // 0xa1(0x01)
	enum class EAnimGroupRole ; // 0xa2(0x01)
	char pad_A3[0x1]; // 0xa3(0x01)
	struct FName ; // 0xa4(0x04)
	int32_t ; // 0xa8(0x04)
	enum class ERefPoseType ; // 0xac(0x01)
	char pad_AD[0x3]; // 0xad(0x03)
	struct FName ; // 0xb0(0x04)
	int32_t ; // 0xb4(0x04)
	struct FName ; // 0xb8(0x04)
	struct FName ; // 0xbc(0x04)
	struct FAnimNodeFunctionRef ; // 0xc0(0x18)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0xd8(0x80)
	struct FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0x158(0x18)
};

