// AnimBlueprintGeneratedClass Chrome_Blob_AnimBP.Chrome_Blob_AnimBP_C
// Size: 0x2a8d (Inherited: 0x750)
struct UChrome_Blob_AnimBP_C : UChromeBlobAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x750(0x08)
	struct FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x758(0x48)
	struct FAnimSubsystemInstance AnimBlueprintExtension_Tag; // 0x7a0(0x08)
	struct FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x7a8(0x08)
	struct FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x7b0(0x08)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x7b8(0x20)
	struct FAnimNode_Inertialization AnimGraphNode_Inertialization; // 0x7d8(0x100)
	struct FAnimNode_ApplyAdditive ; // 0x8d8(0xc8)
	struct FAnimNode_TransitionResult ; // 0x9a0(0x28)
	struct FAnimNode_TransitionResult ; // 0x9c8(0x28)
	struct FAnimNode_TransitionResult ; // 0x9f0(0x28)
	struct FAnimNode_TransitionResult ; // 0xa18(0x28)
	struct FAnimNode_TransitionResult ; // 0xa40(0x28)
	struct FAnimNode_SequencePlayer ; // 0xa68(0x40)
	struct FAnimNode_StateResult ; // 0xaa8(0x20)
	struct FAnimNode_RefPose ; // 0xac8(0x10)
	struct FAnimNode_StateResult ; // 0xad8(0x20)
	struct FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0xaf8(0x10)
	struct FAnimNode_StateResult ; // 0xb08(0x20)
	struct FAnimNode_TransitionResult ; // 0xb28(0x28)
	struct FAnimNode_StateMachine ; // 0xb50(0xc8)
	struct FFortAnimNode_QuadrupedSlopeWarping FortAnimGraphNode_QuadrupedSlopeWarping; // 0xc18(0x5c0)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x11d8(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x11f8(0x20)
	struct FAnimNode_TransitionResult ; // 0x1218(0x28)
	struct FAnimNode_TransitionResult ; // 0x1240(0x28)
	struct FAnimNode_TransitionResult ; // 0x1268(0x28)
	struct FAnimNode_TransitionResult ; // 0x1290(0x28)
	struct FAnimNode_TransitionResult ; // 0x12b8(0x28)
	struct FAnimNode_TransitionResult ; // 0x12e0(0x28)
	struct FAnimNode_TransitionResult ; // 0x1308(0x28)
	struct FAnimNode_TransitionResult ; // 0x1330(0x28)
	struct FAnimNode_TransitionResult ; // 0x1358(0x28)
	struct FAnimNode_TransitionResult ; // 0x1380(0x28)
	struct FAnimNode_TransitionResult ; // 0x13a8(0x28)
	struct FAnimNode_TransitionResult ; // 0x13d0(0x28)
	struct FAnimNode_TransitionResult ; // 0x13f8(0x28)
	struct FAnimNode_TransitionResult ; // 0x1420(0x28)
	struct FAnimNode_TransitionResult ; // 0x1448(0x28)
	struct FAnimNode_TransitionResult ; // 0x1470(0x28)
	struct FAnimNode_TransitionResult ; // 0x1498(0x28)
	struct FAnimNode_TransitionResult ; // 0x14c0(0x28)
	struct FAnimNode_TransitionResult ; // 0x14e8(0x28)
	struct FAnimNode_TransitionResult ; // 0x1510(0x28)
	struct FAnimNode_TransitionResult ; // 0x1538(0x28)
	struct FAnimNode_TransitionResult ; // 0x1560(0x28)
	struct FAnimNode_TransitionResult ; // 0x1588(0x28)
	struct FAnimNode_TransitionResult ; // 0x15b0(0x28)
	struct FAnimNode_TransitionResult ; // 0x15d8(0x28)
	struct FAnimNode_BlendSpacePlayer ; // 0x1600(0x68)
	struct FAnimNode_BlendListByBool ; // 0x1668(0x48)
	struct FAnimNode_BlendSpacePlayer ; // 0x16b0(0x68)
	struct FAnimNode_StateResult ; // 0x1718(0x20)
	struct FAnimNode_BlendSpacePlayer ; // 0x1738(0x68)
	struct FAnimNode_StateResult ; // 0x17a0(0x20)
	struct FAnimNode_TransitionResult ; // 0x17c0(0x28)
	struct FAnimNode_StateMachine ; // 0x17e8(0xc8)
	struct FAnimNode_StateResult ; // 0x18b0(0x20)
	struct FAnimNode_TransitionResult ; // 0x18d0(0x28)
	struct FAnimNode_TransitionResult ; // 0x18f8(0x28)
	struct FAnimNode_SequencePlayer ; // 0x1920(0x40)
	struct FAnimNode_StateResult ; // 0x1960(0x20)
	struct FAnimNode_SequencePlayer ; // 0x1980(0x40)
	struct FAnimNode_StateResult ; // 0x19c0(0x20)
	struct FAnimNode_TransitionResult ; // 0x19e0(0x28)
	struct FAnimNode_StateMachine ; // 0x1a08(0xc8)
	struct FAnimNode_StateResult ; // 0x1ad0(0x20)
	struct FAnimNode_TransitionResult ; // 0x1af0(0x28)
	struct FAnimNode_TransitionResult ; // 0x1b18(0x28)
	struct FAnimNode_TransitionResult ; // 0x1b40(0x28)
	struct FAnimNode_TransitionResult ; // 0x1b68(0x28)
	struct FAnimNode_TransitionResult ; // 0x1b90(0x28)
	struct FAnimNode_TransitionResult ; // 0x1bb8(0x28)
	struct FAnimNode_TransitionResult ; // 0x1be0(0x28)
	struct FAnimNode_TransitionResult ; // 0x1c08(0x28)
	struct FAnimNode_TransitionResult ; // 0x1c30(0x28)
	struct FAnimNode_TransitionResult ; // 0x1c58(0x28)
	struct FAnimNode_TransitionResult ; // 0x1c80(0x28)
	struct FAnimNode_TransitionResult ; // 0x1ca8(0x28)
	struct FAnimNode_TransitionResult ; // 0x1cd0(0x28)
	struct FAnimNode_ApplyAdditive ; // 0x1cf8(0xc8)
	struct FAnimNode_BlendSpacePlayer ; // 0x1dc0(0x68)
	struct FAnimNode_SequencePlayer ; // 0x1e28(0x40)
	struct FAnimNode_StateResult ; // 0x1e68(0x20)
	struct FAnimNode_SequencePlayer ; // 0x1e88(0x40)
	struct FAnimNode_StateResult ; // 0x1ec8(0x20)
	struct FAnimNode_SequencePlayer ; // 0x1ee8(0x40)
	struct FAnimNode_StateResult ; // 0x1f28(0x20)
	struct FAnimNode_SequencePlayer ; // 0x1f48(0x40)
	struct FAnimNode_StateResult ; // 0x1f88(0x20)
	struct FAnimNode_SequencePlayer ; // 0x1fa8(0x40)
	struct FAnimNode_StateResult ; // 0x1fe8(0x20)
	struct FAnimNode_SequencePlayer ; // 0x2008(0x40)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2048(0x48)
	struct FAnimNode_BlendSpacePlayer ; // 0x2090(0x68)
	struct FAnimNode_StateResult ; // 0x20f8(0x20)
	struct FAnimNode_SequencePlayer ; // 0x2118(0x40)
	struct FAnimNode_StateResult ; // 0x2158(0x20)
	struct FAnimNode_TransitionResult ; // 0x2178(0x28)
	struct FAnimNode_StateMachine ; // 0x21a0(0xc8)
	struct FAnimNode_StateResult ; // 0x2268(0x20)
	struct FAnimNode_TransitionResult ; // 0x2288(0x28)
	struct FAnimNode_ApplyAdditive ; // 0x22b0(0xc8)
	struct FAnimNode_BlendSpacePlayer ; // 0x2378(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x23e0(0x68)
	struct FAnimNode_StateResult ; // 0x2448(0x20)
	struct FAnimNode_SequencePlayer ; // 0x2468(0x40)
	struct FAnimNode_StateResult ; // 0x24a8(0x20)
	struct FAnimNode_StateMachine ; // 0x24c8(0xc8)
	struct FAnimNode_StateResult ; // 0x2590(0x20)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x25b0(0xc8)
	struct FAnimNode_BlendSpacePlayer ; // 0x2678(0x68)
	struct FAnimNode_SequencePlayer ; // 0x26e0(0x40)
	struct FAnimNode_StateResult ; // 0x2720(0x20)
	struct FAnimNode_BlendSpacePlayer ; // 0x2740(0x68)
	struct FAnimNode_StateResult ; // 0x27a8(0x20)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x27c8(0x68)
	struct FAnimNode_StateResult ; // 0x2830(0x20)
	struct FAnimNode_SequencePlayer ; // 0x2850(0x40)
	struct FAnimNode_StateResult ; // 0x2890(0x20)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x28b0(0x40)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x28f0(0x20)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2910(0x28)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x2938(0xc8)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0x2a00(0x48)
	bool IsDashing; // 0x2a48(0x01)
	bool IsZiplining; // 0x2a49(0x01)
	char pad_2A4A[0x6]; // 0x2a4a(0x06)
	struct UCharacterMovementComponent* Character Movement; // 0x2a50(0x08)
	bool IsSwimming; // 0x2a58(0x01)
	bool IsDash; // 0x2a59(0x01)
	bool IsPhasing; // 0x2a5a(0x01)
	bool IsLoco; // 0x2a5b(0x01)
	bool EnterIdle; // 0x2a5c(0x01)
	char pad_2A5D[0x3]; // 0x2a5d(0x03)
	double LocoStartDirection; // 0x2a60(0x08)
	float DashPitchAlpha; // 0x2a68(0x04)
	char pad_2A6C[0x4]; // 0x2a6c(0x04)
	double SprintPlayRate; // 0x2a70(0x08)
	bool EnterSwim; // 0x2a78(0x01)
	bool IsSwimIdleJump; // 0x2a79(0x01)
	bool IsPhaseInAir; // 0x2a7a(0x01)
	char pad_2A7B[0x1]; // 0x2a7b(0x01)
	float Zipline Input Lean Yaw; // 0x2a7c(0x04)
	bool IsPhaseFall; // 0x2a80(0x01)
	bool IsGroundJump; // 0x2a81(0x01)
	bool IsBlobSwim; // 0x2a82(0x01)
	bool IsGroundJumpExit; // 0x2a83(0x01)
	bool IsGroundFall; // 0x2a84(0x01)
	bool IsLocomotionEnter; // 0x2a85(0x01)
	bool IsLocomotionExit; // 0x2a86(0x01)
	bool NewVar; // 0x2a87(0x01)
	bool IsJumpLand; // 0x2a88(0x01)
	bool IsSwimJumpLoco; // 0x2a89(0x01)
	bool IsSwimFallLoco; // 0x2a8a(0x01)
	bool IsSwimJumpIdle; // 0x2a8b(0x01)
	bool IsSwimFallIdle; // 0x2a8c(0x01)

	void AnimGraph(struct FPoseLink& AnimGraph); // Function Chrome_Blob_AnimBP.Chrome_Blob_AnimBP_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xdef49c
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Chrome_Blob_AnimBP_AnimGraphNode_BlendListByBool_0E95CF4D46B7063B4B8624981D316F28(); // Function Chrome_Blob_AnimBP.Chrome_Blob_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Chrome_Blob_AnimBP_AnimGraphNode_BlendListByBool_0E95CF4D46B7063B4B8624981D316F28 // (BlueprintEvent) // @ game+0xdef49c
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Chrome_Blob_AnimBP_AnimGraphNode_TransitionResult_BFC40E9D4D3E9B3402695A8214DDD60F(); // Function Chrome_Blob_AnimBP.Chrome_Blob_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Chrome_Blob_AnimBP_AnimGraphNode_TransitionResult_BFC40E9D4D3E9B3402695A8214DDD60F // (BlueprintEvent) // @ game+0xdef49c
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Chrome_Blob_AnimBP_AnimGraphNode_TransitionResult_A0FDD6624EE8ABD17B088FA684E9629A(); // Function Chrome_Blob_AnimBP.Chrome_Blob_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Chrome_Blob_AnimBP_AnimGraphNode_TransitionResult_A0FDD6624EE8ABD17B088FA684E9629A // (BlueprintEvent) // @ game+0xdef49c
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Chrome_Blob_AnimBP_AnimGraphNode_TransitionResult_B58FA96F49CDE872755589B300EB34C4(); // Function Chrome_Blob_AnimBP.Chrome_Blob_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Chrome_Blob_AnimBP_AnimGraphNode_TransitionResult_B58FA96F49CDE872755589B300EB34C4 // (BlueprintEvent) // @ game+0xdef49c
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function Chrome_Blob_AnimBP.Chrome_Blob_AnimBP_C.BlueprintUpdateAnimation // (Event|Public|BlueprintEvent) // @ game+0xdef49c
	void AnimNotify_EnterIdle(); // Function Chrome_Blob_AnimBP.Chrome_Blob_AnimBP_C.AnimNotify_EnterIdle // (BlueprintCallable|BlueprintEvent) // @ game+0xdef49c
	void AnimNotify_EnterLocoStart(); // Function Chrome_Blob_AnimBP.Chrome_Blob_AnimBP_C.AnimNotify_EnterLocoStart // (BlueprintCallable|BlueprintEvent) // @ game+0xdef49c
	void AnimNotify_EnterSwim(); // Function Chrome_Blob_AnimBP.Chrome_Blob_AnimBP_C.AnimNotify_EnterSwim // (BlueprintCallable|BlueprintEvent) // @ game+0xdef49c
	void AnimNotify_ExitSwim(); // Function Chrome_Blob_AnimBP.Chrome_Blob_AnimBP_C.AnimNotify_ExitSwim // (BlueprintCallable|BlueprintEvent) // @ game+0xdef49c
	void AnimNotify_EnterJump(); // Function Chrome_Blob_AnimBP.Chrome_Blob_AnimBP_C.AnimNotify_EnterJump // (BlueprintCallable|BlueprintEvent) // @ game+0xdef49c
	void AnimNotify_EnterJumpLoop(); // Function Chrome_Blob_AnimBP.Chrome_Blob_AnimBP_C.AnimNotify_EnterJumpLoop // (BlueprintCallable|BlueprintEvent) // @ game+0xdef49c
	void AnimNotify_EnterPhasing(); // Function Chrome_Blob_AnimBP.Chrome_Blob_AnimBP_C.AnimNotify_EnterPhasing // (BlueprintCallable|BlueprintEvent) // @ game+0xdef49c
	void AnimNotify_EnterStop(); // Function Chrome_Blob_AnimBP.Chrome_Blob_AnimBP_C.AnimNotify_EnterStop // (BlueprintCallable|BlueprintEvent) // @ game+0xdef49c
	void ExecuteUbergraph_Chrome_Blob_AnimBP(int32_t EntryPoint); // Function Chrome_Blob_AnimBP.Chrome_Blob_AnimBP_C.ExecuteUbergraph_Chrome_Blob_AnimBP // (Final|UbergraphFunction) // @ game+0xdef49c
};

