// ScriptStruct ChromeBlobLayerAnimBP.ChromeBlobLayerAnimBP_C.AnimBlueprintGeneratedConstantData
// Size: 0x150 (Inherited: 0x01)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData {
	char pad_1[0x3]; // 0x01(0x03)
	struct FName ; // 0x04(0x04)
	struct FName ; // 0x08(0x04)
	struct FName ; // 0x0c(0x04)
	struct FName ; // 0x10(0x04)
	struct FName ; // 0x14(0x04)
	struct UBlendSpace* ; // 0x18(0x08)
	struct FName ; // 0x20(0x04)
	int32_t ; // 0x24(0x04)
	struct UBlendSpace* ; // 0x28(0x08)
	enum class EAnimSyncMethod ; // 0x30(0x01)
	char pad_31[0x3]; // 0x31(0x03)
	struct FName ; // 0x34(0x04)
	int32_t ; // 0x38(0x04)
	bool ; // 0x3c(0x01)
	char pad_3D[0x3]; // 0x3d(0x03)
	float ; // 0x40(0x04)
	struct FInputScaleBiasClampConstants ; // 0x44(0x2c)
	float ; // 0x70(0x04)
	char pad_74[0x4]; // 0x74(0x04)
	struct UAnimSequenceBase* ; // 0x78(0x08)
	bool ; // 0x80(0x01)
	enum class EAnimSyncMethod ; // 0x81(0x01)
	enum class EAnimGroupRole ; // 0x82(0x01)
	char pad_83[0x1]; // 0x83(0x01)
	struct FName ; // 0x84(0x04)
	struct FName ; // 0x88(0x04)
	int32_t ; // 0x8c(0x04)
	struct FName ; // 0x90(0x04)
	struct FName ; // 0x94(0x04)
	struct FAnimNodeFunctionRef ; // 0x98(0x18)
	struct FName ; // 0xb0(0x04)
	struct FName ; // 0xb4(0x04)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0xb8(0x80)
	struct FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0x138(0x18)
};

// ScriptStruct ChromeBlobLayerAnimBP.ChromeBlobLayerAnimBP_C.AnimBlueprintGeneratedMutableData
// Size: 0x0c (Inherited: 0x01)
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData {
	char pad_1[0x3]; // 0x01(0x03)
	float __FloatProperty; // 0x04(0x04)
	float ; // 0x08(0x04)
};

