// ScriptStruct Chrome_Blob_AnimBP.Chrome_Blob_AnimBP_C.AnimBlueprintGeneratedConstantData
// Size: 0x2f8 (Inherited: 0x01)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData {
	char pad_1[0x3]; // 0x01(0x03)
	struct FName ; // 0x04(0x04)
	struct UAnimSequenceBase* ; // 0x08(0x08)
	struct FName ; // 0x10(0x04)
	struct FName ; // 0x14(0x04)
	enum class ERefPoseType ; // 0x18(0x01)
	char pad_19[0x3]; // 0x19(0x03)
	struct FName ; // 0x1c(0x04)
	struct UBlendSpace* ; // 0x20(0x08)
	struct TArray<float> ; // 0x28(0x10)
	struct UBlendSpace* ; // 0x38(0x08)
	enum class EAnimSyncMethod ; // 0x40(0x01)
	char pad_41[0x7]; // 0x41(0x07)
	struct UBlendSpace* ; // 0x48(0x08)
	struct FName ; // 0x50(0x04)
	struct FName ; // 0x54(0x04)
	int32_t ; // 0x58(0x04)
	char pad_5C[0x4]; // 0x5c(0x04)
	struct UAnimSequenceBase* ; // 0x60(0x08)
	struct FName ; // 0x68(0x04)
	float ; // 0x6c(0x04)
	struct UAnimSequenceBase* ; // 0x70(0x08)
	struct FName ; // 0x78(0x04)
	struct FName ; // 0x7c(0x04)
	int32_t ; // 0x80(0x04)
	struct FName ; // 0x84(0x04)
	struct UAnimSequenceBase* ; // 0x88(0x08)
	struct FName ; // 0x90(0x04)
	char pad_94[0x4]; // 0x94(0x04)
	struct UAnimSequenceBase* ; // 0x98(0x08)
	struct FName ; // 0xa0(0x04)
	char pad_A4[0x4]; // 0xa4(0x04)
	struct UAnimSequenceBase* ; // 0xa8(0x08)
	struct FName ; // 0xb0(0x04)
	char pad_B4[0x4]; // 0xb4(0x04)
	struct UAnimSequenceBase* ; // 0xb8(0x08)
	struct FName ; // 0xc0(0x04)
	char pad_C4[0x4]; // 0xc4(0x04)
	struct UAnimSequenceBase* ; // 0xc8(0x08)
	struct UBlendProfile* ; // 0xd0(0x08)
	struct UCurveFloat* ; // 0xd8(0x08)
	enum class EAlphaBlendOption ; // 0xe0(0x01)
	enum class EBlendListTransitionType ; // 0xe1(0x01)
	char pad_E2[0x6]; // 0xe2(0x06)
	struct TArray<float> ; // 0xe8(0x10)
	struct UBlendSpace* ; // 0xf8(0x08)
	struct FName ; // 0x100(0x04)
	char pad_104[0x4]; // 0x104(0x04)
	struct UAnimSequenceBase* ; // 0x108(0x08)
	struct FName ; // 0x110(0x04)
	struct FName ; // 0x114(0x04)
	int32_t ; // 0x118(0x04)
	char pad_11C[0x4]; // 0x11c(0x04)
	struct UBlendSpace* ; // 0x120(0x08)
	struct UBlendSpace* ; // 0x128(0x08)
	struct FName ; // 0x130(0x04)
	float ; // 0x134(0x04)
	struct UAnimSequenceBase* ; // 0x138(0x08)
	struct FName ; // 0x140(0x04)
	int32_t ; // 0x144(0x04)
	struct FName ; // 0x148(0x04)
	int32_t ; // 0x14c(0x04)
	struct UBlendSpace* ; // 0x150(0x08)
	struct UAnimSequenceBase* ; // 0x158(0x08)
	struct FName ; // 0x160(0x04)
	int32_t ; // 0x164(0x04)
	struct UBlendSpace* ; // 0x168(0x08)
	struct FName ; // 0x170(0x04)
	int32_t ; // 0x174(0x04)
	struct UBlendSpace* ; // 0x178(0x08)
	struct FName ; // 0x180(0x04)
	int32_t ; // 0x184(0x04)
	struct UAnimSequenceBase* ; // 0x188(0x08)
	struct FName ; // 0x190(0x04)
	int32_t ; // 0x194(0x04)
	bool ; // 0x198(0x01)
	char pad_199[0x3]; // 0x199(0x03)
	float ; // 0x19c(0x04)
	struct FInputScaleBiasClampConstants ; // 0x1a0(0x2c)
	float ; // 0x1cc(0x04)
	struct UAnimSequenceBase* ; // 0x1d0(0x08)
	bool ; // 0x1d8(0x01)
	enum class EAnimSyncMethod ; // 0x1d9(0x01)
	enum class EAnimGroupRole ; // 0x1da(0x01)
	char pad_1DB[0x1]; // 0x1db(0x01)
	struct FName ; // 0x1dc(0x04)
	struct FName ; // 0x1e0(0x04)
	int32_t ; // 0x1e4(0x04)
	struct FAnimNodeFunctionRef ; // 0x1e8(0x18)
	struct FAnimSubsystem_Tag AnimBlueprintExtension_Tag; // 0x200(0x60)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x260(0x80)
	struct FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0x2e0(0x18)
};

// ScriptStruct Chrome_Blob_AnimBP.Chrome_Blob_AnimBP_C.AnimBlueprintGeneratedMutableData
// Size: 0x48 (Inherited: 0x01)
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData {
	char pad_1[0x3]; // 0x01(0x03)
	float __FloatProperty; // 0x04(0x04)
	float ; // 0x08(0x04)
	bool ; // 0x0c(0x01)
	char pad_D[0x3]; // 0x0d(0x03)
	float ; // 0x10(0x04)
	float ; // 0x14(0x04)
	float ; // 0x18(0x04)
	float ; // 0x1c(0x04)
	float ; // 0x20(0x04)
	bool ; // 0x24(0x01)
	char pad_25[0x3]; // 0x25(0x03)
	float ; // 0x28(0x04)
	float ; // 0x2c(0x04)
	float ; // 0x30(0x04)
	float ; // 0x34(0x04)
	float ; // 0x38(0x04)
	float ; // 0x3c(0x04)
	float ; // 0x40(0x04)
	float ; // 0x44(0x04)
};

