// WidgetBlueprintGeneratedClass CrewSubscriptionErrorModal.CrewSubscriptionErrorModal_C
// Size: 0x418 (Inherited: 0x3b8)
struct UCrewSubscriptionErrorModal_C : UCrewSubscriptionErrorModal {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x3b8(0x08)
	struct UWidgetAnimation* ShowUp; // 0x3c0(0x08)
	struct UImage* Badge; // 0x3c8(0x08)
	struct UImage* Containment; // 0x3d0(0x08)
	struct USafeZone* ContentSZ; // 0x3d8(0x08)
	struct UImage* Glow; // 0x3e0(0x08)
	struct UImage* Image_BackgroundBottomBar; // 0x3e8(0x08)
	struct UImage* Lightbox_HitTestBlocker; // 0x3f0(0x08)
	struct USafeZone* MobileClose; // 0x3f8(0x08)
	struct UScrollBox* PrimaryScrollBox; // 0x400(0x08)
	struct UVerticalBox* VBox_PlatformSpecific; // 0x408(0x08)
	struct UImage* Wordmark; // 0x410(0x08)

	void BP_OnActivated(); // Function CrewSubscriptionErrorModal.CrewSubscriptionErrorModal_C.BP_OnActivated // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void ExecuteUbergraph_CrewSubscriptionErrorModal(int32_t EntryPoint); // Function CrewSubscriptionErrorModal.CrewSubscriptionErrorModal_C.ExecuteUbergraph_CrewSubscriptionErrorModal // (Final|UbergraphFunction) // @ game+0xdef49c
};

