// UserDefinedStruct ENiagaraBoneData.ENiagaraBoneData
// Size: 0xa0 (Inherited: 0x00)
struct FENiagaraBoneData {
	struct FVector Position_2_9AC2D87F46A07EE69027009126BC67C8; // 0x00(0x18)
	struct FVector LocalPosition_35_F479C6694451A0F8BEB744A89D067968; // 0x18(0x18)
	struct FVector QuatXYZ_47_1789E1BE407FF0D0DC0A4AA8C8C0C4E2; // 0x30(0x18)
	float QuatW_48_5DDF0862481099664FA7558A1B18676E; // 0x48(0x04)
	char pad_4C[0x4]; // 0x4c(0x04)
	struct FVector LocalQuatXYZ_52_69592550475548B677B8C884CA2EFD6E; // 0x50(0x18)
	float LocalQuatW_53_7E4498034FA99A9FF8381092623D0567; // 0x68(0x04)
	char pad_6C[0x4]; // 0x6c(0x04)
	struct FVector Velocity_24_B56F972A4A37F7A87BD832A4A5B3CCDC; // 0x70(0x18)
	struct FVector LocalVelocity_38_C61A08D84A325DE4075BE9841AF6D6C4; // 0x88(0x18)
};

