// VerseClass EpicGamesEngine.$SolarisSignatureFunctionOuter
// Size: 0x28 (Inherited: 0x28)
struct U$SolarisSignatureFunctionOuter : UObject {
};

// VerseClass EpicGamesEngine.task_verse_ue_input_component$WaitForAction_L_Nverse__ue__input__component_M_N_Kchar_M_Ninput__event_R
// Size: 0x170 (Inherited: 0x148)
struct Utask_verse_ue_input_component$WaitForAction_L_Nverse__ue__input__component_M_N_Kchar_M_Ninput__event_R : Utask(t) {
	struct Uverse_ue_input_component* _Self; // 0x148(0x08)
	struct Ftuple_Lverse__ue__input__component_M_Kchar_Minput__event_R __verse_0xB2CDDD72_Argument; // 0x150(0x20)

	int64_t Update(); // Function EpicGamesEngine.task_verse_ue_input_component$WaitForAction_L_Nverse__ue__input__component_M_N_Kchar_M_Ninput__event_R.Update // (Native|Public|HasOutParms) // @ game+0x5c98468
};

// VerseClass EpicGamesEngine.verse_ue_input_component
// Size: 0x650 (Inherited: 0x458)
struct Uverse_ue_input_component : UVerseUEInputComponentBase {
	char pad_458[0x18]; // 0x458(0x18)
	VerseFunctionProperty __verse_0x7C4A751D__L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RAddActionBinding_L_N_Kchar_M_Ninput__event_M_Ntuple_L_R_Tvoid_R; // 0x470(0x10)
	VerseFunctionProperty __verse_0xA0CE540B__L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RAddActionMapping_L_N_Kchar_M_N_Kchar_M_N_Kverse__key_R; // 0x460(0x10)
	char pad_490[0x90]; // 0x490(0x90)
	VerseFunctionProperty __verse_0x990BA955__L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RAddActionMappingAndBinding_L_N_Kchar_M_N_Kchar_M_N_Kverse__key_M_Ninput__event_M_Ntuple_L_R_Tvoid_R; // 0x520(0x10)
	VerseFunctionProperty __verse_0xC0AAB7CB__L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RAddAxisBinding_L_N_Kchar_M_N_Q_Lfloat_Tvoid_R_R; // 0x490(0x10)
	VerseFunctionProperty __verse_0x90867C45__L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RAddAxisMapping_L_N_Kchar_M_N_Kchar_M_N_Kverse__key_M_N_Qfloat_R; // 0x480(0x10)
	VerseFunctionProperty __verse_0x2D555026__L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RAddAxisMappingAndBinding_L_N_Kchar_M_N_Kchar_M_N_Kverse__key_M_N_Qfloat_M_N_Q_Lfloat_Tvoid_R_R; // 0x540(0x10)
	VerseFunctionProperty __verse_0x35F32F07__L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RClearActionMappings; // 0x4d0(0x10)
	VerseFunctionProperty __verse_0x35A10119__L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RClearAxisMappings; // 0x4e0(0x10)
	VerseFunctionProperty __verse_0x961F7CD2__L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RClearInputBindings; // 0x4f0(0x10)
	VerseFunctionProperty __verse_0xC3127334__L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RClearInputMappingsAndBindings; // 0x550(0x10)
	VerseFunctionProperty __verse_0x84FE24F8__L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RGetAxisValue_L_N_Kchar_R; // 0x500(0x10)
	VerseFunctionProperty __verse_0x6DA54EE3__L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RRemoveActionBinding_L_N_Kchar_M_Ninput__event_R; // 0x4b0(0x10)
	VerseFunctionProperty __verse_0xFA4BD56F__L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RRemoveActionMapping_L_N_Kchar_R; // 0x4a0(0x10)
	VerseFunctionProperty __verse_0xE39C826C__L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RRemoveActionMappingAndBinding_L_N_Kchar_M_Ninput__event_R; // 0x530(0x10)
	VerseFunctionProperty __verse_0x983150DC__L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RRemoveAxisBinding_L_N_Kchar_R; // 0x4c0(0x10)
	VerseFunctionProperty __verse_0x42760BD5_WaitForAction_L_Nverse__ue__input__component_M_N_Kchar_M_Ninput__event_R; // 0x510(0x10)
	char pad_600[0x50]; // 0x600(0x50)

	struct Utask(t)* WaitForAction_L_Nverse__ue__input__component_M_N_Kchar_M_Ninput__event_R(struct Utask(t)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Ftuple_Lverse__ue__input__component_M_Kchar_Minput__event_R __verse_0xB2CDDD72_Argument); // Function EpicGamesEngine.verse_ue_input_component.WaitForAction_L_Nverse__ue__input__component_M_N_Kchar_M_Ninput__event_R // (Public|HasOutParms|BlueprintCallable) // @ game+0xdef49c
	void _L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RRemoveAxisBinding_L_N_Kchar_R(VerseStringProperty __verse_0xB2CDDD72_Argument); // Function EpicGamesEngine.verse_ue_input_component._L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RRemoveAxisBinding_L_N_Kchar_R // (Native|Public|BlueprintCallable) // @ game+0x5c984c0
	void _L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RRemoveActionMappingAndBinding_L_N_Kchar_M_Ninput__event_R(struct Ftuple_L_Kchar_Minput__event_R __verse_0xB2CDDD72_Argument); // Function EpicGamesEngine.verse_ue_input_component._L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RRemoveActionMappingAndBinding_L_N_Kchar_M_Ninput__event_R // (Public|HasDefaults|BlueprintCallable) // @ game+0xdef49c
	void _L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RRemoveActionMapping_L_N_Kchar_R(VerseStringProperty __verse_0xB2CDDD72_Argument); // Function EpicGamesEngine.verse_ue_input_component._L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RRemoveActionMapping_L_N_Kchar_R // (Native|Public|BlueprintCallable) // @ game+0x5c984b8
	void _L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RRemoveActionBinding_L_N_Kchar_M_Ninput__event_R(struct Ftuple_L_Kchar_Minput__event_R __verse_0xB2CDDD72_Argument); // Function EpicGamesEngine.verse_ue_input_component._L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RRemoveActionBinding_L_N_Kchar_M_Ninput__event_R // (Native|Public|BlueprintCallable) // @ game+0x5c984b0
	double _L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RGetAxisValue_L_N_Kchar_R(VerseStringProperty __verse_0xB2CDDD72_Argument); // Function EpicGamesEngine.verse_ue_input_component._L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RGetAxisValue_L_N_Kchar_R // (Native|Public|HasOutParms|BlueprintCallable) // @ game+0x5c984a8
	void _L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RClearInputMappingsAndBindings(struct Ftuple_L_R __verse_0xB2CDDD72_Argument); // Function EpicGamesEngine.verse_ue_input_component._L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RClearInputMappingsAndBindings // (Public|HasDefaults|BlueprintCallable) // @ game+0xdef49c
	void _L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RClearInputBindings(struct Ftuple_L_R __verse_0xB2CDDD72_Argument); // Function EpicGamesEngine.verse_ue_input_component._L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RClearInputBindings // (Native|Public|BlueprintCallable) // @ game+0x5c984a0
	void _L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RClearAxisMappings(struct Ftuple_L_R __verse_0xB2CDDD72_Argument); // Function EpicGamesEngine.verse_ue_input_component._L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RClearAxisMappings // (Native|Public|BlueprintCallable) // @ game+0x5c98498
	void _L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RClearActionMappings(struct Ftuple_L_R __verse_0xB2CDDD72_Argument); // Function EpicGamesEngine.verse_ue_input_component._L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RClearActionMappings // (Native|Public|BlueprintCallable) // @ game+0x5c98490
	void _L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RAddAxisMappingAndBinding_L_N_Kchar_M_N_Kchar_M_N_Kverse__key_M_N_Qfloat_M_N_Q_Lfloat_Tvoid_R_R(struct Ftuple_L_Kchar_M_Kchar_M_Kverse__key_M_Qfloat_M_Q_Lfloat_Tvoid_R_R __verse_0xB2CDDD72_Argument); // Function EpicGamesEngine.verse_ue_input_component._L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RAddAxisMappingAndBinding_L_N_Kchar_M_N_Kchar_M_N_Kverse__key_M_N_Qfloat_M_N_Q_Lfloat_Tvoid_R_R // (Public|HasDefaults|BlueprintCallable) // @ game+0xdef49c
	void _L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RAddAxisMapping_L_N_Kchar_M_N_Kchar_M_N_Kverse__key_M_N_Qfloat_R(struct Ftuple_L_Kchar_M_Kchar_M_Kverse__key_M_Qfloat_R __verse_0xB2CDDD72_Argument); // Function EpicGamesEngine.verse_ue_input_component._L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RAddAxisMapping_L_N_Kchar_M_N_Kchar_M_N_Kverse__key_M_N_Qfloat_R // (Native|Public|BlueprintCallable) // @ game+0x5c98488
	void _L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RAddAxisBinding_L_N_Kchar_M_N_Q_Lfloat_Tvoid_R_R(struct Ftuple_L_Kchar_M_Q_Lfloat_Tvoid_R_R __verse_0xB2CDDD72_Argument); // Function EpicGamesEngine.verse_ue_input_component._L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RAddAxisBinding_L_N_Kchar_M_N_Q_Lfloat_Tvoid_R_R // (Native|Public|BlueprintCallable) // @ game+0x5c98480
	void _L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RAddActionMappingAndBinding_L_N_Kchar_M_N_Kchar_M_N_Kverse__key_M_Ninput__event_M_Ntuple_L_R_Tvoid_R(struct Ftuple_L_Kchar_M_Kchar_M_Kverse__key_Minput__event_Mtuple_L_R_Tvoid_R __verse_0xB2CDDD72_Argument); // Function EpicGamesEngine.verse_ue_input_component._L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RAddActionMappingAndBinding_L_N_Kchar_M_N_Kchar_M_N_Kverse__key_M_Ninput__event_M_Ntuple_L_R_Tvoid_R // (Public|HasDefaults|BlueprintCallable) // @ game+0xdef49c
	void _L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RAddActionMapping_L_N_Kchar_M_N_Kchar_M_N_Kverse__key_R(struct Ftuple_L_Kchar_M_Kchar_M_Kverse__key_R __verse_0xB2CDDD72_Argument); // Function EpicGamesEngine.verse_ue_input_component._L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RAddActionMapping_L_N_Kchar_M_N_Kchar_M_N_Kverse__key_R // (Native|Public|BlueprintCallable) // @ game+0x5c98478
	void _L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RAddActionBinding_L_N_Kchar_M_Ninput__event_M_Ntuple_L_R_Tvoid_R(struct Ftuple_L_Kchar_Minput__event_Mtuple_L_R_Tvoid_R __verse_0xB2CDDD72_Argument); // Function EpicGamesEngine.verse_ue_input_component._L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RAddActionBinding_L_N_Kchar_M_Ninput__event_M_Ntuple_L_R_Tvoid_R // (Native|Public|BlueprintCallable) // @ game+0x5c98470
	void $InitInstance(); // Function EpicGamesEngine.verse_ue_input_component.$InitInstance // (None) // @ game+0xdef49c
	void $Block(); // Function EpicGamesEngine.verse_ue_input_component.$Block // (None) // @ game+0xdef49c
	void $InitCDO(); // Function EpicGamesEngine.verse_ue_input_component.$InitCDO // (None) // @ game+0xdef49c
};

