// ScriptStruct Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint.Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint_C.AnimBlueprintGeneratedConstantData
// Size: 0x130 (Inherited: 0x01)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData {
	char pad_1[0x7]; // 0x01(0x07)
	struct UAnimSequenceBase* ; // 0x08(0x08)
	struct FName ; // 0x10(0x04)
	int32_t ; // 0x14(0x04)
	struct UAnimSequenceBase* ; // 0x18(0x08)
	struct FName ; // 0x20(0x04)
	int32_t ; // 0x24(0x04)
	bool ; // 0x28(0x01)
	char pad_29[0x3]; // 0x29(0x03)
	float ; // 0x2c(0x04)
	struct FInputScaleBiasClampConstants ; // 0x30(0x2c)
	float ; // 0x5c(0x04)
	struct UAnimSequenceBase* ; // 0x60(0x08)
	bool ; // 0x68(0x01)
	enum class EAnimSyncMethod ; // 0x69(0x01)
	enum class EAnimGroupRole ; // 0x6a(0x01)
	char pad_6B[0x1]; // 0x6b(0x01)
	struct FName ; // 0x6c(0x04)
	int32_t ; // 0x70(0x04)
	struct FName ; // 0x74(0x04)
	struct FName ; // 0x78(0x04)
	char pad_7C[0x4]; // 0x7c(0x04)
	struct FAnimNodeFunctionRef ; // 0x80(0x18)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x98(0x80)
	struct FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0x118(0x18)
};

