// ScriptStruct FloppingRabbitLayerAnimBP.FloppingRabbitLayerAnimBP_C.AnimBlueprintGeneratedConstantData
// Size: 0x1e8 (Inherited: 0x01)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData {
	char pad_1[0x3]; // 0x01(0x03)
	struct FName ; // 0x04(0x04)
	struct FName ; // 0x08(0x04)
	struct FName ; // 0x0c(0x04)
	struct FName ; // 0x10(0x04)
	struct FName ; // 0x14(0x04)
	struct UAnimSequenceBase* ; // 0x18(0x08)
	struct UAnimSequenceBase* ; // 0x20(0x08)
	struct FName ; // 0x28(0x04)
	char pad_2C[0x4]; // 0x2c(0x04)
	struct UAnimSequenceBase* ; // 0x30(0x08)
	float ; // 0x38(0x04)
	char pad_3C[0x4]; // 0x3c(0x04)
	struct UAnimSequenceBase* ; // 0x40(0x08)
	struct FName ; // 0x48(0x04)
	char pad_4C[0x4]; // 0x4c(0x04)
	struct UAnimSequenceBase* ; // 0x50(0x08)
	struct UAnimSequenceBase* ; // 0x58(0x08)
	struct FName ; // 0x60(0x04)
	char pad_64[0x4]; // 0x64(0x04)
	struct UAnimSequenceBase* ; // 0x68(0x08)
	bool ; // 0x70(0x01)
	char pad_71[0x7]; // 0x71(0x07)
	struct UAnimSequenceBase* ; // 0x78(0x08)
	struct FName ; // 0x80(0x04)
	struct FName ; // 0x84(0x04)
	struct FName ; // 0x88(0x04)
	struct FName ; // 0x8c(0x04)
	struct FName ; // 0x90(0x04)
	struct FName ; // 0x94(0x04)
	struct FName ; // 0x98(0x04)
	struct FName ; // 0x9c(0x04)
	struct FName ; // 0xa0(0x04)
	struct FName ; // 0xa4(0x04)
	struct FName ; // 0xa8(0x04)
	struct FName ; // 0xac(0x04)
	struct FName ; // 0xb0(0x04)
	char pad_B4[0x4]; // 0xb4(0x04)
	struct UAnimSequenceBase* ; // 0xb8(0x08)
	struct UBlendProfile* ; // 0xc0(0x08)
	struct UCurveFloat* ; // 0xc8(0x08)
	enum class EAlphaBlendOption ; // 0xd0(0x01)
	enum class EBlendListTransitionType ; // 0xd1(0x01)
	char pad_D2[0x6]; // 0xd2(0x06)
	struct TArray<float> ; // 0xd8(0x10)
	float ; // 0xe8(0x04)
	struct FInputScaleBiasClampConstants ; // 0xec(0x2c)
	float ; // 0x118(0x04)
	char pad_11C[0x4]; // 0x11c(0x04)
	struct UAnimSequenceBase* ; // 0x120(0x08)
	bool ; // 0x128(0x01)
	enum class EAnimSyncMethod ; // 0x129(0x01)
	enum class EAnimGroupRole ; // 0x12a(0x01)
	char pad_12B[0x5]; // 0x12b(0x05)
	struct FAnimNodeFunctionRef ; // 0x130(0x18)
	struct FName ; // 0x148(0x04)
	struct FName ; // 0x14c(0x04)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x150(0x80)
	struct FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0x1d0(0x18)
};

// ScriptStruct FloppingRabbitLayerAnimBP.FloppingRabbitLayerAnimBP_C.AnimBlueprintGeneratedMutableData
// Size: 0x06 (Inherited: 0x01)
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData {
	bool __BoolProperty; // 0x01(0x01)
	bool ; // 0x02(0x01)
	bool ; // 0x03(0x01)
	bool ; // 0x04(0x01)
	bool ; // 0x05(0x01)
};

