// AnimBlueprintGeneratedClass Fortnite_M_Avg_Player_AnimBlueprint.Fortnite_M_Avg_Player_AnimBlueprint_C
// Size: 0x11bb2 (Inherited: 0x1d40)
struct UFortnite_M_Avg_Player_AnimBlueprint_C : UFortPlayerAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x1d40(0x08)
	struct FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x1d48(0x570)
	struct FAnimSubsystemInstance AnimBlueprintExtension_Tag; // 0x22b8(0x08)
	struct FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x22c0(0x08)
	struct FAnimSubsystemInstance_NodeRelevancy AnimBlueprintExtension_NodeRelevancy; // 0x22c8(0xa8)
	struct FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x2370(0x08)
	struct FAnimNode_Root ; // 0x2378(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x2398(0xc0)
	struct FAnimNode_LinkedInputPose ; // 0x2458(0xc0)
	struct FAnimNode_Root ; // 0x2518(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x2538(0xc0)
	struct FAnimNode_Root ; // 0x25f8(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x2618(0xc0)
	struct FAnimNode_Root ; // 0x26d8(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x26f8(0xc0)
	struct FAnimNode_Root ; // 0x27b8(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x27d8(0xc0)
	struct FAnimNode_Root ; // 0x2898(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x28b8(0xc0)
	struct FAnimNode_LinkedInputPose ; // 0x2978(0xc0)
	struct FAnimNode_LinkedInputPose ; // 0x2a38(0xc0)
	struct FAnimNode_Root ; // 0x2af8(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x2b18(0xc0)
	struct FAnimNode_Root ; // 0x2bd8(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x2bf8(0xc0)
	struct FAnimNode_Root ; // 0x2cb8(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x2cd8(0xc0)
	struct FAnimNode_Root ; // 0x2d98(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x2db8(0xc0)
	struct FAnimNode_Root ; // 0x2e78(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x2e98(0xc0)
	struct FAnimNode_LinkedInputPose ; // 0x2f58(0xc0)
	struct FAnimNode_Root ; // 0x3018(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x3038(0xc0)
	struct FAnimNode_Root ; // 0x30f8(0x20)
	struct FAnimNode_SequencePlayer ; // 0x3118(0x40)
	struct FAnimNode_BlendListByBool ; // 0x3158(0x48)
	struct FAnimNode_RefPose ; // 0x31a0(0x10)
	struct FAnimNode_Root ; // 0x31b0(0x20)
	struct FAnimNode_SequencePlayer ; // 0x31d0(0x40)
	struct FAnimNode_BlendListByBool ; // 0x3210(0x48)
	struct FAnimNode_RefPose ; // 0x3258(0x10)
	struct FAnimNode_Root ; // 0x3268(0x20)
	struct FAnimNode_SequencePlayer ; // 0x3288(0x40)
	struct FAnimNode_BlendListByBool ; // 0x32c8(0x48)
	struct FAnimNode_RefPose ; // 0x3310(0x10)
	struct FAnimNode_Root ; // 0x3320(0x20)
	struct FAnimNode_SequencePlayer ; // 0x3340(0x40)
	struct FAnimNode_Root ; // 0x3380(0x20)
	struct FAnimNode_SequencePlayer ; // 0x33a0(0x40)
	struct FAnimNode_Root ; // 0x33e0(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x3400(0xc0)
	struct FAnimNode_Root ; // 0x34c0(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x34e0(0xc0)
	struct FAnimNode_Root ; // 0x35a0(0x20)
	struct FAnimNode_BlendListByBool ; // 0x35c0(0x48)
	struct FAnimNode_SequencePlayer ; // 0x3608(0x40)
	struct FAnimNode_SequencePlayer ; // 0x3648(0x40)
	struct FAnimNode_SequencePlayer ; // 0x3688(0x40)
	struct FAnimNode_BlendListByBool ; // 0x36c8(0x48)
	struct FAnimNode_SequencePlayer ; // 0x3710(0x40)
	struct FAnimNode_SequencePlayer ; // 0x3750(0x40)
	struct FAnimNode_BlendListByBool ; // 0x3790(0x48)
	struct FAnimNode_RefPose ; // 0x37d8(0x10)
	struct FAnimNode_BlendListByBool ; // 0x37e8(0x48)
	struct FAnimNode_SequencePlayer ; // 0x3830(0x40)
	struct FAnimNode_BlendListByEnum ; // 0x3870(0x48)
	struct FAnimNode_Root ; // 0x38b8(0x20)
	struct FAnimNode_BlendListByBool ; // 0x38d8(0x48)
	struct FAnimNode_SequencePlayer ; // 0x3920(0x40)
	struct FAnimNode_SequencePlayer ; // 0x3960(0x40)
	struct FAnimNode_SequencePlayer ; // 0x39a0(0x40)
	struct FAnimNode_BlendListByBool ; // 0x39e0(0x48)
	struct FAnimNode_SequencePlayer ; // 0x3a28(0x40)
	struct FAnimNode_SequencePlayer ; // 0x3a68(0x40)
	struct FAnimNode_BlendListByBool ; // 0x3aa8(0x48)
	struct FAnimNode_RefPose ; // 0x3af0(0x10)
	struct FAnimNode_BlendListByBool ; // 0x3b00(0x48)
	struct FAnimNode_SequencePlayer ; // 0x3b48(0x40)
	struct FAnimNode_BlendListByEnum ; // 0x3b88(0x48)
	struct FAnimNode_Root ; // 0x3bd0(0x20)
	struct FAnimNode_SequencePlayer ; // 0x3bf0(0x40)
	struct FAnimNode_BlendListByBool ; // 0x3c30(0x48)
	struct FAnimNode_SequencePlayer ; // 0x3c78(0x40)
	struct FAnimNode_SequencePlayer ; // 0x3cb8(0x40)
	struct FAnimNode_BlendListByBool ; // 0x3cf8(0x48)
	struct FAnimNode_SequencePlayer ; // 0x3d40(0x40)
	struct FAnimNode_BlendListByBool ; // 0x3d80(0x48)
	struct FAnimNode_SequencePlayer ; // 0x3dc8(0x40)
	struct FAnimNode_BlendListByBool ; // 0x3e08(0x48)
	struct FAnimNode_SequencePlayer ; // 0x3e50(0x40)
	struct FAnimNode_RefPose ; // 0x3e90(0x10)
	struct FAnimNode_BlendListByBool ; // 0x3ea0(0x48)
	struct FAnimNode_SequencePlayer ; // 0x3ee8(0x40)
	struct FAnimNode_BlendListByEnum ; // 0x3f28(0x48)
	struct FAnimNode_Root ; // 0x3f70(0x20)
	struct FAnimNode_BlendListByBool ; // 0x3f90(0x48)
	struct FAnimNode_SequencePlayer ; // 0x3fd8(0x40)
	struct FAnimNode_SequencePlayer ; // 0x4018(0x40)
	struct FAnimNode_SequencePlayer ; // 0x4058(0x40)
	struct FAnimNode_BlendListByBool ; // 0x4098(0x48)
	struct FAnimNode_SequencePlayer ; // 0x40e0(0x40)
	struct FAnimNode_SequencePlayer ; // 0x4120(0x40)
	struct FAnimNode_SequencePlayer ; // 0x4160(0x40)
	struct FAnimNode_BlendListByBool ; // 0x41a0(0x48)
	struct FAnimNode_BlendListByEnum ; // 0x41e8(0x48)
	struct FAnimNode_BlendListByEnum ; // 0x4230(0x48)
	struct FAnimNode_BlendListByEnum ; // 0x4278(0x48)
	struct FAnimNode_SequencePlayer ; // 0x42c0(0x40)
	struct FAnimNode_BlendListByBool ; // 0x4300(0x48)
	struct FAnimNode_SequencePlayer ; // 0x4348(0x40)
	struct FAnimNode_BlendListByBool ; // 0x4388(0x48)
	struct FAnimNode_SequencePlayer ; // 0x43d0(0x40)
	struct FAnimNode_BlendListByEnum ; // 0x4410(0x48)
	struct FAnimNode_SequencePlayer ; // 0x4458(0x40)
	struct FAnimNode_BlendListByBool ; // 0x4498(0x48)
	struct FAnimNode_SequencePlayer ; // 0x44e0(0x40)
	struct FAnimNode_BlendListByBool ; // 0x4520(0x48)
	struct FAnimNode_SequencePlayer ; // 0x4568(0x40)
	struct FAnimNode_BlendListByEnum ; // 0x45a8(0x48)
	struct FAnimNode_BlendListByBool ; // 0x45f0(0x48)
	struct FAnimNode_SequencePlayer ; // 0x4638(0x40)
	struct FAnimNode_SequencePlayer ; // 0x4678(0x40)
	struct FAnimNode_ModifyCurve ; // 0x46b8(0x100)
	struct FAnimNode_BlendListByEnum ; // 0x47b8(0x48)
	struct FAnimNode_SequencePlayer ; // 0x4800(0x40)
	struct FAnimNode_BlendListByBool ; // 0x4840(0x48)
	struct FAnimNode_SequencePlayer ; // 0x4888(0x40)
	struct FAnimNode_SequencePlayer ; // 0x48c8(0x40)
	struct FAnimNode_SequencePlayer ; // 0x4908(0x40)
	struct FAnimNode_BlendListByBool ; // 0x4948(0x48)
	struct FAnimNode_SequencePlayer ; // 0x4990(0x40)
	struct FAnimNode_BlendListByBool ; // 0x49d0(0x48)
	struct FAnimNode_SequencePlayer ; // 0x4a18(0x40)
	struct FAnimNode_Root ; // 0x4a58(0x20)
	struct FAnimNode_Root ; // 0x4a78(0x20)
	struct FAnimNode_Root ; // 0x4a98(0x20)
	struct FAnimNode_Root ; // 0x4ab8(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x4ad8(0xc0)
	struct FAnimNode_Root ; // 0x4b98(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x4bb8(0xc0)
	struct FAnimNode_Root ; // 0x4c78(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x4c98(0xc0)
	struct FAnimNode_Root ; // 0x4d58(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x4d78(0xc0)
	struct FAnimNode_LinkedInputPose ; // 0x4e38(0xc0)
	struct FAnimNode_LinkedInputPose ; // 0x4ef8(0xc0)
	struct FAnimNode_Root ; // 0x4fb8(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x4fd8(0xc0)
	struct FAnimNode_Root ; // 0x5098(0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNode_SubInput; // 0x50b8(0xc0)
	struct FAnimNode_LinkedInputPose ; // 0x5178(0xc0)
	struct FAnimNode_Root ; // 0x5238(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x5258(0xc0)
	struct FAnimNode_BlendListByBool ; // 0x5318(0x48)
	struct FAnimNode_LinkedAnimGraph ; // 0x5360(0xb8)
	struct FAnimNode_ApplyAdditive ; // 0x5418(0xc8)
	struct FAnimNode_SaveCachedPose ; // 0x54e0(0x100)
	struct FAnimNode_UseCachedPose ; // 0x55e0(0x28)
	struct FAnimNode_UseCachedPose ; // 0x5608(0x28)
	struct FAnimNode_Root ; // 0x5630(0x20)
	struct FAnimNode_LinkedAnimGraph ; // 0x5650(0xb8)
	struct FAnimNode_LinkedInputPose ; // 0x5708(0xc0)
	struct FAnimNode_ApplyAdditive ; // 0x57c8(0xc8)
	struct FAnimNode_SaveCachedPose ; // 0x5890(0x100)
	struct FAnimNode_UseCachedPose ; // 0x5990(0x28)
	struct FAnimNode_BlendListByBool ; // 0x59b8(0x48)
	struct FAnimNode_UseCachedPose ; // 0x5a00(0x28)
	struct FAnimNode_Root ; // 0x5a28(0x20)
	struct FAnimNode_LayeredBoneBlend ; // 0x5a48(0xe0)
	struct FAnimNode_RefPose ; // 0x5b28(0x10)
	struct FAnimNode_SaveCachedPose ; // 0x5b38(0x100)
	struct FAnimNode_BlendSpacePlayer ; // 0x5c38(0x68)
	struct FAnimNode_SaveCachedPose ; // 0x5ca0(0x100)
	struct FAnimNode_LinkedInputPose ; // 0x5da0(0xc0)
	struct FAnimNode_ApplyAdditive ; // 0x5e60(0xc8)
	struct FAnimNode_LayeredBoneBlend ; // 0x5f28(0xe0)
	struct FAnimNode_RefPose ; // 0x6008(0x10)
	struct FAnimNode_BlendListByBool ; // 0x6018(0x48)
	struct FAnimNode_UseCachedPose ; // 0x6060(0x28)
	struct FAnimNode_UseCachedPose ; // 0x6088(0x28)
	struct FAnimNode_Slot ; // 0x60b0(0x48)
	struct FAnimNode_Slot ; // 0x60f8(0x48)
	struct FAnimNode_BlendListByBool ; // 0x6140(0x48)
	struct FAnimNode_Slot ; // 0x6188(0x48)
	struct FAnimNode_ConvertComponentToLocalSpace ; // 0x61d0(0x20)
	struct FAnimNode_Slot ; // 0x61f0(0x48)
	struct FAnimNode_HandIKRetargeting AnimGraphNode_HandIKRetargeting; // 0x6238(0x110)
	struct FAnimNode_Slot ; // 0x6348(0x48)
	struct FAnimNode_ConvertLocalToComponentSpace ; // 0x6390(0x20)
	struct FAnimNode_StateResult ; // 0x63b0(0x20)
	struct FAnimNode_StateMachine ; // 0x63d0(0xc8)
	struct FAnimNode_SequencePlayer ; // 0x6498(0x40)
	struct FAnimNode_BlendListByBool ; // 0x64d8(0x48)
	struct FAnimNode_SequencePlayer ; // 0x6520(0x40)
	struct FAnimNode_LayeredBoneBlend ; // 0x6560(0xe0)
	struct FAnimNode_SequencePlayer ; // 0x6640(0x40)
	struct FAnimNode_StateResult ; // 0x6680(0x20)
	struct FAnimNode_StateMachine ; // 0x66a0(0xc8)
	struct FAnimNode_TransitionResult ; // 0x6768(0x28)
	struct FAnimNode_TransitionResult ; // 0x6790(0x28)
	struct FAnimNode_TransitionResult ; // 0x67b8(0x28)
	struct FAnimNode_TransitionResult ; // 0x67e0(0x28)
	struct FAnimNode_TransitionResult ; // 0x6808(0x28)
	struct FAnimNode_TransitionResult ; // 0x6830(0x28)
	struct FAnimNode_TransitionResult ; // 0x6858(0x28)
	struct FAnimNode_TransitionResult ; // 0x6880(0x28)
	struct FAnimNode_TransitionResult ; // 0x68a8(0x28)
	struct FAnimNode_TransitionResult ; // 0x68d0(0x28)
	struct FAnimNode_TransitionResult ; // 0x68f8(0x28)
	struct FAnimNode_TransitionResult ; // 0x6920(0x28)
	struct FAnimNode_TransitionResult ; // 0x6948(0x28)
	struct FAnimNode_TransitionResult ; // 0x6970(0x28)
	struct FAnimNode_TransitionResult ; // 0x6998(0x28)
	struct FAnimNode_TransitionResult ; // 0x69c0(0x28)
	struct FAnimNode_TransitionResult ; // 0x69e8(0x28)
	struct FAnimNode_TransitionResult ; // 0x6a10(0x28)
	struct FAnimNode_TransitionResult ; // 0x6a38(0x28)
	struct FAnimNode_TransitionResult ; // 0x6a60(0x28)
	struct FAnimNode_TransitionResult ; // 0x6a88(0x28)
	struct FAnimNode_TransitionResult ; // 0x6ab0(0x28)
	struct FAnimNode_TransitionResult ; // 0x6ad8(0x28)
	struct FAnimNode_TransitionResult ; // 0x6b00(0x28)
	struct FAnimNode_TransitionResult ; // 0x6b28(0x28)
	struct FAnimNode_TransitionResult ; // 0x6b50(0x28)
	struct FAnimNode_TransitionResult ; // 0x6b78(0x28)
	struct FAnimNode_LinkedAnimLayer ; // 0x6ba0(0xc8)
	struct FAnimNode_StateResult ; // 0x6c68(0x20)
	struct FAnimNode_LinkedAnimLayer ; // 0x6c88(0xc8)
	struct FAnimNode_StateResult ; // 0x6d50(0x20)
	struct FAnimNode_LinkedAnimLayer ; // 0x6d70(0xc8)
	struct FAnimNode_StateResult ; // 0x6e38(0x20)
	struct FAnimNode_LinkedAnimLayer ; // 0x6e58(0xc8)
	struct FAnimNode_SequencePlayer ; // 0x6f20(0x40)
	struct FAnimNode_LayeredBoneBlend ; // 0x6f60(0xe0)
	struct FAnimNode_SequencePlayer ; // 0x7040(0x40)
	struct FAnimNode_SequencePlayer ; // 0x7080(0x40)
	struct FAnimNode_SequencePlayer ; // 0x70c0(0x40)
	struct FAnimNode_BlendListByEnum ; // 0x7100(0x48)
	struct FAnimNode_SequencePlayer ; // 0x7148(0x40)
	struct FAnimNode_TwoWayBlend ; // 0x7188(0xc0)
	struct FAnimNode_RefPose ; // 0x7248(0x10)
	struct FAnimNode_BlendListByBool ; // 0x7258(0x48)
	struct FAnimNode_StateResult ; // 0x72a0(0x20)
	struct FAnimNode_StateMachine ; // 0x72c0(0xc8)
	struct FAnimNode_StateResult ; // 0x7388(0x20)
	struct FAnimNode_TransitionResult ; // 0x73a8(0x28)
	struct FAnimNode_TransitionResult ; // 0x73d0(0x28)
	struct FAnimNode_BlendListByEnum ; // 0x73f8(0x48)
	struct FAnimNode_SequencePlayer ; // 0x7440(0x40)
	struct FAnimNode_SequencePlayer ; // 0x7480(0x40)
	struct FAnimNode_SequencePlayer ; // 0x74c0(0x40)
	struct FAnimNode_SequencePlayer ; // 0x7500(0x40)
	struct FAnimNode_BlendListByBool ; // 0x7540(0x48)
	struct FAnimNode_BlendListByBool ; // 0x7588(0x48)
	struct FAnimNode_BlendSpacePlayer ; // 0x75d0(0x68)
	struct FAnimNode_ApplyAdditive ; // 0x7638(0xc8)
	struct FAnimNode_StateResult ; // 0x7700(0x20)
	struct FAnimNode_BlendListByEnum ; // 0x7720(0x48)
	struct FAnimNode_SequencePlayer ; // 0x7768(0x40)
	struct FAnimNode_SequencePlayer ; // 0x77a8(0x40)
	struct FAnimNode_SequencePlayer ; // 0x77e8(0x40)
	struct FAnimNode_SequencePlayer ; // 0x7828(0x40)
	struct FAnimNode_BlendListByBool ; // 0x7868(0x48)
	struct FAnimNode_BlendListByBool ; // 0x78b0(0x48)
	struct FAnimNode_BlendSpacePlayer ; // 0x78f8(0x68)
	struct FAnimNode_ApplyAdditive ; // 0x7960(0xc8)
	struct FAnimNode_StateResult ; // 0x7a28(0x20)
	struct FAnimNode_StateMachine ; // 0x7a48(0xc8)
	struct FAnimNode_StateResult ; // 0x7b10(0x20)
	struct FAnimNode_RefPose ; // 0x7b30(0x10)
	struct FAnimNode_BlendListByBool ; // 0x7b40(0x48)
	struct FAnimNode_TransitionResult ; // 0x7b88(0x28)
	struct FAnimNode_TransitionResult ; // 0x7bb0(0x28)
	struct FAnimNode_TransitionResult ; // 0x7bd8(0x28)
	struct FAnimNode_TransitionResult ; // 0x7c00(0x28)
	struct FAnimNode_TransitionResult ; // 0x7c28(0x28)
	struct FAnimNode_TransitionResult ; // 0x7c50(0x28)
	struct FAnimNode_TransitionResult ; // 0x7c78(0x28)
	struct FAnimNode_RefPose ; // 0x7ca0(0x10)
	struct FAnimNode_StateResult ; // 0x7cb0(0x20)
	struct FAnimNode_TransitionResult ; // 0x7cd0(0x28)
	struct FAnimNode_LinkedAnimLayer ; // 0x7cf8(0xc8)
	struct FAnimNode_StateResult ; // 0x7dc0(0x20)
	struct FAnimNode_LinkedAnimLayer ; // 0x7de0(0xc8)
	struct FAnimNode_StateResult ; // 0x7ea8(0x20)
	struct FAnimNode_StateMachine ; // 0x7ec8(0xc8)
	struct FAnimNode_StateResult ; // 0x7f90(0x20)
	struct FAnimNode_TransitionResult ; // 0x7fb0(0x28)
	struct FAnimNode_TransitionResult ; // 0x7fd8(0x28)
	struct FAnimNode_TransitionResult ; // 0x8000(0x28)
	struct FAnimNode_TransitionResult ; // 0x8028(0x28)
	struct FAnimNode_TransitionResult ; // 0x8050(0x28)
	struct FAnimNode_TransitionResult ; // 0x8078(0x28)
	struct FAnimNode_TransitionResult ; // 0x80a0(0x28)
	struct FAnimNode_TransitionResult ; // 0x80c8(0x28)
	struct FAnimNode_TransitionResult ; // 0x80f0(0x28)
	struct FAnimNode_TransitionResult ; // 0x8118(0x28)
	struct FAnimNode_TransitionResult ; // 0x8140(0x28)
	struct FAnimNode_TransitionResult ; // 0x8168(0x28)
	struct FAnimNode_RefPose ; // 0x8190(0x10)
	struct FAnimNode_TwoWayBlend ; // 0x81a0(0xc0)
	struct FAnimNode_LinkedAnimLayer ; // 0x8260(0xc8)
	struct FAnimNode_LayeredBoneBlend ; // 0x8328(0xe0)
	struct FAnimNode_SequencePlayer ; // 0x8408(0x40)
	struct FAnimNode_UseCachedPose ; // 0x8448(0x28)
	struct FAnimNode_ApplyAdditive ; // 0x8470(0xc8)
	struct FAnimNode_StateResult ; // 0x8538(0x20)
	struct FAnimNode_RefPose ; // 0x8558(0x10)
	struct FAnimNode_TwoWayBlend ; // 0x8568(0xc0)
	struct FAnimNode_LinkedAnimLayer ; // 0x8628(0xc8)
	struct FAnimNode_SequencePlayer ; // 0x86f0(0x40)
	struct FAnimNode_LayeredBoneBlend ; // 0x8730(0xe0)
	struct FAnimNode_UseCachedPose ; // 0x8810(0x28)
	struct FAnimNode_ApplyAdditive ; // 0x8838(0xc8)
	struct FAnimNode_StateResult ; // 0x8900(0x20)
	struct FAnimNode_RefPose ; // 0x8920(0x10)
	struct FAnimNode_TwoWayBlend ; // 0x8930(0xc0)
	struct FAnimNode_LinkedAnimLayer ; // 0x89f0(0xc8)
	struct FAnimNode_LayeredBoneBlend ; // 0x8ab8(0xe0)
	struct FAnimNode_SequencePlayer ; // 0x8b98(0x40)
	struct FAnimNode_UseCachedPose ; // 0x8bd8(0x28)
	struct FAnimNode_ApplyAdditive ; // 0x8c00(0xc8)
	struct FAnimNode_StateResult ; // 0x8cc8(0x20)
	struct FAnimNode_StateMachine ; // 0x8ce8(0xc8)
	struct FAnimNode_StateResult ; // 0x8db0(0x20)
	struct FAnimNode_TransitionResult ; // 0x8dd0(0x28)
	struct FAnimNode_StateMachine ; // 0x8df8(0xc8)
	struct FAnimNode_StateResult ; // 0x8ec0(0x20)
	struct FAnimNode_BlendSpacePlayer ; // 0x8ee0(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x8f48(0x68)
	struct FAnimNode_BlendListByBool ; // 0x8fb0(0x48)
	struct FAnimNode_BlendSpacePlayer ; // 0x8ff8(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x9060(0x68)
	struct FAnimNode_BlendListByEnum ; // 0x90c8(0x48)
	struct FAnimNode_BlendSpacePlayer ; // 0x9110(0x68)
	struct FAnimNode_SequencePlayer ; // 0x9178(0x40)
	struct FAnimNode_ApplyAdditive ; // 0x91b8(0xc8)
	struct FAnimNode_StateResult ; // 0x9280(0x20)
	struct FAnimNode_RefPose ; // 0x92a0(0x10)
	struct FAnimNode_StateResult ; // 0x92b0(0x20)
	struct FAnimNode_StateMachine ; // 0x92d0(0xc8)
	struct FAnimNode_LinkedAnimGraph ; // 0x9398(0xb8)
	struct FAnimNode_BlendListByBool ; // 0x9450(0x48)
	struct FAnimNode_Root ; // 0x9498(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x94b8(0xc0)
	struct FAnimNode_SaveCachedPose ; // 0x9578(0x100)
	struct FAnimNode_UseCachedPose ; // 0x9678(0x28)
	struct FAnimNode_SaveCachedPose ; // 0x96a0(0x100)
	struct FAnimNode_LinkedAnimGraph ; // 0x97a0(0xb8)
	struct FAnimNode_UseCachedPose ; // 0x9858(0x28)
	struct FAnimNode_LinkedAnimLayer ; // 0x9880(0xc8)
	struct FAnimNode_LinkedAnimLayer ; // 0x9948(0xc8)
	struct FAnimNode_LinkedAnimGraph ; // 0x9a10(0xb8)
	struct FAnimNode_UseCachedPose ; // 0x9ac8(0x28)
	struct FAnimNode_LinkedAnimLayer ; // 0x9af0(0xc8)
	struct FAnimNode_LinkedInputPose ; // 0x9bb8(0xc0)
	struct FAnimNode_SaveCachedPose ; // 0x9c78(0x100)
	struct FAnimNode_UseCachedPose ; // 0x9d78(0x28)
	struct FAnimNode_UseCachedPose ; // 0x9da0(0x28)
	struct FAnimNode_SaveCachedPose ; // 0x9dc8(0x100)
	struct FAnimNode_UseCachedPose ; // 0x9ec8(0x28)
	struct FAnimNode_UseCachedPose ; // 0x9ef0(0x28)
	struct FAnimNode_UseCachedPose ; // 0x9f18(0x28)
	struct FAnimNode_Slot ; // 0x9f40(0x48)
	struct FAnimNode_BlendListByBool ; // 0x9f88(0x48)
	struct FAnimNode_UseCachedPose ; // 0x9fd0(0x28)
	struct FAnimNode_UseCachedPose ; // 0x9ff8(0x28)
	struct FAnimNode_SaveCachedPose ; // 0xa020(0x100)
	struct FAnimNode_Root ; // 0xa120(0x20)
	struct FAnimNode_TransitionResult ; // 0xa140(0x28)
	struct FAnimNode_TransitionResult ; // 0xa168(0x28)
	struct FAnimNode_TransitionResult ; // 0xa190(0x28)
	struct FAnimNode_TransitionResult ; // 0xa1b8(0x28)
	struct FAnimNode_BlendSpacePlayer ; // 0xa1e0(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0xa248(0x68)
	struct FAnimNode_BlendListByBool ; // 0xa2b0(0x48)
	struct FAnimNode_BlendListByBool ; // 0xa2f8(0x48)
	struct FAnimNode_BlendSpacePlayer ; // 0xa340(0x68)
	struct FAnimNode_StateResult ; // 0xa3a8(0x20)
	struct FAnimNode_BlendSpacePlayer ; // 0xa3c8(0x68)
	struct FAnimNode_BlendListByBool ; // 0xa430(0x48)
	struct FAnimNode_BlendSpacePlayer ; // 0xa478(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0xa4e0(0x68)
	struct FAnimNode_BlendListByBool ; // 0xa548(0x48)
	struct FAnimNode_BlendSpacePlayer ; // 0xa590(0x68)
	struct FAnimNode_BlendListByBool ; // 0xa5f8(0x48)
	struct FAnimNode_BlendSpacePlayer ; // 0xa640(0x68)
	struct FAnimNode_BlendListByEnum ; // 0xa6a8(0x48)
	struct FAnimNode_BlendSpacePlayer ; // 0xa6f0(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0xa758(0x68)
	struct FAnimNode_BlendListByBool ; // 0xa7c0(0x48)
	struct FAnimNode_StateResult ; // 0xa808(0x20)
	struct FAnimNode_TransitionResult ; // 0xa828(0x28)
	struct FAnimNode_StateMachine ; // 0xa850(0xc8)
	struct FAnimNode_BlendSpacePlayer ; // 0xa918(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0xa980(0x68)
	struct FAnimNode_BlendListByBool ; // 0xa9e8(0x48)
	struct FAnimNode_BlendListByBool ; // 0xaa30(0x48)
	struct FAnimNode_BlendSpacePlayer ; // 0xaa78(0x68)
	struct FAnimNode_BlendListByBool ; // 0xaae0(0x48)
	struct FAnimNode_BlendSpacePlayer ; // 0xab28(0x68)
	struct FAnimNode_BlendListByBool ; // 0xab90(0x48)
	struct FAnimNode_BlendSpacePlayer ; // 0xabd8(0x68)
	struct FAnimNode_BlendListByBool ; // 0xac40(0x48)
	struct FAnimNode_BlendSpacePlayer ; // 0xac88(0x68)
	struct FAnimNode_BlendListByEnum ; // 0xacf0(0x48)
	struct FAnimNode_BlendSpacePlayer ; // 0xad38(0x68)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0xada0(0x68)
	struct FAnimNode_BlendListByBool ; // 0xae08(0x48)
	struct FAnimNode_StateResult ; // 0xae50(0x20)
	struct FAnimNode_StateMachine ; // 0xae70(0xc8)
	struct FAnimNode_SaveCachedPose ; // 0xaf38(0x100)
	struct FAnimNode_LinkedAnimLayer ; // 0xb038(0xc8)
	struct FAnimNode_RefPose ; // 0xb100(0x10)
	struct FAnimNode_LayeredBoneBlend ; // 0xb110(0xe0)
	struct FAnimNode_RefPose ; // 0xb1f0(0x10)
	struct FAnimNode_LayeredBoneBlend ; // 0xb200(0xe0)
	struct FAnimNode_RefPose ; // 0xb2e0(0x10)
	struct FAnimNode_LayeredBoneBlend ; // 0xb2f0(0xe0)
	struct FAnimNode_TransitionResult ; // 0xb3d0(0x28)
	struct FAnimNode_TransitionResult ; // 0xb3f8(0x28)
	struct FAnimNode_TransitionResult ; // 0xb420(0x28)
	struct FAnimNode_TransitionResult ; // 0xb448(0x28)
	struct FAnimNode_TransitionResult ; // 0xb470(0x28)
	struct FAnimNode_TransitionResult ; // 0xb498(0x28)
	struct FAnimNode_TransitionResult ; // 0xb4c0(0x28)
	struct FAnimNode_TransitionResult ; // 0xb4e8(0x28)
	struct FAnimNode_TransitionResult ; // 0xb510(0x28)
	struct FAnimNode_TransitionResult ; // 0xb538(0x28)
	struct FAnimNode_TransitionResult ; // 0xb560(0x28)
	struct FAnimNode_TransitionResult ; // 0xb588(0x28)
	struct FAnimNode_TransitionResult ; // 0xb5b0(0x28)
	struct FAnimNode_TransitionResult ; // 0xb5d8(0x28)
	struct FAnimNode_TransitionResult ; // 0xb600(0x28)
	struct FAnimNode_TransitionResult ; // 0xb628(0x28)
	struct FAnimNode_TransitionResult ; // 0xb650(0x28)
	struct FAnimNode_TransitionResult ; // 0xb678(0x28)
	struct FAnimNode_TransitionResult ; // 0xb6a0(0x28)
	struct FAnimNode_SequencePlayer ; // 0xb6c8(0x40)
	struct FAnimNode_SequencePlayer ; // 0xb708(0x40)
	struct FAnimNode_SequencePlayer ; // 0xb748(0x40)
	struct FAnimNode_SequencePlayer ; // 0xb788(0x40)
	struct FAnimNode_SequencePlayer ; // 0xb7c8(0x40)
	struct FAnimNode_SequencePlayer ; // 0xb808(0x40)
	struct FAnimNode_SequencePlayer ; // 0xb848(0x40)
	struct FAnimNode_BlendListByEnum ; // 0xb888(0x48)
	struct FAnimNode_SequencePlayer ; // 0xb8d0(0x40)
	struct FAnimNode_StateResult ; // 0xb910(0x20)
	struct FAnimNode_UseCachedPose ; // 0xb930(0x28)
	struct FAnimNode_BlendListByEnum ; // 0xb958(0x48)
	struct FAnimNode_LayeredBoneBlend ; // 0xb9a0(0xe0)
	struct FAnimNode_SequencePlayer ; // 0xba80(0x40)
	struct FAnimNode_SequencePlayer ; // 0xbac0(0x40)
	struct FAnimNode_SequencePlayer ; // 0xbb00(0x40)
	struct FAnimNode_SequencePlayer ; // 0xbb40(0x40)
	struct FAnimNode_StateResult ; // 0xbb80(0x20)
	struct FAnimNode_UseCachedPose ; // 0xbba0(0x28)
	struct FAnimNode_BlendListByEnum ; // 0xbbc8(0x48)
	struct FAnimNode_LayeredBoneBlend ; // 0xbc10(0xe0)
	struct FAnimNode_SequencePlayer ; // 0xbcf0(0x40)
	struct FAnimNode_SequencePlayer ; // 0xbd30(0x40)
	struct FAnimNode_SequencePlayer ; // 0xbd70(0x40)
	struct FAnimNode_SequencePlayer ; // 0xbdb0(0x40)
	struct FAnimNode_StateResult ; // 0xbdf0(0x20)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve; // 0xbe10(0x100)
	struct FAnimNode_UseCachedPose ; // 0xbf10(0x28)
	struct FAnimNode_BlendListByEnum ; // 0xbf38(0x48)
	struct FAnimNode_SequencePlayer ; // 0xbf80(0x40)
	struct FAnimNode_BlendListByBool ; // 0xbfc0(0x48)
	struct FAnimNode_LayeredBoneBlend ; // 0xc008(0xe0)
	struct FAnimNode_SequencePlayer ; // 0xc0e8(0x40)
	struct FAnimNode_SequencePlayer ; // 0xc128(0x40)
	struct FAnimNode_SequencePlayer ; // 0xc168(0x40)
	struct FAnimNode_SequencePlayer ; // 0xc1a8(0x40)
	struct FAnimNode_StateResult ; // 0xc1e8(0x20)
	struct FAnimNode_UseCachedPose ; // 0xc208(0x28)
	struct FAnimNode_BlendListByEnum ; // 0xc230(0x48)
	struct FAnimNode_TwoWayBlend ; // 0xc278(0xc0)
	struct FAnimNode_SequencePlayer ; // 0xc338(0x40)
	struct FAnimNode_LayeredBoneBlend ; // 0xc378(0xe0)
	struct FAnimNode_SequencePlayer ; // 0xc458(0x40)
	struct FAnimNode_SequencePlayer ; // 0xc498(0x40)
	struct FAnimNode_SequencePlayer ; // 0xc4d8(0x40)
	struct FAnimNode_SequencePlayer ; // 0xc518(0x40)
	struct FAnimNode_StateResult ; // 0xc558(0x20)
	struct FAnimNode_TwoWayBlend ; // 0xc578(0xc0)
	struct FAnimNode_SequencePlayer ; // 0xc638(0x40)
	struct FAnimNode_SequencePlayer ; // 0xc678(0x40)
	struct FAnimNode_StateResult ; // 0xc6b8(0x20)
	struct FAnimNode_StateMachine ; // 0xc6d8(0xc8)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0xc7a0(0xc0)
	struct FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0xc860(0x10)
	struct FAnimNode_SequencePlayer ; // 0xc870(0x40)
	struct FAnimNode_BlendListByBool ; // 0xc8b0(0x48)
	struct FAnimNode_LinkedAnimLayer ; // 0xc8f8(0xc8)
	struct FAnimNode_StateResult ; // 0xc9c0(0x20)
	struct FAnimNode_UseCachedPose ; // 0xc9e0(0x28)
	struct FAnimNode_StateResult ; // 0xca08(0x20)
	struct FAnimNode_StateMachine ; // 0xca28(0xc8)
	struct FAnimNode_StateResult ; // 0xcaf0(0x20)
	struct FAnimNode_StateMachine ; // 0xcb10(0xc8)
	struct FAnimNode_SaveCachedPose ; // 0xcbd8(0x100)
	struct FAnimNode_Root ; // 0xccd8(0x20)
	struct FAnimNode_LinkedInputPose ; // 0xccf8(0xc0)
	struct FAnimNode_LinkedInputPose ; // 0xcdb8(0xc0)
	struct FAnimNode_RotateRootBone ; // 0xce78(0xa8)
	struct FAnimNode_BlendListByBool ; // 0xcf20(0x48)
	struct FAnimNode_SaveCachedPose ; // 0xcf68(0x100)
	struct FAnimNode_UseCachedPose ; // 0xd068(0x28)
	struct FAnimNode_UseCachedPose ; // 0xd090(0x28)
	struct FAnimNode_LayeredBoneBlend ; // 0xd0b8(0xe0)
	struct FAnimNode_Root ; // 0xd198(0x20)
	struct FAnimNode_LinkedInputPose ; // 0xd1b8(0xc0)
	struct FAnimNode_Slot ; // 0xd278(0x48)
	struct FAnimNode_SaveCachedPose ; // 0xd2c0(0x100)
	struct FAnimNode_Slot ; // 0xd3c0(0x48)
	struct FAnimNode_SaveCachedPose ; // 0xd408(0x100)
	struct FAnimNode_UseCachedPose ; // 0xd508(0x28)
	struct FAnimNode_BlendListByBool ; // 0xd530(0x48)
	struct FAnimNode_UseCachedPose ; // 0xd578(0x28)
	struct FAnimNode_Slot ; // 0xd5a0(0x48)
	struct FAnimNode_UseCachedPose ; // 0xd5e8(0x28)
	struct FAnimNode_UseCachedPose ; // 0xd610(0x28)
	struct FAnimNode_UseCachedPose ; // 0xd638(0x28)
	struct FAnimNode_UseCachedPose ; // 0xd660(0x28)
	struct FAnimNode_SequencePlayer ; // 0xd688(0x40)
	struct FAnimNode_SequencePlayer ; // 0xd6c8(0x40)
	struct FAnimNode_SequencePlayer ; // 0xd708(0x40)
	struct FAnimNode_BlendListByBool ; // 0xd748(0x48)
	struct FAnimNode_BlendListByBool ; // 0xd790(0x48)
	struct FAnimNode_SequencePlayer ; // 0xd7d8(0x40)
	struct FAnimNode_SequencePlayer ; // 0xd818(0x40)
	struct FAnimNode_BlendListByBool ; // 0xd858(0x48)
	struct FAnimNode_ApplyAdditive ; // 0xd8a0(0xc8)
	struct FAnimNode_ApplyAdditive ; // 0xd968(0xc8)
	struct FAnimNode_Slot ; // 0xda30(0x48)
	struct FAnimNode_BlendListByEnum ; // 0xda78(0x48)
	struct FAnimNode_LayeredBoneBlend ; // 0xdac0(0xe0)
	struct FAnimNode_SequencePlayer ; // 0xdba0(0x40)
	struct FAnimNode_ApplyAdditive ; // 0xdbe0(0xc8)
	struct FAnimNode_LayeredBoneBlend ; // 0xdca8(0xe0)
	struct FAnimNode_StateResult ; // 0xdd88(0x20)
	struct FAnimNode_StateMachine ; // 0xdda8(0xc8)
	struct FAnimNode_UseCachedPose ; // 0xde70(0x28)
	struct FAnimNode_SaveCachedPose ; // 0xde98(0x100)
	struct FAnimNode_Root ; // 0xdf98(0x20)
	struct FAnimNode_RotationOffsetBlendSpace ; // 0xdfb8(0x110)
	struct FAnimNode_BlendListByBool ; // 0xe0c8(0x48)
	struct FAnimNode_BlendListByBool ; // 0xe110(0x48)
	struct FAnimNode_RotationOffsetBlendSpace ; // 0xe158(0x110)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace; // 0xe268(0x110)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0xe378(0xc0)
	struct FAnimNode_SaveCachedPose ; // 0xe438(0x100)
	struct FAnimNode_UseCachedPose ; // 0xe538(0x28)
	struct FAnimNode_UseCachedPose ; // 0xe560(0x28)
	struct FAnimNode_UseCachedPose ; // 0xe588(0x28)
	struct FAnimNode_Root AnimGraphNode_Root; // 0xe5b0(0x20)
	struct FAnimNode_Slot ; // 0xe5d0(0x48)
	struct FAnimNode_SaveCachedPose ; // 0xe618(0x100)
	struct FAnimNode_TransitionResult ; // 0xe718(0x28)
	struct FAnimNode_TransitionResult ; // 0xe740(0x28)
	struct FAnimNode_TransitionResult ; // 0xe768(0x28)
	struct FAnimNode_TransitionResult ; // 0xe790(0x28)
	struct FAnimNode_TransitionResult ; // 0xe7b8(0x28)
	struct FAnimNode_TransitionResult ; // 0xe7e0(0x28)
	struct FAnimNode_TransitionResult ; // 0xe808(0x28)
	struct FAnimNode_TransitionResult ; // 0xe830(0x28)
	struct FAnimNode_TransitionResult ; // 0xe858(0x28)
	struct FAnimNode_TransitionResult ; // 0xe880(0x28)
	struct FAnimNode_TransitionResult ; // 0xe8a8(0x28)
	struct FAnimNode_TransitionResult ; // 0xe8d0(0x28)
	struct FAnimNode_TransitionResult ; // 0xe8f8(0x28)
	struct FAnimNode_TransitionResult ; // 0xe920(0x28)
	struct FAnimNode_TransitionResult ; // 0xe948(0x28)
	struct FAnimNode_TransitionResult ; // 0xe970(0x28)
	struct FAnimNode_TransitionResult ; // 0xe998(0x28)
	struct FAnimNode_TransitionResult ; // 0xe9c0(0x28)
	struct FAnimNode_TransitionResult ; // 0xe9e8(0x28)
	struct FAnimNode_TransitionResult ; // 0xea10(0x28)
	struct FAnimNode_LinkedAnimGraph ; // 0xea38(0xb8)
	struct FAnimNode_BlendListByBool ; // 0xeaf0(0x48)
	struct FAnimNode_UseCachedPose ; // 0xeb38(0x28)
	struct FAnimNode_UseCachedPose ; // 0xeb60(0x28)
	struct FAnimNode_LinkedAnimLayer ; // 0xeb88(0xc8)
	struct FAnimNode_LinkedAnimLayer ; // 0xec50(0xc8)
	struct FAnimNode_ApplyAdditive ; // 0xed18(0xc8)
	struct FAnimNode_StateResult ; // 0xede0(0x20)
	struct FAnimNode_UseCachedPose ; // 0xee00(0x28)
	struct FAnimNode_LinkedAnimGraph ; // 0xee28(0xb8)
	struct FAnimNode_StateResult ; // 0xeee0(0x20)
	struct FAnimNode_TransitionResult ; // 0xef00(0x28)
	struct FAnimNode_StateMachine ; // 0xef28(0xc8)
	struct FAnimNode_StateResult ; // 0xeff0(0x20)
	struct FAnimNode_TransitionResult ; // 0xf010(0x28)
	struct FAnimNode_TransitionResult ; // 0xf038(0x28)
	struct FAnimNode_TransitionResult ; // 0xf060(0x28)
	struct FAnimNode_TransitionResult ; // 0xf088(0x28)
	struct FAnimNode_TransitionResult ; // 0xf0b0(0x28)
	struct FAnimNode_SequencePlayer ; // 0xf0d8(0x40)
	struct FAnimNode_StateResult ; // 0xf118(0x20)
	struct FAnimNode_TransitionResult ; // 0xf138(0x28)
	struct FAnimNode_SequencePlayer ; // 0xf160(0x40)
	struct FAnimNode_StateResult ; // 0xf1a0(0x20)
	struct FAnimNode_SequencePlayer ; // 0xf1c0(0x40)
	struct FAnimNode_StateResult ; // 0xf200(0x20)
	struct FAnimNode_StateMachine ; // 0xf220(0xc8)
	struct FAnimNode_StateResult ; // 0xf2e8(0x20)
	struct FAnimNode_TransitionResult ; // 0xf308(0x28)
	struct FAnimNode_SequencePlayer ; // 0xf330(0x40)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0xf370(0x48)
	struct FAnimNode_SequencePlayer ; // 0xf3b8(0x40)
	struct FAnimNode_StateResult ; // 0xf3f8(0x20)
	struct FAnimNode_SequencePlayer ; // 0xf418(0x40)
	struct FAnimNode_StateResult ; // 0xf458(0x20)
	struct FAnimNode_LinkedAnimGraph ; // 0xf478(0xb8)
	struct FAnimNode_StateResult ; // 0xf530(0x20)
	struct FAnimNode_SequencePlayer ; // 0xf550(0x40)
	struct FAnimNode_StateResult ; // 0xf590(0x20)
	struct FAnimNode_LinkedAnimGraph ; // 0xf5b0(0xb8)
	struct FAnimNode_StateResult ; // 0xf668(0x20)
	struct FAnimNode_StateMachine ; // 0xf688(0xc8)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone; // 0xf750(0xa8)
	struct FAnimNode_SaveCachedPose ; // 0xf7f8(0x100)
	struct FAnimNode_BlendListByBool ; // 0xf8f8(0x48)
	struct FAnimNode_UseCachedPose ; // 0xf940(0x28)
	struct FAnimNode_UseCachedPose ; // 0xf968(0x28)
	struct FAnimNode_UseCachedPose ; // 0xf990(0x28)
	struct FAnimNode_RefPose ; // 0xf9b8(0x10)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0xf9c8(0xc8)
	struct FAnimNode_UseCachedPose ; // 0xfa90(0x28)
	struct FAnimNode_UseCachedPose ; // 0xfab8(0x28)
	struct FAnimNode_UseCachedPose ; // 0xfae0(0x28)
	struct FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt; // 0xfb08(0x48)
	struct FAnimNode_StateResult ; // 0xfb50(0x20)
	struct FAnimNode_StateMachine ; // 0xfb70(0xc8)
	struct FAnimNode_LinkedAnimLayer ; // 0xfc38(0xc8)
	struct FAnimNode_Slot ; // 0xfd00(0x48)
	struct FAnimNode_SaveCachedPose ; // 0xfd48(0x100)
	struct FAnimNode_TransitionResult ; // 0xfe48(0x28)
	struct FAnimNode_TransitionResult ; // 0xfe70(0x28)
	struct FAnimNode_TransitionResult ; // 0xfe98(0x28)
	struct FAnimNode_TransitionResult ; // 0xfec0(0x28)
	struct FAnimNode_TransitionResult ; // 0xfee8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xff10(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xff38(0x40)
	struct FAnimNode_StateResult ; // 0xff78(0x20)
	struct FAnimNode_LinkedAnimLayer ; // 0xff98(0xc8)
	struct FAnimNode_RefPose AnimGraphNode_LocalRefPose; // 0x10060(0x10)
	struct FAnimNode_StateResult ; // 0x10070(0x20)
	struct FAnimNode_UseCachedPose ; // 0x10090(0x28)
	struct FAnimNode_UseCachedPose ; // 0x100b8(0x28)
	struct FAnimNode_BlendListByBool ; // 0x100e0(0x48)
	struct FAnimNode_Slot ; // 0x10128(0x48)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x10170(0x20)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x10190(0xc8)
	struct FAnimNode_LinkedAnimLayer ; // 0x10258(0xc8)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_Layer; // 0x10320(0xc8)
	struct FAnimNode_UseCachedPose ; // 0x103e8(0x28)
	struct FAnimNode_LinkedAnimLayer ; // 0x10410(0xc8)
	struct FAnimNode_SaveCachedPose ; // 0x104d8(0x100)
	struct FAnimNode_SaveCachedPose ; // 0x105d8(0x100)
	struct FAnimNode_UseCachedPose ; // 0x106d8(0x28)
	struct FAnimNode_UseCachedPose ; // 0x10700(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0x10728(0x48)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x10770(0xe0)
	struct FAnimNode_LinkedAnimLayer ; // 0x10850(0xc8)
	struct FAnimNode_LinkedAnimLayer ; // 0x10918(0xc8)
	struct FAnimNode_UseCachedPose ; // 0x109e0(0x28)
	struct FAnimNode_LinkedAnimGraph ; // 0x10a08(0xb8)
	struct FAnimNode_UseCachedPose ; // 0x10ac0(0x28)
	struct FAnimNode_LinkedAnimGraph ; // 0x10ae8(0xb8)
	struct FAnimNode_BlendListByBool ; // 0x10ba0(0x48)
	struct FAnimNode_SaveCachedPose ; // 0x10be8(0x100)
	struct FFortAnimNode_ScaleCharacterBones FortAnimGraphNode_ScaleCharacterBones; // 0x10ce8(0xd8)
	struct FAnimNode_Inertialization AnimGraphNode_Inertialization; // 0x10dc0(0x100)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x10ec0(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x10ee0(0x20)
	struct FAnimNode_LinkedAnimLayer ; // 0x10f00(0xc8)
	struct FAnimNode_LinkedAnimLayer ; // 0x10fc8(0xc8)
	struct FAnimNode_LinkedAnimLayer ; // 0x11090(0xc8)
	struct FAnimNode_UseCachedPose ; // 0x11158(0x28)
	struct FAnimNode_LinkedAnimLayer ; // 0x11180(0xc8)
	struct FAnimNode_LinkedAnimLayer ; // 0x11248(0xc8)
	struct FAnimNode_UseCachedPose ; // 0x11310(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x11338(0x28)
	struct FAnimNode_LinkedAnimGraph ; // 0x11360(0xb8)
	struct FAnimNode_BlendListByBool ; // 0x11418(0x48)
	struct FAnimNode_LinkedAnimLayer ; // 0x11460(0xc8)
	struct FAnimNode_LinkedAnimGraph AnimGraphNode_LinkedAnimGraph; // 0x11528(0xb8)
	struct FAnimNode_LinkedAnimLayer ; // 0x115e0(0xc8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x116a8(0x48)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x116f0(0xc8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x117b8(0x100)
	bool __CustomProperty_ParaGlide_TriggerAnim_EE06BC0D4AF7A3598BB824A5286F89C8; // 0x118b8(0x01)
	char pad_118B9[0x3]; // 0x118b9(0x03)
	struct FName __CustomProperty_EmoteAnimOffsetCurveName_D066576F42932FCE06C5E8B658C15225; // 0x118bc(0x04)
	struct FVector __CustomProperty_LeftHandOverride_D066576F42932FCE06C5E8B658C15225; // 0x118c0(0x18)
	struct FVector __CustomProperty_RightHandOverride_D066576F42932FCE06C5E8B658C15225; // 0x118d8(0x18)
	bool __CustomProperty_IsHidingInProp_D066576F42932FCE06C5E8B658C15225; // 0x118f0(0x01)
	char pad_118F1[0x3]; // 0x118f1(0x03)
	struct FFortAnimInput_AdjustedAim __CustomProperty_InputParam_72CED7AF4FEDEFE487025CB4B92A64EE; // 0x118f4(0x23c)
	struct FMulticastInlineDelegate MenuScreenDispatcher; // 0x11b30(0x10)
	double StartAnimBlendTime; // 0x11b40(0x08)
	double PivotAnimBlendTime; // 0x11b48(0x08)
	double CrouchPlayRate; // 0x11b50(0x08)
	bool IsSnowman; // 0x11b58(0x01)
	bool ShouldTrigerGrappleMontage; // 0x11b59(0x01)
	char pad_11B5A[0x6]; // 0x11b5a(0x06)
	struct FMulticastInlineDelegate Indigo_Boost; // 0x11b60(0x10)
	bool ParaGlide_UseAltGliderCam; // 0x11b70(0x01)
	char pad_11B71[0x7]; // 0x11b71(0x07)
	struct FVector LeftHandOverride; // 0x11b78(0x18)
	struct FVector RightHandOverride; // 0x11b90(0x18)
	bool ParaGlide_TriggerAnim; // 0x11ba8(0x01)
	char pad_11BA9[0x3]; // 0x11ba9(0x03)
	struct FName EmoteAnimOffsetCurveName; // 0x11bac(0x04)
	bool ExitLandingState; // 0x11bb0(0x01)
	bool IsHurdleFall; // 0x11bb1(0x01)

	void MovementMode_AimOffset(struct FPoseLink InAimOffsetsPose, struct FPoseLink InSourcePosePreAimOffsets, struct FPoseLink& MovementMode_AimOffset); // Function Fortnite_M_Avg_Player_AnimBlueprint.Fortnite_M_Avg_Player_AnimBlueprint_C.MovementMode_AimOffset // (HasOutParms|BlueprintCallable) // @ game+0xdef49c
	void MovementMode_FinalPoseOverride(struct FPoseLink InFinalPose, struct FPoseLink& MovementMode_FinalPoseOverride); // Function Fortnite_M_Avg_Player_AnimBlueprint.Fortnite_M_Avg_Player_AnimBlueprint_C.MovementMode_FinalPoseOverride // (HasOutParms|BlueprintCallable) // @ game+0xdef49c
	void MovementMode_FullBodyOverride(struct FPoseLink InputPoseFullBody, struct FPoseLink& MovementMode_FullBodyOverride); // Function Fortnite_M_Avg_Player_AnimBlueprint.Fortnite_M_Avg_Player_AnimBlueprint_C.MovementMode_FullBodyOverride // (HasOutParms|BlueprintCallable) // @ game+0xdef49c
