// AnimBlueprintGeneratedClass Fortnite_M_Avg_Player_Sprint_AnimBP.Fortnite_M_Avg_Player_Sprint_AnimBP_C
// Size: 0x1ba8 (Inherited: 0x6c0)
struct UFortnite_M_Avg_Player_Sprint_AnimBP_C : UFortSprintAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x6c0(0x08)
	struct FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x6c8(0x90)
	struct FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x758(0x08)
	struct FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x760(0x08)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x768(0x20)
	struct FAnimNode_TransitionResult ; // 0x788(0x28)
	struct FAnimNode_TransitionResult ; // 0x7b0(0x28)
	struct FAnimNode_TransitionResult ; // 0x7d8(0x28)
	struct FAnimNode_TransitionResult ; // 0x800(0x28)
	struct FAnimNode_TransitionResult ; // 0x828(0x28)
	struct FAnimNode_TransitionResult ; // 0x850(0x28)
	struct FAnimNode_TransitionResult ; // 0x878(0x28)
	struct FAnimNode_TransitionResult ; // 0x8a0(0x28)
	struct FAnimNode_TransitionResult ; // 0x8c8(0x28)
	struct FAnimNode_TransitionResult ; // 0x8f0(0x28)
	struct FAnimNode_TransitionResult ; // 0x918(0x28)
	struct FAnimNode_SequencePlayer ; // 0x940(0x40)
	struct FAnimNode_StateResult ; // 0x980(0x20)
	struct FAnimNode_SequencePlayer ; // 0x9a0(0x40)
	struct FAnimNode_BlendListByBool ; // 0x9e0(0x48)
	struct FAnimNode_SequencePlayer ; // 0xa28(0x40)
	struct FAnimNode_StateResult ; // 0xa68(0x20)
	struct FAnimNode_BlendListByBool ; // 0xa88(0x48)
	struct FAnimNode_SequencePlayer ; // 0xad0(0x40)
	struct FAnimNode_SequencePlayer ; // 0xb10(0x40)
	struct FAnimNode_StateResult ; // 0xb50(0x20)
	struct FAnimNode_StateMachine ; // 0xb70(0xc8)
	struct FAnimNode_StateResult ; // 0xc38(0x20)
	struct FAnimNode_SequencePlayer ; // 0xc58(0x40)
	struct FAnimNode_SequencePlayer ; // 0xc98(0x40)
	struct FAnimNode_BlendListByBool ; // 0xcd8(0x48)
	struct FAnimNode_StateResult ; // 0xd20(0x20)
	struct FAnimNode_SequencePlayer ; // 0xd40(0x40)
	struct FAnimNode_SequencePlayer ; // 0xd80(0x40)
	struct FAnimNode_BlendListByBool ; // 0xdc0(0x48)
	struct FAnimNode_StateResult ; // 0xe08(0x20)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xe28(0x28)
	struct FAnimNode_StateMachine ; // 0xe50(0xc8)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone; // 0xf18(0xa8)
	struct FAnimNode_BlendSpacePlayer ; // 0xfc0(0x68)
	struct FAnimNode_ApplyAdditive ; // 0x1028(0xc8)
	struct FAnimNode_ApplyAdditive ; // 0x10f0(0xc8)
	struct FAnimNode_SequencePlayer ; // 0x11b8(0x40)
	struct FAnimNode_BlendListByBool ; // 0x11f8(0x48)
	struct FAnimNode_SequencePlayer ; // 0x1240(0x40)
	struct FAnimNode_SequencePlayer ; // 0x1280(0x40)
	struct FAnimNode_SequencePlayer ; // 0x12c0(0x40)
	struct FAnimNode_BlendListByBool ; // 0x1300(0x48)
	struct FAnimNode_ApplyAdditive ; // 0x1348(0xc8)
	struct FAnimNode_ApplyAdditive ; // 0x1410(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x14d8(0x40)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x1518(0xc8)
	struct FAnimNode_Slot ; // 0x15e0(0x48)
	struct FAnimNode_UseCachedPose ; // 0x1628(0x28)
	struct FAnimNode_LayeredBoneBlend ; // 0x1650(0xe0)
	struct FAnimNode_BlendSpacePlayer ; // 0x1730(0x68)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x1798(0x68)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1800(0x48)
	struct FAnimNode_UseCachedPose ; // 0x1848(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x1870(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0x1898(0x48)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x18e0(0xe0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x19c0(0x20)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x19e0(0xc8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x1aa8(0x100)

	void AnimGraph(struct FPoseLink& AnimGraph); // Function Fortnite_M_Avg_Player_Sprint_AnimBP.Fortnite_M_Avg_Player_Sprint_AnimBP_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xdef49c
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function Fortnite_M_Avg_Player_Sprint_AnimBP.Fortnite_M_Avg_Player_Sprint_AnimBP_C.BlueprintUpdateAnimation // (Event|Public|BlueprintEvent) // @ game+0xdef49c
	void ExecuteUbergraph_Fortnite_M_Avg_Player_Sprint_AnimBP(int32_t EntryPoint); // Function Fortnite_M_Avg_Player_Sprint_AnimBP.Fortnite_M_Avg_Player_Sprint_AnimBP_C.ExecuteUbergraph_Fortnite_M_Avg_Player_Sprint_AnimBP // (Final|UbergraphFunction) // @ game+0xdef49c
};

