// Class FortniteUI.FortHoldableButton
// Size: 0x1480 (Inherited: 0x13e0)
struct UFortHoldableButton : UCommonButtonBase {
	bool bIsHoldableButton; // 0x13e0(0x01)
	bool bBindHoldToAction; // 0x13e1(0x01)
	bool bIgnoreLongPress; // 0x13e2(0x01)
	bool bKeybindingTriggersHoldEvents; // 0x13e3(0x01)
	float HoldTime; // 0x13e4(0x04)
	float StartingHoldPercentage; // 0x13e8(0x04)
	float QualifyingHoldTime; // 0x13ec(0x04)
	bool bHoldCancelledFromMovement; // 0x13f0(0x01)
	char pad_13F1[0x7]; // 0x13f1(0x07)
	struct UCommonTextStyle* HoldPromptTextStyle; // 0x13f8(0x08)
	char pad_1400[0x80]; // 0x1400(0x80)

	void SetEnableButtonHold(bool bInEnableButtonHold); // Function FortniteUI.FortHoldableButton.SetEnableButtonHold // (Final|Native|Public|BlueprintCallable) // @ game+0x9fa1c3c
	void OnHoldRequiredChanged(bool bHoldRequired); // Function FortniteUI.FortHoldableButton.OnHoldRequiredChanged // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	bool GetIsHoldRequired(); // Function FortniteUI.FortHoldableButton.GetIsHoldRequired // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x26d8320
	struct UCommonTextStyle* GetHoldPromptTextStyle(); // Function FortniteUI.FortHoldableButton.GetHoldPromptTextStyle // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9f9eb54
	void BP_OnHoldStarted(float HoldPercentage, bool bInUseSecondaryHoldAnimation); // Function FortniteUI.FortHoldableButton.BP_OnHoldStarted // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void BP_OnHoldReset(); // Function FortniteUI.FortHoldableButton.BP_OnHoldReset // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void BP_OnHoldIncreased(float HoldPercentage); // Function FortniteUI.FortHoldableButton.BP_OnHoldIncreased // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void BP_OnHoldEnded(float HoldPercentage, bool bInUseSecondaryHoldAnimation); // Function FortniteUI.FortHoldableButton.BP_OnHoldEnded // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void BP_OnHoldDecreased(float HoldPercentage); // Function FortniteUI.FortHoldableButton.BP_OnHoldDecreased // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void BP_OnHoldCompleted(); // Function FortniteUI.FortHoldableButton.BP_OnHoldCompleted // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void BP_OnActionProgressIncreased(float HoldPercentage); // Function FortniteUI.FortHoldableButton.BP_OnActionProgressIncreased // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void BP_OnActionProgressDecreased(float HoldPercentage); // Function FortniteUI.FortHoldableButton.BP_OnActionProgressDecreased // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
};

// Class FortniteUI.FortActivatablePanel
// Size: 0x518 (Inherited: 0x4e0)
struct UFortActivatablePanel : UCommonActivatablePanelLegacy {
	char pad_4E0[0x8]; // 0x4e0(0x08)
	bool bIsPushedOnToContentPanelStack; // 0x4e8(0x01)
	bool bIsAlreadyOnContentPanelStack; // 0x4e9(0x01)
	enum class EInputPriority InputPriority; // 0x4ea(0x01)
	bool bIsClosableByPlayerInput; // 0x4eb(0x01)
	struct FPrimaryContentSetup PrimaryContentSetup; // 0x4ec(0x03)
	char pad_4EF[0x29]; // 0x4ef(0x29)

	void RestoreScrollWidget(struct UWidget* FallbackWidget); // Function FortniteUI.FortActivatablePanel.RestoreScrollWidget // (Final|Native|Public|BlueprintCallable) // @ game+0xa26ea48
	void RestoreCenterWidget(struct UWidget* FallbackWidget); // Function FortniteUI.FortActivatablePanel.RestoreCenterWidget // (Final|Native|Public|BlueprintCallable) // @ game+0xa26e9c8
	void AsyncPlaySound2D(struct UObject* WorldContextObject, struct TSoftObjectPtr<USoundBase> SoundToLoad, float VolumeMultiplier, float PitchMultiplier, float StartTime); // Function FortniteUI.FortActivatablePanel.AsyncPlaySound2D // (Final|BlueprintCosmetic|Native|Public|BlueprintCallable) // @ game+0x9f70b68
};

// Class FortniteUI.HUDWidgetBehavior
// Size: 0xb0 (Inherited: 0x28)
struct UHUDWidgetBehavior : UObject {
	struct FText HUDLayoutToolName; // 0x28(0x18)
	struct TArray<struct UFortMobileHudWidgetContentComponent*> HudWidgetContentComponents; // 0x40(0x10)
	struct TMap<struct FGameplayTag, struct FString> CustomPropertyDefaultOverrides; // 0x50(0x50)
	struct TArray<struct UFortMobileHUDWidgetBehaviorExtension*> BehaviorExtensions; // 0xa0(0x10)
};

// Class FortniteUI.FortMobileActionButtonBehavior
// Size: 0x110 (Inherited: 0xb0)
struct UFortMobileActionButtonBehavior : UHUDWidgetBehavior {
	struct TArray<struct FName> ActionNames; // 0xb0(0x10)
	struct UPaperSprite* Sprite; // 0xc0(0x08)
	struct FGameplayTag HUDLayoutToolSaveTag_Legacy; // 0xc8(0x04)
	char pad_CC[0x14]; // 0xcc(0x14)
	struct TArray<struct UFortMobileButtonBehaviorComponent*> ButtonBehaviorComponents; // 0xe0(0x10)
	struct TArray<struct UFortButtonBehaviorComponentOverride*> ButtonBehaviorComponentOverrides; // 0xf0(0x10)
	int32_t ForcedZOrder; // 0x100(0x04)
	char pad_104[0xc]; // 0x104(0x0c)
};

// Class FortniteUI.FortUIGameFeatureAction
// Size: 0x28 (Inherited: 0x28)
struct UFortUIGameFeatureAction : UGameFeatureAction {
};

// Class FortniteUI.FortGlobalSeasonResourceWidget
// Size: 0x290 (Inherited: 0x290)
struct UFortGlobalSeasonResourceWidget : UCommonUserWidget {
};

// Class FortniteUI.FortItemPreviewScreen
// Size: 0x668 (Inherited: 0x518)
struct UFortItemPreviewScreen : UFortActivatablePanel {
	char pad_518[0x10]; // 0x518(0x10)
	struct FDataTableRowHandle ItemViewUnifiedSupportsCameraControlInputAction; // 0x528(0x10)
	struct FDataTableRowHandle ItemViewUnifiedZoomInputAction; // 0x538(0x10)
	struct FDataTableRowHandle ItemViewZoomOutInputAction; // 0x548(0x10)
	struct FDataTableRowHandle ItemViewZoomInInputAction; // 0x558(0x10)
	struct FDataTableRowHandle ItemViewRotateInputAction; // 0x568(0x10)
	struct UWidgetAnimation* AnimationToHideItemInfo; // 0x578(0x08)
	bool bAutoShowDetails; // 0x580(0x01)
	bool bItemDetailsHidden; // 0x581(0x01)
	char pad_582[0x2]; // 0x582(0x02)
	float HideItemInfoHeaderDurationSecs; // 0x584(0x04)
	char pad_588[0x8]; // 0x588(0x08)
	bool bAllowItemRotation; // 0x590(0x01)
	bool bAllowItemZooming; // 0x591(0x01)
	enum class EFrontEndCamera FrontEndCamera; // 0x592(0x01)
	char pad_593[0x1]; // 0x593(0x01)
	struct FGameplayTag PreviewSceneChangerTag; // 0x594(0x04)
	struct FGameplayTag PreviewSceneChangerOverrideTag; // 0x598(0x04)
	char pad_59C[0x4]; // 0x59c(0x04)
	struct AFortItemPreviewSceneChanger* PreviewSceneChanger; // 0x5a0(0x08)
	struct UFortItemView* ItemViewObject; // 0x5a8(0x08)
	float CameraEntryTransitionDuration; // 0x5b0(0x04)
	char pad_5B4[0x4]; // 0x5b4(0x04)
	struct UCurveFloat* CameraEntryTransitionCurve; // 0x5b8(0x08)
	char pad_5C0[0x80]; // 0x5c0(0x80)
	struct UWidget* Widget_CameraFrame; // 0x640(0x08)
	struct UCommonButtonLegacy* Button_PreviewAction; // 0x648(0x08)
	struct UCommonButtonBase* Button_Camera; // 0x650(0x08)
	struct UCommonActivatableWidget* OverrideFocusWidget; // 0x658(0x08)
	struct UFortItemDownloadIndicator* ItemDownloadIndicator; // 0x660(0x08)

	void ShowItemDetails(); // Function FortniteUI.FortItemPreviewScreen.ShowItemDetails // (Final|Native|Public|BlueprintCallable) // @ game+0xa0167e8
	void OnPreviewActionButtonUpdated(struct FText& RowDisplayName); // Function FortniteUI.FortItemPreviewScreen.OnPreviewActionButtonUpdated // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xdef49c
	void HideItemDetails(); // Function FortniteUI.FortItemPreviewScreen.HideItemDetails // (Final|Native|Public|BlueprintCallable) // @ game+0xa0161b4
};

// Class FortniteUI.BattlePassScreenBase
// Size: 0x838 (Inherited: 0x668)
struct UBattlePassScreenBase : UFortItemPreviewScreen {
	struct FDataTableRowHandle RefundGiftToken; // 0x668(0x10)
	char pad_678[0x8]; // 0x678(0x08)
	struct TSoftClassPtr<UObject> SeasonLevelPurchaseScreenClass; // 0x680(0x28)
	struct TSoftClassPtr<UObject> SeasonAboutScreenClass; // 0x6a8(0x28)
	struct FGameplayTagContainer WrapPreviewExcludedTags; // 0x6d0(0x20)
	enum class EBattlePassView CurrentView; // 0x6f0(0x01)
	char pad_6F1[0x7]; // 0x6f1(0x07)
	struct UAthenaSeasonItemDefinition* SeasonData; // 0x6f8(0x08)
	struct AFortItemPreviewWorld* CachedVaultWorld; // 0x700(0x08)
	struct UFortAccountItemDefinition* LastViewedItem; // 0x708(0x08)
	char pad_710[0xd4]; // 0x710(0xd4)
	bool bShouldShowAboutModalInNewSeason; // 0x7e4(0x01)
	char pad_7E5[0x1b]; // 0x7e5(0x1b)
	struct TSoftClassPtr<UObject> SeasonMovieWidgetClass; // 0x800(0x28)
	struct UFortStreamMediaSource* VideoStream_Source; // 0x828(0x08)
	struct UCommonTextBlock* Text_DebugPreviewDetails; // 0x830(0x08)

	bool ShouldPlayBPVideo(bool bAllowUpdate); // Function FortniteUI.BattlePassScreenBase.ShouldPlayBPVideo // (Final|Native|Public|BlueprintCallable) // @ game+0x2be3018
	void OnViewReward(struct FFortRarityItemData Rarity, bool bNoReward, struct UFortItemDefinition* RewardItem); // Function FortniteUI.BattlePassScreenBase.OnViewReward // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnVariantUpdate(int32_t CurrentIndex, int32_t TotalNumVariants); // Function FortniteUI.BattlePassScreenBase.OnVariantUpdate // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnSetPurchasedAnnualPass(bool bIsPurchased); // Function FortniteUI.BattlePassScreenBase.OnSetPurchasedAnnualPass // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnSetDifferentBPText(); // Function FortniteUI.BattlePassScreenBase.OnSetDifferentBPText // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnRequestViewRewardComplete(); // Function FortniteUI.BattlePassScreenBase.OnRequestViewRewardComplete // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnRequestViewReward(); // Function FortniteUI.BattlePassScreenBase.OnRequestViewReward // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnNoCurrentSeason(); // Function FortniteUI.BattlePassScreenBase.OnNoCurrentSeason // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnBattlePassViewChanged(enum class EBattlePassView NewView); // Function FortniteUI.BattlePassScreenBase.OnBattlePassViewChanged // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	int32_t GetNumberOfRewardsToPurchase(); // Function FortniteUI.BattlePassScreenBase.GetNumberOfRewardsToPurchase // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xa1bc56c
};

// Class FortniteUI.FortHUDElementWidget
// Size: 0x2d0 (Inherited: 0x290)
struct UFortHUDElementWidget : UCommonUserWidget {
	char pad_290[0x8]; // 0x290(0x08)
	struct FGameplayTag ElementTag; // 0x298(0x04)
	char pad_29C[0x4]; // 0x29c(0x04)
	struct FGameplayTagContainer HUDElementTag; // 0x2a0(0x20)
	enum class ESlateVisibility HiddenVisibility; // 0x2c0(0x01)
	char pad_2C1[0x7]; // 0x2c1(0x07)
	struct UTutorialHighlight* TutorialHighlight; // 0x2c8(0x08)

	void OnVisibilitySetEvent(enum class ESlateVisibility InVisibility); // Function FortniteUI.FortHUDElementWidget.OnVisibilitySetEvent // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	bool HasAnyTags(struct FGameplayTagContainer& InTags); // Function FortniteUI.FortHUDElementWidget.HasAnyTags // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x9fa03dc
	void HandleOnHUDElementVisibilityChanged(struct FGameplayTagContainer& HiddenHUDElementTags); // Function FortniteUI.FortHUDElementWidget.HandleOnHUDElementVisibilityChanged // (RequiredAPI|Native|Protected|HasOutParms) // @ game+0x9fa0158
	void AppendHUDElementTags(struct FGameplayTagContainer& AdditionalTags); // Function FortniteUI.FortHUDElementWidget.AppendHUDElementTags // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x9f9d984
};

// Class FortniteUI.FortActorIndicatorWidget
// Size: 0x370 (Inherited: 0x2d0)
struct UFortActorIndicatorWidget : UFortHUDElementWidget {
	char pad_2D0[0x8]; // 0x2d0(0x08)
	struct AActor* IndicatedActor; // 0x2d8(0x08)
	struct UPrimitiveComponent* IndicatedActorComponent; // 0x2e0(0x08)
	struct FVector RelativeLocation; // 0x2e8(0x18)
	float MaxDistance; // 0x300(0x04)
	bool bClampOnScreen; // 0x304(0x01)
	bool bShowClampToScreenArrow; // 0x305(0x01)
	char pad_306[0x2]; // 0x306(0x02)
	struct FElevationArrowData ElevationArrowData; // 0x308(0x1c)
	bool bUseScreenSpacePosition; // 0x324(0x01)
	char pad_325[0x3]; // 0x325(0x03)
	struct FVector2D ScreenSpaceRelativeOffset; // 0x328(0x10)
	int32_t ScreenPriority; // 0x338(0x04)
	char pad_33C[0x34]; // 0x33c(0x34)

	void SetIndicatedActor(struct AActor* NewIndicatorActor); // Function FortniteUI.FortActorIndicatorWidget.SetIndicatedActor // (Native|Public|BlueprintCallable) // @ game+0x22964b0
	void OnTargetActorChanged(struct AActor* TargetedActor); // Function FortniteUI.FortActorIndicatorWidget.OnTargetActorChanged // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	bool IsIndicatingActor(struct AActor* OtherActor); // Function FortniteUI.FortActorIndicatorWidget.IsIndicatingActor // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9f73860
	void Init(struct AActor* TargetedActor); // Function FortniteUI.FortActorIndicatorWidget.Init // (Native|Public|BlueprintCallable) // @ game+0x9f72e3c
	void Deinit(); // Function FortniteUI.FortActorIndicatorWidget.Deinit // (Native|Public|BlueprintCallable) // @ game+0x9f7126c
};

// Class FortniteUI.FortRadialSlot
// Size: 0x1480 (Inherited: 0x1430)
struct UFortRadialSlot : UCommonButtonLegacy {
	char pad_1430[0x10]; // 0x1430(0x10)
	struct UCommonLazyImage* Image_Icon; // 0x1440(0x08)
	struct UCommonTextBlock* Text_Main; // 0x1448(0x08)
	struct UWidget* Overlay_EquippedItem; // 0x1450(0x08)
	struct TSoftObjectPtr<UTexture2D> LockedTexture; // 0x1458(0x28)
};

// Class FortniteUI.FortRadialPickerEntry
// Size: 0x1490 (Inherited: 0x1480)
struct UFortRadialPickerEntry : UFortRadialSlot {
	struct UHorizontalBox* HorizontalBox_EntryName; // 0x1480(0x08)
	char pad_1488[0x8]; // 0x1488(0x08)

	void OnAvailabilityChanged(bool bIsAvailable); // Function FortniteUI.FortRadialPickerEntry.OnAvailabilityChanged // (RequiredAPI|Event|Protected|BlueprintEvent) // @ game+0xdef49c
};

// Class FortniteUI.FortAthenaVehicleDashboardWidget
// Size: 0x438 (Inherited: 0x2d0)
struct UFortAthenaVehicleDashboardWidget : UFortHUDElementWidget {
	char pad_2D0[0xe4]; // 0x2d0(0xe4)
	bool bIsWidgetShowing; // 0x3b4(0x01)
	char pad_3B5[0x3]; // 0x3b5(0x03)
	struct AFortAthenaVehicle* CurrentVehicleActor; // 0x3b8(0x08)
	float CurrentSpeed; // 0x3c0(0x04)
	float TargetFuelPercent; // 0x3c4(0x04)
	float DisplayedFuelPercent; // 0x3c8(0x04)
	float FillBlendSpeed; // 0x3cc(0x04)
	float SpeedTextMaxInterpolationRate; // 0x3d0(0x04)
	char pad_3D4[0x4]; // 0x3d4(0x04)
	struct FGameplayTagContainer WidgetTagsToHideWhenVisible; // 0x3d8(0x20)
	char pad_3F8[0x4]; // 0x3f8(0x04)
	float HUDTopSpeed; // 0x3fc(0x04)
	enum class EHorizontalAlignment MobileFuelGaugeHorizontalAlignment; // 0x400(0x01)
	enum class EVerticalAlignment MobileFuelGaugeVerticalAlignment; // 0x401(0x01)
	char pad_402[0x2]; // 0x402(0x02)
	struct Fmargin MobileFuelGaugePadding; // 0x404(0x10)
	char pad_414[0x4]; // 0x414(0x04)
	struct UCommonNumericTextBlock* NumericText_Speed; // 0x418(0x08)
	struct UOverlay* Overlay_Gauge; // 0x420(0x08)
	struct UCommonTextBlock* Text_ItemName; // 0x428(0x08)
	char pad_430[0x8]; // 0x430(0x08)

	void UpdateSpeedometer(float NormalizedSpeed, float RawSpeed); // Function FortniteUI.FortAthenaVehicleDashboardWidget.UpdateSpeedometer // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void ShowNoFuelMessage(); // Function FortniteUI.FortAthenaVehicleDashboardWidget.ShowNoFuelMessage // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void SetVehicleUsesRechargableBoost(bool bUsesRechargeableBoost); // Function FortniteUI.FortAthenaVehicleDashboardWidget.SetVehicleUsesRechargableBoost // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void SetVehicleHasInfiniteFuel(bool bInfiniteFuel); // Function FortniteUI.FortAthenaVehicleDashboardWidget.SetVehicleHasInfiniteFuel // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void SetupVehicleFuelWidget(struct AActor* NewVehicle, bool bRequestShowWidget); // Function FortniteUI.FortAthenaVehicleDashboardWidget.SetupVehicleFuelWidget // (RequiredAPI|Native|Public) // @ game+0x9e65fe8
	void OnWidgetVisibilityChanged(bool bNewVisibility); // Function FortniteUI.FortAthenaVehicleDashboardWidget.OnWidgetVisibilityChanged // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnUpdateRechargeableBoostPercent(float BoostPercent); // Function FortniteUI.FortAthenaVehicleDashboardWidget.OnUpdateRechargeableBoostPercent // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnUpdateBoostChargePercent(float BoostPercent); // Function FortniteUI.FortAthenaVehicleDashboardWidget.OnUpdateBoostChargePercent // (RequiredAPI|Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnRPMChanged(float NormalizedRPM); // Function FortniteUI.FortAthenaVehicleDashboardWidget.OnRPMChanged // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnRechargableBoostFilled(); // Function FortniteUI.FortAthenaVehicleDashboardWidget.OnRechargableBoostFilled // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnPlayerFacingNameUpdated(); // Function FortniteUI.FortAthenaVehicleDashboardWidget.OnPlayerFacingNameUpdated // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnOutOfFuel(); // Function FortniteUI.FortAthenaVehicleDashboardWidget.OnOutOfFuel // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnLowFuel(); // Function FortniteUI.FortAthenaVehicleDashboardWidget.OnLowFuel // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnFuelValueChanged(float FuelPercentage, bool bIsLowOnFuel); // Function FortniteUI.FortAthenaVehicleDashboardWidget.OnFuelValueChanged // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnBoostStarted(); // Function FortniteUI.FortAthenaVehicleDashboardWidget.OnBoostStarted // (RequiredAPI|Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnBoostFinished(); // Function FortniteUI.FortAthenaVehicleDashboardWidget.OnBoostFinished // (RequiredAPI|Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnBoostChargeFilled(); // Function FortniteUI.FortAthenaVehicleDashboardWidget.OnBoostChargeFilled // (RequiredAPI|Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnAddedFuel(float NewFuelPercent); // Function FortniteUI.FortAthenaVehicleDashboardWidget.OnAddedFuel // (Final|Native|Public) // @ game+0x9e64248
	void HandleBoostStarted(); // Function FortniteUI.FortAthenaVehicleDashboardWidget.HandleBoostStarted // (Final|Native|Protected) // @ game+0x9e63830
	void HandleBoostFinished(); // Function FortniteUI.FortAthenaVehicleDashboardWidget.HandleBoostFinished // (Final|Native|Protected) // @ game+0x9e6381c
	struct AFortAthenaVehicle* GetVehicle(); // Function FortniteUI.FortAthenaVehicleDashboardWidget.GetVehicle // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x77c5654
	float GetHUDTopSpeed(); // Function FortniteUI.FortAthenaVehicleDashboardWidget.GetHUDTopSpeed // (RequiredAPI|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x9e63738
	void BP_HandleExtensionWidgetCreated(struct UUserWidget* Widget, enum class EUIExtensionSlot SlotType); // Function FortniteUI.FortAthenaVehicleDashboardWidget.BP_HandleExtensionWidgetCreated // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
};

// Class FortniteUI.PostGamePlacementOverlay
// Size: 0x2f0 (Inherited: 0x2d0)
struct UPostGamePlacementOverlay : UFortHUDElementWidget {
	struct AFortGameplayMutator* MutatorClassToWaitFor; // 0x2d0(0x08)
	char pad_2D8[0x18]; // 0x2d8(0x18)

	void ShowWinningPlacement(); // Function FortniteUI.PostGamePlacementOverlay.ShowWinningPlacement // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void ShowTiePlacement(); // Function FortniteUI.PostGamePlacementOverlay.ShowTiePlacement // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void ShowLosingPlacement(); // Function FortniteUI.PostGamePlacementOverlay.ShowLosingPlacement // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	bool ShouldShow(); // Function FortniteUI.PostGamePlacementOverlay.ShouldShow // (Final|RequiredAPI|Native|Public|Const) // @ game+0x9d9fb50
	bool NativeShouldShow(); // Function FortniteUI.PostGamePlacementOverlay.NativeShouldShow // (RequiredAPI|Native|Protected|Const) // @ game+0x68924fc
	void LocalPlacementChanged(); // Function FortniteUI.PostGamePlacementOverlay.LocalPlacementChanged // (Final|Native|Protected) // @ game+0x9d9f9e8
	bool BP_ShouldShow(); // Function FortniteUI.PostGamePlacementOverlay.BP_ShouldShow // (Native|Event|Protected|BlueprintEvent|Const) // @ game+0x248ecd4
};

// Class FortniteUI.FortWeaponReticleExtensionWidgetBase
// Size: 0x2e0 (Inherited: 0x2d0)
struct UFortWeaponReticleExtensionWidgetBase : UFortHUDElementWidget {
	struct AFortWeapon* CachedAssociatedWeapon; // 0x2d0(0x08)
	char pad_2D8[0x8]; // 0x2d8(0x08)

	void OnWeaponSingleFire(); // Function FortniteUI.FortWeaponReticleExtensionWidgetBase.OnWeaponSingleFire // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnWeaponReloadStarted(float ReloadTime, enum class EFortWeaponReloadType ReloadType); // Function FortniteUI.FortWeaponReticleExtensionWidgetBase.OnWeaponReloadStarted // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnWeaponReloadCancelled(); // Function FortniteUI.FortWeaponReticleExtensionWidgetBase.OnWeaponReloadCancelled // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnTargetingChanged(bool bIsADS); // Function FortniteUI.FortWeaponReticleExtensionWidgetBase.OnTargetingChanged // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnFullyExitVehicle(); // Function FortniteUI.FortWeaponReticleExtensionWidgetBase.OnFullyExitVehicle // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void HandleTargetingChanged(bool bNewIsADS); // Function FortniteUI.FortWeaponReticleExtensionWidgetBase.HandleTargetingChanged // (Final|Native|Protected) // @ game+0x9e3f5cc
	void HandleFullyExitVehicle(); // Function FortniteUI.FortWeaponReticleExtensionWidgetBase.HandleFullyExitVehicle // (Final|Native|Private) // @ game+0x9e3ecf4
	void HandleEnterVehiclePassenger(); // Function FortniteUI.FortWeaponReticleExtensionWidgetBase.HandleEnterVehiclePassenger // (Final|Native|Private) // @ game+0x9e3ec54
	void HandleEnterVehicleDriver(); // Function FortniteUI.FortWeaponReticleExtensionWidgetBase.HandleEnterVehicleDriver // (Final|Native|Private) // @ game+0x9e3ec38
	bool GetIsADS(); // Function FortniteUI.FortWeaponReticleExtensionWidgetBase.GetIsADS // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x9e3e094
	struct AFortWeapon* GetEquippedWeapon(); // Function FortniteUI.FortWeaponReticleExtensionWidgetBase.GetEquippedWeapon // (Final|RequiredAPI|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x9e3dfd4
};

// Class FortniteUI.FortMobileHUDWidgetBehaviorExtension
// Size: 0x40 (Inherited: 0x28)
struct UFortMobileHUDWidgetBehaviorExtension : UObject {
	struct TArray<struct UFortMobileHudWidgetContentComponent*> HudWidgetContentComponents; // 0x28(0x10)
	struct UHUDWidgetBehavior* OwnerWidgetBehavior; // 0x38(0x08)
};

// Class FortniteUI.FortMobileActionButtonBehaviorExtension
// Size: 0x70 (Inherited: 0x40)
struct UFortMobileActionButtonBehaviorExtension : UFortMobileHUDWidgetBehaviorExtension {
	struct TArray<struct FName> ActionNames; // 0x40(0x10)
	struct TArray<struct UFortMobileButtonBehaviorComponent*> ButtonBehaviorComponents; // 0x50(0x10)
	struct TArray<struct UFortButtonBehaviorComponentOverride*> ButtonBehaviorComponentOverrides; // 0x60(0x10)
};

// Class FortniteUI.AthenaQuickBarSlotButtonBase
// Size: 0x13f0 (Inherited: 0x13e0)
struct UAthenaQuickBarSlotButtonBase : UCommonButtonBase {
	enum class EFortQuickBars QuickbarIndex; // 0x13e0(0x01)
	char pad_13E1[0x3]; // 0x13e1(0x03)
	int32_t SlotIndex; // 0x13e4(0x04)
	struct UAthenaItemIcon* ItemIcon; // 0x13e8(0x08)

	void OnSlottedItemChanged(struct UFortItem* SlottedItem); // Function FortniteUI.AthenaQuickBarSlotButtonBase.OnSlottedItemChanged // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnOwnerDeactivated(); // Function FortniteUI.AthenaQuickBarSlotButtonBase.OnOwnerDeactivated // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnOwnerActivated(); // Function FortniteUI.AthenaQuickBarSlotButtonBase.OnOwnerActivated // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void HandleQuickbarContentsChanged(enum class EFortQuickBars InQuickBarIndex, struct TArray<int32_t>& ChangedSlots); // Function FortniteUI.AthenaQuickBarSlotButtonBase.HandleQuickbarContentsChanged // (Final|Native|Private|HasOutParms) // @ game+0x9dcd70c
	void HandleInventoryItemSelected(struct UFortItem* SelectedItem); // Function FortniteUI.AthenaQuickBarSlotButtonBase.HandleInventoryItemSelected // (Final|Native|Private) // @ game+0x9dccde8
};

// Class FortniteUI.AthenaQuickBarSlotExtensionWidgetBase
// Size: 0x298 (Inherited: 0x290)
struct UAthenaQuickBarSlotExtensionWidgetBase : UCommonUserWidget {
	char pad_290[0x8]; // 0x290(0x08)

	void OnOwnerUnhovered(); // Function FortniteUI.AthenaQuickBarSlotExtensionWidgetBase.OnOwnerUnhovered // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnOwnerSelected(); // Function FortniteUI.AthenaQuickBarSlotExtensionWidgetBase.OnOwnerSelected // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnOwnerHovered(); // Function FortniteUI.AthenaQuickBarSlotExtensionWidgetBase.OnOwnerHovered // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnOwnerDeselected(); // Function FortniteUI.AthenaQuickBarSlotExtensionWidgetBase.OnOwnerDeselected // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnOwnerDeactivated(); // Function FortniteUI.AthenaQuickBarSlotExtensionWidgetBase.OnOwnerDeactivated // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnOwnerActivated(); // Function FortniteUI.AthenaQuickBarSlotExtensionWidgetBase.OnOwnerActivated // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnItemChanged(struct UFortItem* Item); // Function FortniteUI.AthenaQuickBarSlotExtensionWidgetBase.OnItemChanged // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
};

// Class FortniteUI.FortGameSettingRegistryExtension
// Size: 0x28 (Inherited: 0x28)
struct UFortGameSettingRegistryExtension : UFortGameSettingRegistryExtensionBase {
};

// Class FortniteUI.CMSBackgroundWidget
// Size: 0x3e8 (Inherited: 0x3a8)
struct UCMSBackgroundWidget : UCommonActivatableWidget {
	char pad_3A8[0x18]; // 0x3a8(0x18)
	float OlderBackgroundStreamoutSeconds; // 0x3c0(0x04)
	bool bDeactivateOnClose; // 0x3c4(0x01)
	char pad_3C5[0x3]; // 0x3c5(0x03)
	struct UImage* Image_Background; // 0x3c8(0x08)
	struct UCommonButtonBase* Button_Close; // 0x3d0(0x08)
	struct UCommonButtonBase* Button_MobileClose; // 0x3d8(0x08)
	char pad_3E0[0x8]; // 0x3e0(0x08)

	void OnStartingDownloadBackground(); // Function FortniteUI.CMSBackgroundWidget.OnStartingDownloadBackground // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnDownloadBackgroundComplete(struct UTexture2D* NewBackground); // Function FortniteUI.CMSBackgroundWidget.OnDownloadBackgroundComplete // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
};

// Class FortniteUI.FortStandaloneFrontend
// Size: 0x5e0 (Inherited: 0x3a8)
struct UFortStandaloneFrontend : UCommonActivatableWidget {
	char pad_3A8[0x10]; // 0x3a8(0x10)
	bool bCosmeticRefreshOnClose; // 0x3b8(0x01)
	char pad_3B9[0x3]; // 0x3b9(0x03)
	float DelayCloseActionTimeSeconds; // 0x3bc(0x04)
	struct UFortPocketLevel* PocketLevel; // 0x3c0(0x08)
	struct UPocketLevelInstance* PocketLevelInstance; // 0x3c8(0x08)
	struct FVector CameraLevelLocation; // 0x3d0(0x18)
	struct FDataTableRowHandle BackActionRowHandle; // 0x3e8(0x10)
	struct UCommonWidgetSwitcherLegacy* Switcher_TabContent; // 0x3f8(0x08)
	struct UWidget* Content_LoadingIndicator; // 0x400(0x08)
	char pad_408[0x10]; // 0x408(0x10)
	bool bCloseOnDelayEnd; // 0x418(0x01)
	char pad_419[0x7]; // 0x419(0x07)
	struct FFortAthenaLoadout InitialLoadoutData; // 0x420(0x178)
	struct UCommonButtonBase* Button_CloseMobile; // 0x598(0x08)
	struct FMulticastInlineDelegate OnMenuClosed; // 0x5a0(0x10)
	char pad_5B0[0x10]; // 0x5b0(0x10)
	struct FPrimaryContentSetup PrimaryContentSetup; // 0x5c0(0x03)
	char pad_5C3[0x1d]; // 0x5c3(0x1d)

	void TriggerIncrementalGC(); // Function FortniteUI.FortStandaloneFrontend.TriggerIncrementalGC // (Final|Native|Static|Protected|BlueprintCallable) // @ game+0x9fd302c
	void OnLoadingIndicatorShown(bool bShown); // Function FortniteUI.FortStandaloneFrontend.OnLoadingIndicatorShown // (RequiredAPI|Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnCameraLevelLoaded(); // Function FortniteUI.FortStandaloneFrontend.OnCameraLevelLoaded // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnBeginLoadingCameraLevel(); // Function FortniteUI.FortStandaloneFrontend.OnBeginLoadingCameraLevel // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void HandleCloseRefreshComplete(struct AFortPlayerPawn* FortPawn); // Function FortniteUI.FortStandaloneFrontend.HandleCloseRefreshComplete // (Final|Native|Private) // @ game+0x9fcd3f8
	void HandleCloseAction(); // Function FortniteUI.FortStandaloneFrontend.HandleCloseAction // (Final|RequiredAPI|Native|Protected|BlueprintCallable) // @ game+0x9fcd3e4
};

// Class FortniteUI.FortTabButton
// Size: 0x1410 (Inherited: 0x13e0)
struct UFortTabButton : UCommonButtonBase {
	char pad_13E0[0x8]; // 0x13e0(0x08)
	struct UCommonLazyImage* LazyImage_Icon; // 0x13e8(0x08)
	struct UCommonTextBlock* Text_Title; // 0x13f0(0x08)
	struct FVector2D ImageSize_Mobile; // 0x13f8(0x10)
	char pad_1408[0x8]; // 0x1408(0x08)

	void SetTabLabelInfo_Implementation(struct FFortTabButtonLabelInfo& TabLabelInfo); // Function FortniteUI.FortTabButton.SetTabLabelInfo_Implementation // (RequiredAPI|Native|Protected|HasOutParms) // @ game+0xa299450
};

// Class FortniteUI.FortActivityView
// Size: 0x3f8 (Inherited: 0x3a8)
struct UFortActivityView : UCommonActivatableWidget {
	char pad_3A8[0x50]; // 0x3a8(0x50)

	void BP_OnPartySizeChanged(int32_t PartySize); // Function FortniteUI.FortActivityView.BP_OnPartySizeChanged // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void BP_OnLocalPlayerPromotedToLeader(); // Function FortniteUI.FortActivityView.BP_OnLocalPlayerPromotedToLeader // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void BP_OnLocalPlayerDemoted(); // Function FortniteUI.FortActivityView.BP_OnLocalPlayerDemoted // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
};

// Class FortniteUI.FortMobileHUDElement
// Size: 0x2f8 (Inherited: 0x2d0)
struct UFortMobileHUDElement : UFortHUDElementWidget {
	struct FGameplayTag SizePropertyTag; // 0x2d0(0x04)
	char pad_2D4[0x14]; // 0x2d4(0x14)
	int32_t ForcedZOrder; // 0x2e8(0x04)
	char pad_2EC[0x4]; // 0x2ec(0x04)
	struct UScaleBox* ScaleBox_HUDWidgetScale; // 0x2f0(0x08)
};

// Class FortniteUI.BacchusHUDElement
// Size: 0x318 (Inherited: 0x2f8)
struct UBacchusHUDElement : UFortMobileHUDElement {
	bool bHideWhenNotUsingTouch; // 0x2f8(0x01)
	bool bUpdatesWithHUDState; // 0x2f9(0x01)
	bool bAlwaysShow; // 0x2fa(0x01)
	enum class EBacchusHUDStateType OnInBuildMode; // 0x2fb(0x01)
	enum class EBacchusHUDStateType OnInCombatMode; // 0x2fc(0x01)
	enum class EBacchusHUDStateType OnInEditMode; // 0x2fd(0x01)
	enum class EBacchusHUDStateType OnInCreativeMode; // 0x2fe(0x01)
	enum class EBacchusHUDStateType OnInBattleLabMode; // 0x2ff(0x01)
	enum class EBacchusHUDStateType isFreeFalling; // 0x300(0x01)
	enum class EBacchusHUDStateType IsGliding; // 0x301(0x01)
	enum class EBacchusHUDStateType CanOpenChute; // 0x302(0x01)
	enum class EBacchusHUDStateType InLockedBus; // 0x303(0x01)
	enum class EBacchusHUDStateType InUnlockedBus; // 0x304(0x01)
	enum class EBacchusHUDStateType OnTargeting; // 0x305(0x01)
	enum class EBacchusHUDStateType OnUsingScopeTargeting; // 0x306(0x01)
	enum class EBacchusHUDStateType OnCanTarget; // 0x307(0x01)
	enum class EBacchusHUDStateType OnCanUseScopeTargeting; // 0x308(0x01)
	enum class EBacchusHUDStateType OnCrouching; // 0x309(0x01)
	enum class EBacchusHUDStateType OnCanUseSecondaryAbility; // 0x30a(0x01)
	enum class EBacchusHUDStateType OnDBNO; // 0x30b(0x01)
	enum class EBacchusHUDStateType OnCarryingDBNO; // 0x30c(0x01)
	enum class EBacchusHUDStateType OnCarryingHeldObject; // 0x30d(0x01)
	enum class EBacchusHUDStateType OnImprovedDBNO; // 0x30e(0x01)
	enum class EBacchusHUDStateType OnControllingRCPawn; // 0x30f(0x01)
	enum class EBacchusHUDStateType OnInVehicle; // 0x310(0x01)
	enum class EBacchusHUDStateType OnDrivingVehicle; // 0x311(0x01)
	enum class EBacchusHUDStateType OnZiplining; // 0x312(0x01)
	char pad_313[0x5]; // 0x313(0x05)

	void ShowHighlight(bool Show); // Function FortniteUI.BacchusHUDElement.ShowHighlight // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnHUDStateUpdate(struct FFortHUDState& NewState); // Function FortniteUI.BacchusHUDElement.OnHUDStateUpdate // (Native|Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x9e23258
	void HandleInputMethodChanged(enum class ECommonInputType CurrentInputType); // Function FortniteUI.BacchusHUDElement.HandleInputMethodChanged // (Final|Native|Protected) // @ game+0x9e22648
};

// Class FortniteUI.BacchusButton
// Size: 0x390 (Inherited: 0x318)
struct UBacchusButton : UBacchusHUDElement {
	struct UPaperSprite* DefaultIcon; // 0x318(0x08)
	struct FLinearColor PressedColor; // 0x320(0x10)
	struct FLinearColor UnpressedColor; // 0x330(0x10)
	enum class EButtonClickMethod ClickMethod; // 0x340(0x01)
	enum class EButtonTouchMethod TouchMethod; // 0x341(0x01)
	char pad_342[0x2]; // 0x342(0x02)
	float ButtonSize; // 0x344(0x04)
	float ButtonDisplayScale; // 0x348(0x04)
	bool ShowRadialProgress; // 0x34c(0x01)
	char pad_34D[0x3]; // 0x34d(0x03)
	struct FGameplayTag ListenedGamePlayTag; // 0x350(0x04)
	char pad_354[0x4]; // 0x354(0x04)
	struct UImage* Image_Background; // 0x358(0x08)
	char pad_360[0x8]; // 0x360(0x08)
	struct USizeBox* SizeBox_ButtonSize; // 0x368(0x08)
	struct USizeBox* SizeBox_ImageSize; // 0x370(0x08)
	struct UImage* Image_Icon; // 0x378(0x08)
	struct URadialBacchusButtonBase* RadialButton_ButtonCooldown; // 0x380(0x08)
	struct UButton* Button_InternalButton; // 0x388(0x08)

	void SetIconPressed(bool bIsPressed); // Function FortniteUI.BacchusButton.SetIconPressed // (Final|Native|Protected|BlueprintCallable) // @ game+0x9e23b84
	void SetDefaultIcon(struct UPaperSprite* Icon); // Function FortniteUI.BacchusButton.SetDefaultIcon // (Final|Native|Protected|BlueprintCallable) // @ game+0x9e23a84
	void SetButtonSprite(struct UPaperSprite* NewSprite); // Function FortniteUI.BacchusButton.SetButtonSprite // (RequiredAPI|Native|Event|Protected|BlueprintCallable|BlueprintEvent) // @ game+0x7a9c1e0
	void SetButtonSize(float NewButtonSize); // Function FortniteUI.BacchusButton.SetButtonSize // (RequiredAPI|Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x9e238e0
	void SetButtonDisplayScale(float NewDisplayScale); // Function FortniteUI.BacchusButton.SetButtonDisplayScale // (RequiredAPI|Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x9e23858
	void OnClicked(); // Function FortniteUI.BacchusButton.OnClicked // (RequiredAPI|Native|Event|Protected|BlueprintEvent) // @ game+0x8241a58
	void HandleCursorModeChanged(bool bCursorModeEnabled, struct FName ActionName, struct UUserWidget* CustomWidget); // Function FortniteUI.BacchusButton.HandleCursorModeChanged // (Final|Native|Private) // @ game+0x9e22444
};

// Class FortniteUI.BacchusActionButton
// Size: 0x3d8 (Inherited: 0x390)
struct UBacchusActionButton : UBacchusButton {
	struct TArray<struct FBacchusActionIconMapping> ActionMapping; // 0x390(0x10)
	struct FName TempActionMapping; // 0x3a0(0x04)
	char pad_3A4[0x4]; // 0x3a4(0x04)
	struct TArray<struct FGameplayTag> ItemsAllowingClickThrough; // 0x3a8(0x10)
	bool bCapturesInput; // 0x3b8(0x01)
	char pad_3B9[0x1f]; // 0x3b9(0x1f)

	void OnCursorModeChanged(bool bCursorModeEnabled, struct FName ActionName, struct UUserWidget* CustomWidget); // Function FortniteUI.BacchusActionButton.OnCursorModeChanged // (Final|Native|Protected) // @ game+0x9e642cc
	void AddActionMappings(struct TArray<struct FBacchusActionIconMapping> NewActionMappings); // Function FortniteUI.BacchusActionButton.AddActionMappings // (Final|Native|Protected|BlueprintCallable) // @ game+0x9e635d8
};

// Class FortniteUI.FortUIGameFeatureAction_PostFrontendFlowActions
// Size: 0x30 (Inherited: 0x28)
struct UFortUIGameFeatureAction_PostFrontendFlowActions : UFortUIGameFeatureAction {
	char pad_28[0x8]; // 0x28(0x08)
};

// Class FortniteUI.FortMainMenuButton
// Size: 0x1560 (Inherited: 0x1430)
struct UFortMainMenuButton : UCommonButtonLegacy {
	struct FText DefaultText; // 0x1430(0x18)
	char pad_1448[0x8]; // 0x1448(0x08)
	struct FSlateBrush DefaultBrush; // 0x1450(0xc0)
	int32_t NormalButtonHeight; // 0x1510(0x04)
	int32_t MobileButtonHeight; // 0x1514(0x04)
	struct Fmargin TextPadding; // 0x1518(0x10)
	struct Fmargin ContentPadding; // 0x1528(0x10)
	struct UCommonButtonStyle* MobileStyle; // 0x1538(0x08)
	struct UCommonTextBlock* Text_Content; // 0x1540(0x08)
	struct UImage* Image_Icon; // 0x1548(0x08)
	struct UBorder* ContentBorder; // 0x1550(0x08)
	char pad_1558[0x8]; // 0x1558(0x08)

	void SetText(struct FText& InText); // Function FortniteUI.FortMainMenuButton.SetText // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0xa0bff38
};

// Class FortniteUI.FortMainMenuButtonExtension
// Size: 0x1560 (Inherited: 0x1560)
struct UFortMainMenuButtonExtension : UFortMainMenuButton {
	struct UCommonActivatableWidget* SidebarPanelToActivate; // 0x1558(0x08)
};

// Class FortniteUI.FortSettingDetailExtension
// Size: 0x270 (Inherited: 0x268)
struct UFortSettingDetailExtension : UUserWidget {
	struct UFortSetting* Setting; // 0x268(0x08)

	bool UseSplitDisabledOptionsVisual(); // Function FortniteUI.FortSettingDetailExtension.UseSplitDisabledOptionsVisual // (Final|Native|Public|BlueprintCallable) // @ game+0x248ecd4
	void OnSettingValueChanged(struct UFortSetting* InSetting); // Function FortniteUI.FortSettingDetailExtension.OnSettingValueChanged // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnSettingAssigned(struct UFortSetting* InSetting); // Function FortniteUI.FortSettingDetailExtension.OnSettingAssigned // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	struct FText GetOptionsDisabledText(struct TArray<struct FText>& Reasons); // Function FortniteUI.FortSettingDetailExtension.GetOptionsDisabledText // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0xa200068
};

// Class FortniteUI.FortPortalHUDDetails
// Size: 0x3a8 (Inherited: 0x370)
struct UFortPortalHUDDetails : UFortActorIndicatorWidget {
	char pad_370[0x8]; // 0x370(0x08)
	struct UAthenaMarkerPointer* MarkerPointer; // 0x378(0x08)
	char pad_380[0x20]; // 0x380(0x20)
	struct UCommonActivatableWidgetSwitcher* MobileInfo_Matchmaking_Switcher; // 0x3a0(0x08)

	void SetCachedWorldPos(struct FVector InWorldPos); // Function FortniteUI.FortPortalHUDDetails.SetCachedWorldPos // (Final|RequiredAPI|Native|Protected|HasDefaults|BlueprintCallable) // @ game+0x9fd1adc
	void SetActiveMatchmakingTextIndex(int32_t newIndex); // Function FortniteUI.FortPortalHUDDetails.SetActiveMatchmakingTextIndex // (Final|Native|Protected|BlueprintCallable) // @ game+0x9fd1a5c
	void SetActiveContextInfo(struct UFortInteractContextInfo* ActiveContextInfo); // Function FortniteUI.FortPortalHUDDetails.SetActiveContextInfo // (Final|Native|Protected|BlueprintCallable) // @ game+0x9fd19dc
	void HandleMatchmakingComplete(bool Success); // Function FortniteUI.FortPortalHUDDetails.HandleMatchmakingComplete // (Final|Native|Protected) // @ game+0x9fcd590
	struct UFortInteractContextInfo* GetActiveContextInfo(); // Function FortniteUI.FortPortalHUDDetails.GetActiveContextInfo // (Final|Native|Protected|BlueprintCallable|BlueprintPure) // @ game+0x23a2d28
	void ClearCachedWorldPos(); // Function FortniteUI.FortPortalHUDDetails.ClearCachedWorldPos // (Final|RequiredAPI|Native|Protected|BlueprintCallable) // @ game+0x9fcb2a4
};

// Class FortniteUI.FortPopupMenu
// Size: 0x500 (Inherited: 0x4f8)
struct UFortPopupMenu : UCommonPopupMenuLegacy {
	char pad_4F8[0x8]; // 0x4f8(0x08)
};

// Class FortniteUI.FortItemPickerBase
// Size: 0x3d0 (Inherited: 0x290)
struct UFortItemPickerBase : UCommonUserWidget {
	struct FMulticastInlineDelegate OnSelectionChangedEvent; // 0x290(0x10)
	char pad_2A0[0x18]; // 0x2a0(0x18)
	struct FMulticastInlineDelegate OnSelectionCommittedEvent; // 0x2b8(0x10)
	char pad_2C8[0x48]; // 0x2c8(0x48)
	struct FMulticastInlineDelegate OnItemHoveredEvent; // 0x310(0x10)
	char pad_320[0x18]; // 0x320(0x18)
	struct FMulticastInlineDelegate OnItemUnhovered; // 0x338(0x10)
	char pad_348[0x18]; // 0x348(0x18)
	struct UFortItemTileView* PickerTileView; // 0x360(0x08)
	struct UListView* ItemListViewWidget; // 0x368(0x08)
	char pad_370[0x10]; // 0x370(0x10)
	bool bConfirmSelectionIfAlreadySelectedAfterOneClick; // 0x380(0x01)
	char pad_381[0x7]; // 0x381(0x07)
	struct UObject* CurrentSelectedItem; // 0x388(0x08)
	struct TScriptInterface<IFortItemViewContextInterface> ItemViewContext; // 0x390(0x10)
	char pad_3A0[0x30]; // 0x3a0(0x30)

	bool TryCommitSelectedItem(); // Function FortniteUI.FortItemPickerBase.TryCommitSelectedItem // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0xa0f74d4
	void SetSelectedItem(struct UFortItem* ItemToSelect); // Function FortniteUI.FortItemPickerBase.SetSelectedItem // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0xa0f6ed8
	bool SetSelectedIndex(int32_t Index); // Function FortniteUI.FortItemPickerBase.SetSelectedIndex // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0xa0f6e4c
	void OnItemSelectionScriptDelegate__DelegateSignature(struct UFortItem* SelectedItem); // DelegateFunction FortniteUI.FortItemPickerBase.OnItemSelectionScriptDelegate__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0xdef49c
	bool IsNullItemExplicitlySelected(); // Function FortniteUI.FortItemPickerBase.IsNullItemExplicitlySelected // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xa0f527c
	struct UFortItem* GetSelectedItem(); // Function FortniteUI.FortItemPickerBase.GetSelectedItem // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xa0f3d50
	struct TScriptInterface<IFortItemListViewInterface> GetListViewInterface(); // Function FortniteUI.FortItemPickerBase.GetListViewInterface // (Final|Native|Protected|BlueprintCallable) // @ game+0xa0f3af8
	int32_t GetIndexForItem(struct UFortItem* Item); // Function FortniteUI.FortItemPickerBase.GetIndexForItem // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xa0f376c
	void ClearSelection(); // Function FortniteUI.FortItemPickerBase.ClearSelection // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0xa0f287c
	void CenterSelectedItemTileWidget(); // Function FortniteUI.FortItemPickerBase.CenterSelectedItemTileWidget // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0xa0f282c
	bool CanItemBeComitted(struct UFortItem* ItemToCommit); // Function FortniteUI.FortItemPickerBase.CanItemBeComitted // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0xa0f2718
};

// Class FortniteUI.FortMtxStoreRootBase
// Size: 0x5a0 (Inherited: 0x518)
struct UFortMtxStoreRootBase : UFortActivatablePanel {
	char pad_518[0x8]; // 0x518(0x08)
	struct UFortMtxStoreSelectionPopup* MtxStoreSelectionWidget; // 0x520(0x08)
	struct UFortMtxStoreSelectionPopup* MtxStoreSelectionClass; // 0x528(0x08)
	char pad_530[0x10]; // 0x530(0x10)
	struct TArray<struct UFortStoreFrontOfferInfo*> AcquisitionOfferData; // 0x540(0x10)
	char pad_550[0x18]; // 0x550(0x18)
	struct TArray<struct FString> StorefrontNames; // 0x568(0x10)
	char pad_578[0x28]; // 0x578(0x28)

	void SetStorefrontNames(struct TArray<struct FString>& InStorefrontNames); // Function FortniteUI.FortMtxStoreRootBase.SetStorefrontNames // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0xa16b524
	void PushStoreSelection(); // Function FortniteUI.FortMtxStoreRootBase.PushStoreSelection // (Final|Native|Protected) // @ game+0x258f6c0
	void OnUpdateOtherPlatformMTXMessage(bool HasOtherPlatformCurrency, struct FText& CurrencyMessageLocText); // Function FortniteUI.FortMtxStoreRootBase.OnUpdateOtherPlatformMTXMessage // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xdef49c
	void OnStartReadingOffers(); // Function FortniteUI.FortMtxStoreRootBase.OnStartReadingOffers // (Native|Event|Protected|BlueprintEvent) // @ game+0x67e5570
	void OnPurchasingDisabled(); // Function FortniteUI.FortMtxStoreRootBase.OnPurchasingDisabled // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnOffersGenerated(); // Function FortniteUI.FortMtxStoreRootBase.OnOffersGenerated // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void NoOffersAvailable(); // Function FortniteUI.FortMtxStoreRootBase.NoOffersAvailable // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	struct TArray<struct FString> GetStorefrontNames(); // Function FortniteUI.FortMtxStoreRootBase.GetStorefrontNames // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0xa167e8c
	struct FMtxBreakdown GetMtxBreakdown(); // Function FortniteUI.FortMtxStoreRootBase.GetMtxBreakdown // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0xa167af8
	void GenerateOfferWidget(struct UFortStoreFrontOfferInfo* OfferData); // Function FortniteUI.FortMtxStoreRootBase.GenerateOfferWidget // (Native|Event|Protected|BlueprintEvent) // @ game+0x6993338
	void ClearOfferWidgets(); // Function FortniteUI.FortMtxStoreRootBase.ClearOfferWidgets // (Native|Event|Protected|BlueprintEvent) // @ game+0x644c700
	bool AreOffersLoaded(); // Function FortniteUI.FortMtxStoreRootBase.AreOffersLoaded // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x924db4c
};

// Class FortniteUI.FortRootViewportLayout
// Size: 0x3b8 (Inherited: 0x290)
struct UFortRootViewportLayout : UCommonUserWidget {
	char pad_290[0x20]; // 0x290(0x20)
	struct UFortWebPurchaseScreen* WebPurchaseScreenWidgetClass; // 0x2b0(0x08)
	struct UFortWebPurchaseScreen* WebPurchaseWidget_RuntimeSpawned; // 0x2b8(0x08)
	struct UFortUINotificationManager* NotificationManager; // 0x2c0(0x08)
	struct TArray<struct FFortDialogDescription_NUI> ConfirmationQueue; // 0x2c8(0x10)
	char pad_2D8[0x10]; // 0x2d8(0x10)
	struct UFortUIStateWidget_NUI* CurrentLegacyStateWidget; // 0x2e8(0x08)
	char pad_2F0[0x8]; // 0x2f0(0x08)
	struct UFortLetoLayoutBorder* LetoLayoutBorderClass; // 0x2f8(0x08)
	struct TArray<struct FPluginUIStateWidgetEntry> PluginUIStateWidgetEntries; // 0x300(0x10)
	char pad_310[0x60]; // 0x310(0x60)
	struct UFortUIStateWidgetBase* CurrentStateWidget; // 0x370(0x08)
	struct UCommonActivatableWidgetQueue* WidgetQueue_ModalContent; // 0x378(0x08)
	struct UAthenaProgressModal* AthenaProgressModal; // 0x380(0x08)
	struct UFortConfirmationWindow* ConfirmationWindow_ConfirmationWidget; // 0x388(0x08)
	struct UFortErrorWindow* ErrorWindow_Errors; // 0x390(0x08)
	struct UAthenaProgressModal* ProgressModal_ControllerDisconnected; // 0x398(0x08)
	struct UFortRestartClientModal* RestartModal; // 0x3a0(0x08)
	struct UFortPinModal* PinModal; // 0x3a8(0x08)
	struct UFortToastDisplayArea* ToastDisplayArea_ToastHandler; // 0x3b0(0x08)

	void PurchasingWidgetDisplayCallback(struct UWidget* WebWidget, struct FString OfferId); // Function FortniteUI.FortRootViewportLayout.PurchasingWidgetDisplayCallback // (Final|Native|Protected) // @ game+0xa26e82c
	void PurchasingWidgetDismissedCallback(); // Function FortniteUI.FortRootViewportLayout.PurchasingWidgetDismissedCallback // (Final|Native|Protected) // @ game+0xa26e818
	void HandleControllerConnectionChanged(bool bConnected); // Function FortniteUI.FortRootViewportLayout.HandleControllerConnectionChanged // (Final|Native|Private) // @ game+0xa26de5c
};

// Class FortniteUI.FortUIStateWidgetBase
// Size: 0x3c0 (Inherited: 0x3a8)
struct UFortUIStateWidgetBase : UCommonActivatableWidget {
	char pad_3A8[0x10]; // 0x3a8(0x10)
	struct UCommonActivatableWidgetStack* WidgetStack_PrimaryContent; // 0x3b8(0x08)
};

// Class FortniteUI.FortActivatablePanelWithItemPreview
// Size: 0x660 (Inherited: 0x518)
struct UFortActivatablePanelWithItemPreview : UFortActivatablePanel {
	char pad_518[0x8]; // 0x518(0x08)
	struct UFortItemView* ItemViewObject; // 0x520(0x08)
	struct FDataTableRowHandle ItemViewUnifiedSupportsCameraControlInputAction; // 0x528(0x10)
	struct FDataTableRowHandle ItemViewUnifiedZoomInputAction; // 0x538(0x10)
	struct FDataTableRowHandle ItemViewZoomOutInputAction; // 0x548(0x10)
	struct FDataTableRowHandle ItemViewZoomInInputAction; // 0x558(0x10)
	struct FDataTableRowHandle ItemViewRotateInputAction; // 0x568(0x10)
	char pad_578[0xb0]; // 0x578(0xb0)
	bool AllowItemRotation; // 0x628(0x01)
	bool AllowItemZooming; // 0x629(0x01)
	bool AutomaticallyRegisterCameraView; // 0x62a(0x01)
	bool OverrideFixedCameras; // 0x62b(0x01)
	char pad_62C[0x4]; // 0x62c(0x04)
	struct UDataTable* ActionDataTable; // 0x630(0x08)
	struct UWidgetAnimation* AnimationToHideItemInfo; // 0x638(0x08)
	bool bAutoShowDetails; // 0x640(0x01)
	bool bItemDetailsHidden; // 0x641(0x01)
	char pad_642[0x2]; // 0x642(0x02)
	float HideItemInfoHeaderDurationSecs; // 0x644(0x04)
	char pad_648[0x18]; // 0x648(0x18)

	void ShowItemDetails(); // Function FortniteUI.FortActivatablePanelWithItemPreview.ShowItemDetails // (Final|Native|Private|BlueprintCallable) // @ game+0x9d73620
	void OnVaultItemsViewed(struct TArray<struct UFortItem*>& Items); // Function FortniteUI.FortActivatablePanelWithItemPreview.OnVaultItemsViewed // (Final|Native|Private|HasOutParms) // @ game+0x9d72fcc
	void OnItemPreviewChanged(struct AActor* NewPrefab, struct UFortItem* NewItem); // Function FortniteUI.FortActivatablePanelWithItemPreview.OnItemPreviewChanged // (Final|Native|Protected) // @ game+0x9d72a5c
	void (bool& bPassThrough); // Function FortniteUI.FortActivatablePanelWithItemPreview. // (Final|Native|Protected|HasOutParms) // @ game+0x9d729b8
	void (bool& bPassThrough); // Function FortniteUI.FortActivatablePanelWithItemPreview. // (Final|Native|Protected|HasOutParms) // @ game+0x9d72928
	void (bool& bPassThrough); // Function FortniteUI.FortActivatablePanelWithItemPreview. // (Final|Native|Protected|HasOutParms) // @ game+0x9d72898
	void (bool& bPassThrough); // Function FortniteUI.FortActivatablePanelWithItemPreview. // (Final|Native|Protected|HasOutParms) // @ game+0x9d72808
	void (bool& bPassThrough); // Function FortniteUI.FortActivatablePanelWithItemPreview. // (Final|Native|Protected|HasOutParms) // @ game+0x9d72778
	void (bool& bPassThrough); // Function FortniteUI.FortActivatablePanelWithItemPreview. // (Final|Native|Protected|HasOutParms) // @ game+0x9d726e8
	void (bool& bPassThrough); // Function FortniteUI.FortActivatablePanelWithItemPreview. // (Final|Native|Protected|HasOutParms) // @ game+0x9d72658
	void (bool& bPassThrough); // Function FortniteUI.FortActivatablePanelWithItemPreview. // (Final|Native|Protected|HasOutParms) // @ game+0x9d725c8
	void HideItemDetails(); // Function FortniteUI.FortActivatablePanelWithItemPreview.HideItemDetails // (Final|Native|Private|BlueprintCallable) // @ game+0x9d7232c
	struct UWidget* GetWidgetForFramingViewedItem(); // Function FortniteUI.FortActivatablePanelWithItemPreview.GetWidgetForFramingViewedItem // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
};

// Class FortniteUI.FortUserWidget
// Size: 0x278 (Inherited: 0x268)
struct UFortUserWidget : UUserWidget {
	char pad_268[0x8]; // 0x268(0x08)
	bool bConsumePointerInput; // 0x270(0x01)
	char pad_271[0x7]; // 0x271(0x07)
};

// Class FortniteUI.FortBangWrapper_NUI
// Size: 0x2a8 (Inherited: 0x290)
struct UFortBangWrapper_NUI : UCommonUserWidget {
	char pad_290[0x8]; // 0x290(0x08)
	enum class EFortBangType BangType; // 0x298(0x01)
	char pad_299[0x3]; // 0x299(0x03)
	struct FName TutorialNameID; // 0x29c(0x04)
	struct UNamedSlot* ContentSlot; // 0x2a0(0x08)

	void UnregisterTutorialNameID(); // Function FortniteUI.FortBangWrapper_NUI.UnregisterTutorialNameID // (Final|Native|Public|BlueprintCallable) // @ game+0x9f759a0
	void SetTutorialNameID(struct FName InTutorialNameID); // Function FortniteUI.FortBangWrapper_NUI.SetTutorialNameID // (Final|Native|Public|BlueprintCallable) // @ game+0x9f75254
	void SetBangType(enum class EFortBangType NewBangType); // Function FortniteUI.FortBangWrapper_NUI.SetBangType // (Final|Native|Public|BlueprintCallable) // @ game+0x9f73f34
	void SetBangStateBP(bool bEnabled, int32_t Count); // Function FortniteUI.FortBangWrapper_NUI.SetBangStateBP // (Final|Native|Public|BlueprintCallable) // @ game+0x270b240
	void OnTutorialCalloutFinished(); // Function FortniteUI.FortBangWrapper_NUI.OnTutorialCalloutFinished // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnStopCallout(); // Function FortniteUI.FortBangWrapper_NUI.OnStopCallout // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnStartCallout(struct FName TutorialObjectiveName, enum class ETutorialType TutorialType); // Function FortniteUI.FortBangWrapper_NUI.OnStartCallout // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnBangStateChanged(bool bEnabled, int32_t Count); // Function FortniteUI.FortBangWrapper_NUI.OnBangStateChanged // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void AsyncPlaySound2D(struct UObject* WorldContextObject, struct TSoftObjectPtr<USoundBase> SoundToLoad, float VolumeMultiplier, float PitchMultiplier, float StartTime); // Function FortniteUI.FortBangWrapper_NUI.AsyncPlaySound2D // (Final|BlueprintCosmetic|Native|Public|BlueprintCallable) // @ game+0x9f70b68
};

// Class FortniteUI.FortItemDetailElementWidget
// Size: 0x2e8 (Inherited: 0x290)
struct UFortItemDetailElementWidget : UCommonUserWidget {
	struct TWeakObjectPtr<struct UFortItem> ItemToDetail; // 0x290(0x08)
	struct TWeakObjectPtr<struct UFortItem> ItemToCompareWith; // 0x298(0x08)
	bool bShouldPreviewUpgradingItem; // 0x2a0(0x01)
	char pad_2A1[0x3]; // 0x2a1(0x03)
	int32_t UpgradeLevelDelta; // 0x2a4(0x04)
	struct TScriptInterface<IFortItemViewContextInterface> ItemViewContext; // 0x2a8(0x10)
	enum class EFortItemInspectionMode CurrentInspectMode; // 0x2b8(0x01)
	char pad_2B9[0x3]; // 0x2b9(0x03)
	int32_t QuantityOverride; // 0x2bc(0x04)
	bool bIsUpdatingSuspended; // 0x2c0(0x01)
	char pad_2C1[0x27]; // 0x2c1(0x27)

	void HandleUpgradeLevelDeltaChanged(); // Function FortniteUI.FortItemDetailElementWidget.HandleUpgradeLevelDeltaChanged // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void HandleShouldPreviewUpgradingItemChanged(); // Function FortniteUI.FortItemDetailElementWidget.HandleShouldPreviewUpgradingItemChanged // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void HandleQuantityOverrideChanged(); // Function FortniteUI.FortItemDetailElementWidget.HandleQuantityOverrideChanged // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void HandlePreDifferentItemToDetailSet(); // Function FortniteUI.FortItemDetailElementWidget.HandlePreDifferentItemToDetailSet // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void HandlePreDifferentItemToCompareWithSet(); // Function FortniteUI.FortItemDetailElementWidget.HandlePreDifferentItemToCompareWithSet // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void HandlePostDifferentItemToDetailSet(); // Function FortniteUI.FortItemDetailElementWidget.HandlePostDifferentItemToDetailSet // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void HandlePostDifferentItemToCompareWithSet(); // Function FortniteUI.FortItemDetailElementWidget.HandlePostDifferentItemToCompareWithSet // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void HandleItemToDetailChangedBP(); // Function FortniteUI.FortItemDetailElementWidget.HandleItemToDetailChangedBP // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void HandleItemToCompareWithChangedBP(); // Function FortniteUI.FortItemDetailElementWidget.HandleItemToCompareWithChangedBP // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void HandleInspectModeChanged(); // Function FortniteUI.FortItemDetailElementWidget.HandleInspectModeChanged // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
};

// Class FortniteUI.FortItemDetailsHostPanel
// Size: 0x368 (Inherited: 0x290)
struct UFortItemDetailsHostPanel : UCommonUserWidget {
	struct FMulticastInlineDelegate OnItemChanged; // 0x290(0x10)
	struct TWeakObjectPtr<struct UFortItem> ItemToDetail; // 0x2a0(0x08)
	char pad_2A8[0x10]; // 0x2a8(0x10)
	struct TWeakObjectPtr<struct UFortItem> ItemToCompareWith; // 0x2b8(0x08)
	char pad_2C0[0x10]; // 0x2c0(0x10)
	bool bShouldPreviewUpgradingItem; // 0x2d0(0x01)
	char pad_2D1[0x3]; // 0x2d1(0x03)
	int32_t UpgradeLevelDelta; // 0x2d4(0x04)
	struct UScrollBox* ScrollBox; // 0x2d8(0x08)
	struct UNamedSlot* DetailsContainerSlotWidget; // 0x2e0(0x08)
	struct UCommonBorder* HighRarityBorder; // 0x2e8(0x08)
	struct TScriptInterface<IFortItemViewContextInterface> ItemViewContext; // 0x2f0(0x10)
	enum class EFortItemInspectionMode CurrentInspectMode; // 0x300(0x01)
	char pad_301[0x27]; // 0x301(0x27)
	int32_t QuantityOverride; // 0x328(0x04)
	char pad_32C[0x4]; // 0x32c(0x04)
	struct UFortTooltipLoadingWrapper* ItemToDetailLoadingWrapper; // 0x330(0x08)
	struct UFortTooltipLoadingWrapper* ItemToCompareLoadingWrapper; // 0x338(0x08)
	struct UCommonLoadGuard* ItemToDetailLoadGuard; // 0x340(0x08)
	struct UCommonLoadGuard* ItemToCompareLoadGuard; // 0x348(0x08)
	struct UCommonBorder* Border_Details; // 0x350(0x08)
	bool bAsyncLoadTooltipData; // 0x358(0x01)
	bool bIsUpdatingSuspended; // 0x359(0x01)
	char pad_35A[0xe]; // 0x35a(0x0e)

	void ShouldPreviewUpgradingItem(bool Value); // Function FortniteUI.FortItemDetailsHostPanel.ShouldPreviewUpgradingItem // (Final|Native|Public|BlueprintCallable) // @ game+0xa13f1ac
	void SetUpgradeLevelDelta(int32_t InDelta); // Function FortniteUI.FortItemDetailsHostPanel.SetUpgradeLevelDelta // (Final|Native|Public|BlueprintCallable) // @ game+0xa13f05c
	void SetScrollWidget(); // Function FortniteUI.FortItemDetailsHostPanel.SetScrollWidget // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0xa13e9fc
	void SetQuantityOverride(int32_t QuantityOverride); // Function FortniteUI.FortItemDetailsHostPanel.SetQuantityOverride // (Final|Native|Public|BlueprintCallable) // @ game+0xa13e7f0
	void SetItemViewContext(struct TScriptInterface<IFortItemViewContextInterface>& ItemViewContext); // Function FortniteUI.FortItemDetailsHostPanel.SetItemViewContext // (Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable) // @ game+0xa13e38c
	void SetItemToDetail(struct UFortItem* ItemToDetail); // Function FortniteUI.FortItemDetailsHostPanel.SetItemToDetail // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x11ab02c
	void SetItemToCompareWith(struct UFortItem* ItemToCompareWith); // Function FortniteUI.FortItemDetailsHostPanel.SetItemToCompareWith // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0xa13d9b8
	void SetIsUpdatingSuspended(bool bValue); // Function FortniteUI.FortItemDetailsHostPanel.SetIsUpdatingSuspended // (Final|Native|Public|BlueprintCallable) // @ game+0xa13d0a4
	void SetInspectMode(enum class EFortItemInspectionMode InspectMode); // Function FortniteUI.FortItemDetailsHostPanel.SetInspectMode // (Final|Native|Public|BlueprintCallable) // @ game+0xa13cf94
	void OnItemChangedDelegate__DelegateSignature(); // DelegateFunction FortniteUI.FortItemDetailsHostPanel.OnItemChangedDelegate__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0xdef49c
	void HandleUpgradeLevelDeltaChangedBP(); // Function FortniteUI.FortItemDetailsHostPanel.HandleUpgradeLevelDeltaChangedBP // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void HandleShouldPreviewUpgradingItemChangedBP(); // Function FortniteUI.FortItemDetailsHostPanel.HandleShouldPreviewUpgradingItemChangedBP // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void HandleQuantityOverrideChanged(); // Function FortniteUI.FortItemDetailsHostPanel.HandleQuantityOverrideChanged // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void HandleItemToDetailTooltipAssetsLoading(); // Function FortniteUI.FortItemDetailsHostPanel.HandleItemToDetailTooltipAssetsLoading // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void HandleItemToDetailTooltipAssetsLoaded(); // Function FortniteUI.FortItemDetailsHostPanel.HandleItemToDetailTooltipAssetsLoaded // (Final|Native|Private) // @ game+0x7b74148
	void HandleItemToDetailChangedBP(); // Function FortniteUI.FortItemDetailsHostPanel.HandleItemToDetailChangedBP // (Event|Public|BlueprintEvent) // @ game+0xdef49c
	void HandleItemToCompareTooltipAssetsLoading(); // Function FortniteUI.FortItemDetailsHostPanel.HandleItemToCompareTooltipAssetsLoading // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void HandleItemToCompareTooltipAssetsLoaded(); // Function FortniteUI.FortItemDetailsHostPanel.HandleItemToCompareTooltipAssetsLoaded // (Final|Native|Private) // @ game+0xa13c4dc
	void HandleItemRefundComplete(bool bWasSuccessful, struct FString ConvertedItemInstanceId, struct TArray<struct FFortItemInstanceQuantityPair>& ItemsQuantities); // Function FortniteUI.FortItemDetailsHostPanel.HandleItemRefundComplete // (Final|Native|Private|HasOutParms) // @ game+0xa13c1d4
	void HandleItemRarityUpgradeComplete(bool bWasSuccessful, struct FString ConvertedItemInstanceId, struct TArray<struct FFortItemInstanceQuantityPair>& ItemsQuantities); // Function FortniteUI.FortItemDetailsHostPanel.HandleItemRarityUpgradeComplete // (Final|Native|Private|HasOutParms) // @ game+0xa13c1d4
	void HandleItemEvolutionComplete(bool bWasSuccessful, struct FString ConvertedItemInstanceId, struct TArray<struct FFortItemInstanceQuantityPair>& ItemsQuantities); // Function FortniteUI.FortItemDetailsHostPanel.HandleItemEvolutionComplete // (Final|Native|Private|HasOutParms) // @ game+0xa13c1d4
	void HandleInspectModeChanged(); // Function FortniteUI.FortItemDetailsHostPanel.HandleInspectModeChanged // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void HandleDifferentItemToDetailSet(); // Function FortniteUI.FortItemDetailsHostPanel.HandleDifferentItemToDetailSet // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void HandleDifferentItemToCompareSet(); // Function FortniteUI.FortItemDetailsHostPanel.HandleDifferentItemToCompareSet // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
};

// Class FortniteUI.FortItemTileButton
// Size: 0x1470 (Inherited: 0x1430)
struct UFortItemTileButton : UCommonButtonLegacy {
	char pad_1430[0x10]; // 0x1430(0x10)
	struct UFortMultiSizeItemCard* ItemWidget; // 0x1440(0x08)
	struct TWeakObjectPtr<struct UFortItem> Item; // 0x1448(0x08)
	enum class EFortItemCardSize ItemCardSize; // 0x1450(0x01)
	bool IsRewardCard; // 0x1451(0x01)
	char pad_1452[0x6]; // 0x1452(0x06)
	struct TScriptInterface<IFortItemViewContextInterface> ItemViewContext; // 0x1458(0x10)
	char pad_1468[0x8]; // 0x1468(0x08)

	void OnTileSizeOverrideCheck(enum class EFortItemCardSize SizeIn, enum class EFortItemCardSize& SizeOut); // Function FortniteUI.FortItemTileButton.OnTileSizeOverrideCheck // (Event|Protected|HasOutParms|BlueprintEvent|Const) // @ game+0xdef49c
};

// Class FortniteUI.FortStoreFrontOfferDetailsWidgetBase
// Size: 0x7d8 (Inherited: 0x660)
struct UFortStoreFrontOfferDetailsWidgetBase : UFortActivatablePanelWithItemPreview {
	char pad_660[0x48]; // 0x660(0x48)
	struct FDataTableRowHandle EnterViewModeInputActionRowHandle; // 0x6a8(0x10)
	bool IsInItemViewMode; // 0x6b8(0x01)
	bool ShouldAllowItemViewModeAction; // 0x6b9(0x01)
	bool bImmediatelyPurchased; // 0x6ba(0x01)
	char pad_6BB[0x5]; // 0x6bb(0x05)
	struct TArray<struct UFortStoreFrontOfferInfo*> PagedItems; // 0x6c0(0x10)
	struct UFortStoreFrontOfferInfo* OfferData; // 0x6d0(0x08)
	struct UFortVariantPicker* Picker_VariantSelector; // 0x6d8(0x08)
	struct UCommonTextBlock* TextUndoAvailability; // 0x6e0(0x08)
	struct UCommonTextBlock* Text_UndoBottomBarWarning; // 0x6e8(0x08)
	struct UCommonButtonLegacy* Button_Undo; // 0x6f0(0x08)
	struct UCommonTextBlock* Text_CosmeticWarning; // 0x6f8(0x08)
	char pad_700[0x40]; // 0x700(0x40)
	struct UFortPurchaseOverlayModal* PurchaseModalClass; // 0x740(0x08)
	char pad_748[0x30]; // 0x748(0x30)
	struct UFortItem* ItemToRepresent; // 0x778(0x08)
	struct UFortItemDefinition* SecondaryItemDefinition; // 0x780(0x08)
	float TimeBetweenVariantsRestart; // 0x788(0x04)
	float TimeBetweenVariants; // 0x78c(0x04)
	char pad_790[0x9]; // 0x790(0x09)
	bool bShowRefundWarningWhileMatchmaking; // 0x799(0x01)
	bool bShowRefundWarningWhileInZone; // 0x79a(0x01)
	char pad_79B[0x3d]; // 0x79b(0x3d)

	void UpdateItemViewModeBP(); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.UpdateItemViewModeBP // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void ShowVaultItemFromItemReward(struct UFortAthenaReward* InItemReward); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.ShowVaultItemFromItemReward // (Final|Native|Protected|BlueprintCallable) // @ game+0xa23ca9c
	void ShowVaultItem(struct UFortItem* InItemToRepresent); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.ShowVaultItem // (Final|Native|Protected|BlueprintCallable) // @ game+0xa23ca1c
	void ShowUndoInBottomBar(); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.ShowUndoInBottomBar // (Event|Public|BlueprintEvent) // @ game+0xdef49c
	void ShowReloadMtx(); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.ShowReloadMtx // (Final|Native|Protected|BlueprintCallable) // @ game+0xa23ca08
	void ShowPurchasedOverlayWidget(int32_t QuantityPurchased, struct TArray<struct FPurchasedItemInfo> PurchasedItems, bool bShowAsRefund, struct FString OfferId); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.ShowPurchasedOverlayWidget // (Final|Native|Protected|BlueprintCallable) // @ game+0xa23c6f8
	void ShowItemPresentationScreen(struct TArray<struct FPurchasedItemInfo>& PurchasedItems); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.ShowItemPresentationScreen // (Final|Native|Protected|HasOutParms|BlueprintCallable) // @ game+0x9dcebd0
	bool ShouldHavePurchaseConfirmation(); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.ShouldHavePurchaseConfirmation // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9dceb1c
	bool ShouldDisplayOfferPurchasedOverlay(); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.ShouldDisplayOfferPurchasedOverlay // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xa23c660
	void SetupOffer(struct UFortStoreFrontOfferInfo* InOfferData); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.SetupOffer // (Final|Native|Public|BlueprintCallable) // @ game+0xa23c488
	void SetStoreRoot(struct UFortMtxStoreRootBase* InStoreRoot); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.SetStoreRoot // (Final|Native|Public|BlueprintCallable) // @ game+0xa23bf1c
	void SetShouldAllowItemViewModeAction(bool Value); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.SetShouldAllowItemViewModeAction // (Final|Native|Public|BlueprintCallable) // @ game+0xa23bbfc
	void SetSecondaryItem(struct UFortItemDefinition* ItemDefinition); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.SetSecondaryItem // (Final|Native|Protected|BlueprintCallable) // @ game+0xa23bb7c
	void SetPagedItems(struct TArray<struct UFortStoreFrontOfferInfo*>& InPagedItems); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.SetPagedItems // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0xa23b850
	void SetItemRewardSecondaryItem(struct UFortItemDefinition* ItemDef, struct TArray<struct FFortItemQuantityPair> AllItemQuantityPairs, struct UFortAthenaReward* RewardWidget); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.SetItemRewardSecondaryItem // (Final|Native|Protected|BlueprintCallable) // @ game+0xa23b5b0
	void SetIsInItemViewMode(bool Value); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.SetIsInItemViewMode // (Final|Native|Public|BlueprintCallable) // @ game+0xa23b41c
	void SendUndoMtxReturnedAnalytic(struct FString Interaction, struct FString PurchaseId, int32_t MtxReturned); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.SendUndoMtxReturnedAnalytic // (Final|Native|Public|BlueprintCallable|Const) // @ game+0xa23ab08
	void SendShopInteractionAnalytic(struct FString Interaction, float HoldTime); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.SendShopInteractionAnalytic // (Final|Native|Public|BlueprintCallable|Const) // @ game+0xa23a81c
	void SendSeasonPassInteractionAnalytic(struct FString Interaction); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.SendSeasonPassInteractionAnalytic // (Final|Native|Public|BlueprintCallable|Const) // @ game+0xa23a4d4
	void SendReloadMtxPurchaseSKUAnalytic(); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.SendReloadMtxPurchaseSKUAnalytic // (Final|Native|Public|BlueprintCallable|Const) // @ game+0xa23a4c0
	void SendRealMoneyStoreInteractionAnalytic(struct FString Interaction); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.SendRealMoneyStoreInteractionAnalytic // (Final|Native|Public|BlueprintCallable|Const) // @ game+0xa23a218
	void SendRealMoneyPurchase(int32_t PriceIndex, int32_t Quantity); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.SendRealMoneyPurchase // (Final|Native|Protected|BlueprintCallable) // @ game+0xa23a158
	void SendingToMainStore(); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.SendingToMainStore // (Final|Native|Public|BlueprintCallable) // @ game+0xa23adb4
	void RequestExternalPurchase(int32_t PriceIndex, int32_t Quantity); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.RequestExternalPurchase // (Final|Native|Public|BlueprintCallable) // @ game+0xa239d4c
	void RegisterItemRewardInteraction(struct UFortAthenaReward* InItemReward); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.RegisterItemRewardInteraction // (Final|Native|Protected|BlueprintCallable) // @ game+0xa239bc0
	void RefreshUndoState(struct UFortStoreFrontOfferInfo* OfferPurchased); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.RefreshUndoState // (Final|Native|Public|BlueprintCallable) // @ game+0xa239b40
	void RefreshOfferInfo(); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.RefreshOfferInfo // (Final|Native|Public|BlueprintCallable) // @ game+0xa239b2c
	void PurchaseOffer(struct FDelegate& Callback, int32_t Quantity, float HoldTime); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.PurchaseOffer // (Final|Native|Protected|HasOutParms|BlueprintCallable) // @ game+0xa23989c
	void PurchaseAmountRight(); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.PurchaseAmountRight // (Event|Public|BlueprintEvent) // @ game+0xdef49c
	void PurchaseAmountLeft(); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.PurchaseAmountLeft // (Event|Public|BlueprintEvent) // @ game+0xdef49c
	void OnVariantChanged(struct FGameplayTag VariantChannel, struct FGameplayTag VariantTag, struct FString VariantCustomData, bool IsOwned); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.OnVariantChanged // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnUpdateStatus(); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.OnUpdateStatus // (Event|Public|BlueprintEvent) // @ game+0xdef49c
	void OnUpdateItemRestrictionCallout(bool bShouldShow, struct FText& RestrictionText); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.OnUpdateItemRestrictionCallout // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xdef49c
	void OnPurchasingStarted(); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.OnPurchasingStarted // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnEnterViewModeActionCommitted(bool& PassThrough); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.OnEnterViewModeActionCommitted // (Final|Native|Protected|HasOutParms) // @ game+0xa239334
	bool IsReloadMtxEnabled(); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.IsReloadMtxEnabled // (Final|Native|Protected|BlueprintCallable) // @ game+0xa238c48
	void HideUndoInBottomBar(); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.HideUndoInBottomBar // (Event|Public|BlueprintEvent) // @ game+0xdef49c
	void HandleVaultItemsViewed(struct TArray<struct UFortItem*>& ItemsShown); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.HandleVaultItemsViewed // (Final|Native|Protected|HasOutParms) // @ game+0xa237b94
	void HandleRealMoneyPurchaseComplete(bool bSuccess, struct TArray<struct FPurchasedItemInfo>& PurchasedItems); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.HandleRealMoneyPurchaseComplete // (Final|Native|Private|HasOutParms) // @ game+0xa237a24
	void HandleGiftingItemPurchaseComplete(bool bSuccess, struct TArray<struct FPurchasedItemInfo>& PurchasedItems, struct FString OfferId); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.HandleGiftingItemPurchaseComplete // (Final|Native|Private|HasOutParms) // @ game+0xa2370ec
	void HandleCurrentlyViewedAccountInfoChanged(struct FFortPublicAccountInfo NewInfo); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.HandleCurrentlyViewedAccountInfoChanged // (Final|Native|Protected) // @ game+0xa236cdc
	void HandleBattlePassPurchaseComplete(bool bSuccess); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.HandleBattlePassPurchaseComplete // (Final|Native|Public|BlueprintCallable) // @ game+0xa236bfc
	int32_t GetPriceIndexToShow(); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.GetPriceIndexToShow // (Final|Native|Protected|BlueprintCallable) // @ game+0xa2354bc
	struct UFortStoreFrontOfferInfo* GetOfferInfoById(struct FString OfferId); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.GetOfferInfoById // (Final|Native|Public|BlueprintCallable) // @ game+0xa234e48
	struct UFortStoreFrontOfferInfo* GetOfferInfo(); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.GetOfferInfo // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xa234e18
	bool FindItemQuantityPair(struct UFortItemDefinition* ItemDefinition, struct TArray<struct FFortItemQuantityPair>& InItemQuantityPairs, struct FFortItemQuantityPair& OutItemQuantity); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.FindItemQuantityPair // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0xa231e60
	void DeactivateUndoButton(); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.DeactivateUndoButton // (Final|Native|Protected|BlueprintCallable) // @ game+0xa231da4
	void ConfirmUndo(); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.ConfirmUndo // (Final|Native|Protected|BlueprintCallable) // @ game+0xa231cfc
	void BP_OnOfferSet(); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.BP_OnOfferSet // (Event|Public|BlueprintEvent) // @ game+0xdef49c
};

// Class FortniteUI.FortCreativeContentBrowserTabPanelBase
// Size: 0x3f0 (Inherited: 0x3a8)
struct UFortCreativeContentBrowserTabPanelBase : UCommonActivatableWidget {
	struct FMulticastInlineDelegate OnSelectionChanged; // 0x3a8(0x10)
	char pad_3B8[0x4]; // 0x3b8(0x04)
	struct FName TabName; // 0x3bc(0x04)
	struct FText TabLabel; // 0x3c0(0x18)
	struct TArray<struct FName> LastFilters; // 0x3d8(0x10)
	char pad_3E8[0x8]; // 0x3e8(0x08)

	void SelectTab(); // Function FortniteUI.FortCreativeContentBrowserTabPanelBase.SelectTab // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0xdef49c
	int32_t GetSelectedItemIndex(); // Function FortniteUI.FortCreativeContentBrowserTabPanelBase.GetSelectedItemIndex // (Native|Public|BlueprintCallable) // @ game+0x9f7221c
	enum class EFortCreativeItemType GetItemType(); // Function FortniteUI.FortCreativeContentBrowserTabPanelBase.GetItemType // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x9f7202c
};

// Class FortniteUI.CreativeContentBrowserTab_CreationCondition
// Size: 0x28 (Inherited: 0x28)
struct UCreativeContentBrowserTab_CreationCondition : UObject {
};

// Class FortniteUI.AthenaFrontendFlowInterruptInterface
// Size: 0x28 (Inherited: 0x28)
struct UAthenaFrontendFlowInterruptInterface : UInterface {
};

// Class FortniteUI.FortPrimaryContentInterface
// Size: 0x28 (Inherited: 0x28)
struct UFortPrimaryContentInterface : UInterface {
};

// Class FortniteUI.AthenaHUDPrimaryContentInterface
// Size: 0x28 (Inherited: 0x28)
struct UAthenaHUDPrimaryContentInterface : UFortPrimaryContentInterface {
};

// Class FortniteUI.AthenaItemShopSectionInterface
// Size: 0x28 (Inherited: 0x28)
struct UAthenaItemShopSectionInterface : UInterface {
};

// Class FortniteUI.AthenaMapScreenAnalyticsInterface
// Size: 0x28 (Inherited: 0x28)
struct UAthenaMapScreenAnalyticsInterface : UInterface {
};

// Class FortniteUI.AthenaMapScreenContainerTabInterface
// Size: 0x28 (Inherited: 0x28)
struct UAthenaMapScreenContainerTabInterface : UInterface {
};

// Class FortniteUI.AthenaPlayerInfoBaseWidgetInterface
// Size: 0x28 (Inherited: 0x28)
struct UAthenaPlayerInfoBaseWidgetInterface : UInterface {
};

// Class FortniteUI.AthenaReplayActionFeedRowProxyInstance
// Size: 0x180 (Inherited: 0x28)
struct UAthenaReplayActionFeedRowProxyInstance : UObject {
	char pad_28[0x8]; // 0x28(0x08)
	struct FReplayEliminationEventInfo RowData; // 0x30(0x150)
};

// Class FortniteUI.AthenaReplayBrowserRowProxyInstance
// Size: 0x68 (Inherited: 0x28)
struct UAthenaReplayBrowserRowProxyInstance : UObject {
	char pad_28[0x40]; // 0x28(0x40)
};

// Class FortniteUI.BattlePassInputData
// Size: 0x28 (Inherited: 0x28)
struct UBattlePassInputData : UObject {
};

// Class FortniteUI.BattlePassEnabledInputData
// Size: 0x30 (Inherited: 0x28)
struct UBattlePassEnabledInputData : UBattlePassInputData {
	char pad_28[0x8]; // 0x28(0x08)

	void GetData(bool& InIsEnabled); // Function FortniteUI.BattlePassEnabledInputData.GetData // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x9c9356c
};

// Class FortniteUI.BattlePassBulkBuyInputData
// Size: 0x38 (Inherited: 0x28)
struct UBattlePassBulkBuyInputData : UBattlePassInputData {
	char pad_28[0x10]; // 0x28(0x10)

	void GetData(bool& IsPageCompleted, int32_t& StartingPage, int32_t& EndingPage, int32_t& PurchaseCost); // Function FortniteUI.BattlePassBulkBuyInputData.GetData // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x2582dcc
};

// Class FortniteUI.CheckDismissableActivatableWidget
// Size: 0x28 (Inherited: 0x28)
struct UCheckDismissableActivatableWidget : UInterface {
};

// Class FortniteUI.DonutChallengeIdleGame
// Size: 0xbe0 (Inherited: 0x290)
struct UDonutChallengeIdleGame : UCommonUserWidget {
	struct FMulticastInlineDelegate OnNewHighScore; // 0x290(0x10)
	struct FMulticastInlineDelegate OnDistanceScoreChanged; // 0x2a0(0x10)
	struct FMulticastInlineDelegate OnSpeedScoreChanged; // 0x2b0(0x10)
	struct FMulticastInlineDelegate OnStyleScoreChanged; // 0x2c0(0x10)
	struct FMulticastInlineDelegate OnEndMatchScore; // 0x2d0(0x10)
	struct FMulticastInlineDelegate OnDayNightCycleChanged; // 0x2e0(0x10)
	char pad_2F0[0x140]; // 0x2f0(0x140)
	struct FLinearColor BoundsColor; // 0x430(0x10)
	float DayNightCycleTime; // 0x440(0x04)
	float PlayerTopSpeed; // 0x444(0x04)
	float BumpyRideSpeedReduction; // 0x448(0x04)
	char pad_44C[0x4]; // 0x44c(0x04)
	struct FVector2D MapSize; // 0x450(0x10)
	struct FVector2D PlayerCollisionOffset; // 0x460(0x10)
	struct FVector2D PlayerCollisionSize; // 0x470(0x10)
	float MapScale; // 0x480(0x04)
	float MaxNumLevels; // 0x484(0x04)
	float ObjectSpawnPlacementRadius; // 0x488(0x04)
	int32_t NumOfTreeSpawnAttempts; // 0x48c(0x04)
	int32_t NumOfRockSpawnAttempts; // 0x490(0x04)
	int32_t NumOfBigRockSpawnAttempts; // 0x494(0x04)
	int32_t NumOfJumpPadSpawnAttempts; // 0x498(0x04)
	char pad_49C[0x4]; // 0x49c(0x04)
	struct UCurveFloat* Curve_BonusSpawn_Trees; // 0x4a0(0x08)
	struct UCurveFloat* Curve_BonusSpawn_SmallBumps; // 0x4a8(0x08)
	struct UCurveFloat* Curve_BonusSpawn_Bumps; // 0x4b0(0x08)
	struct UCurveFloat* Curve_BonusSpawn_JumpPads; // 0x4b8(0x08)
	struct FName Param_Player_Direction; // 0x4c0(0x04)
	struct FName Param_Player_FacingLeft; // 0x4c4(0x04)
	char pad_4C8[0x8]; // 0x4c8(0x08)
	struct FSlateBrush PlayerBrush; // 0x4d0(0xc0)
	struct FSlateBrush TreeBrush; // 0x590(0xc0)
	struct FSlateBrush RockBrush; // 0x650(0xc0)
	struct FSlateBrush BigRockBrush; // 0x710(0xc0)
	struct FSlateBrush JumpPadBrush; // 0x7d0(0xc0)
	struct FSlateBrush TorchBrush; // 0x890(0xc0)
	struct FSlateBrush MonsterBrush; // 0x950(0xc0)
	struct FSlateBrush ChimiBrush; // 0xa10(0xc0)
	struct FSlateBrush ArmBrush; // 0xad0(0xc0)
	struct UWidgetAnimation* Anim_Jump; // 0xb90(0x08)
	struct UWidgetAnimation* Anim_MediumJump; // 0xb98(0x08)
	struct UWidgetAnimation* Anim_SuperJump; // 0xba0(0x08)
	struct UWidgetAnimation* Anim_BumpyRide; // 0xba8(0x08)
	struct UImage* Image_Player; // 0xbb0(0x08)
	struct UImage* Image_MobileInput; // 0xbb8(0x08)
	struct UImage* Image_MobileInput_Background; // 0xbc0(0x08)
	struct UCommonButtonLegacy* Button_Jump; // 0xbc8(0x08)
	struct UCommonButtonLegacy* Button_MobileJump; // 0xbd0(0x08)
	char pad_BD8[0x8]; // 0xbd8(0x08)

	void TryJump(); // Function FortniteUI.DonutChallengeIdleGame.TryJump // (Final|Native|Private) // @ game+0x9c93e44
	void StartGame(); // Function FortniteUI.DonutChallengeIdleGame.StartGame // (Final|Native|Protected|BlueprintCallable) // @ game+0x9c93e30
	void EndSuperJump(); // Function FortniteUI.DonutChallengeIdleGame.EndSuperJump // (Final|Native|Private) // @ game+0x9c93550
	void EndJump(); // Function FortniteUI.DonutChallengeIdleGame.EndJump // (Final|Native|Private) // @ game+0x9c93538
	void EndBumpyRide(); // Function FortniteUI.DonutChallengeIdleGame.EndBumpyRide // (Final|Native|Private) // @ game+0x9c93514
	void DebugBPFloat(float InFloat); // Function FortniteUI.DonutChallengeIdleGame.DebugBPFloat // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void BPUpdateStyle(int32_t NewStyle); // Function FortniteUI.DonutChallengeIdleGame.BPUpdateStyle // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void BPUpdateSpeed(int32_t NewSpeed); // Function FortniteUI.DonutChallengeIdleGame.BPUpdateSpeed // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void BPUpdateDistance(int32_t NewDistance); // Function FortniteUI.DonutChallengeIdleGame.BPUpdateDistance // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void BPShowHighScore(int32_t inNewHighScore); // Function FortniteUI.DonutChallengeIdleGame.BPShowHighScore // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void BPOnSpeedUpdated(int32_t NewCurSpeed); // Function FortniteUI.DonutChallengeIdleGame.BPOnSpeedUpdated // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void BPOnNextLevelReached(); // Function FortniteUI.DonutChallengeIdleGame.BPOnNextLevelReached // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void BPOnMonsterNearChanged(bool bIsNearLevelMonster); // Function FortniteUI.DonutChallengeIdleGame.BPOnMonsterNearChanged // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void BPOnJump(); // Function FortniteUI.DonutChallengeIdleGame.BPOnJump // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void BPOnGameInitialized(); // Function FortniteUI.DonutChallengeIdleGame.BPOnGameInitialized // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void BPOnFailedJumpPress(); // Function FortniteUI.DonutChallengeIdleGame.BPOnFailedJumpPress // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void BPOnFacingDirectionChanged(bool bIsLeftFacing); // Function FortniteUI.DonutChallengeIdleGame.BPOnFacingDirectionChanged // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void BPOnCrash(); // Function FortniteUI.DonutChallengeIdleGame.BPOnCrash // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void BPOnCollision(enum class EFortDonutIdleGameObject ObjectType); // Function FortniteUI.DonutChallengeIdleGame.BPOnCollision // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void BPGameOver(); // Function FortniteUI.DonutChallengeIdleGame.BPGameOver // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
};

// Class FortniteUI.DonutIdleGameScreen
// Size: 0x528 (Inherited: 0x518)
struct UDonutIdleGameScreen : UFortActivatablePanel {
	struct UWidgetAnimation* Anim_Intro; // 0x518(0x08)
	struct UDonutChallengeIdleGame* Widget_GameLayer; // 0x520(0x08)
};

// Class FortniteUI.FortFireModeStreamingVideo
// Size: 0x50 (Inherited: 0x28)
struct UFortFireModeStreamingVideo : UObject {
	struct UMediaPlayer* MediaPlayer; // 0x28(0x08)
	struct UFortStreamMediaSource* MediaSource; // 0x30(0x08)
	char pad_38[0x18]; // 0x38(0x18)

	void OnSuccessfulURL(struct FString URL); // Function FortniteUI.FortFireModeStreamingVideo.OnSuccessfulURL // (Final|Native|Private) // @ game+0x9c93cd0
	void OnFailedURL(struct FString URL); // Function FortniteUI.FortFireModeStreamingVideo.OnFailedURL // (Final|Native|Private) // @ game+0x9c93b58
	void HandleMediaPlayerPlaybackResumed(); // Function FortniteUI.FortFireModeStreamingVideo.HandleMediaPlayerPlaybackResumed // (Final|Native|Private) // @ game+0x9c93b40
};

// Class FortniteUI.FortBangWrapperContentInterface
// Size: 0x28 (Inherited: 0x28)
struct UFortBangWrapperContentInterface : UInterface {

	void OnStopCallout(); // Function FortniteUI.FortBangWrapperContentInterface.OnStopCallout // (Event|Public|BlueprintEvent) // @ game+0xdef49c
	void OnStartCallout(struct FName TutorialObjectiveName, enum class ETutorialType TutorialType); // Function FortniteUI.FortBangWrapperContentInterface.OnStartCallout // (Event|Public|BlueprintEvent) // @ game+0xdef49c
	void OnBangStateChanged(bool bEnabled, int32_t Count); // Function FortniteUI.FortBangWrapperContentInterface.OnBangStateChanged // (Event|Public|BlueprintEvent) // @ game+0xdef49c
};

// Class FortniteUI.FortColorPickerConfiguration
// Size: 0x38 (Inherited: 0x30)
struct UFortColorPickerConfiguration : UDataAsset {
	bool bNoColorOptionAvailable; // 0x30(0x01)
	enum class EColorPickerType ColorPickerType; // 0x31(0x01)
	bool bInitializeCustomColorFromSelectedSwatch; // 0x32(0x01)
	enum class EColorPickerColorRepresentation CustomColorRepresentation; // 0x33(0x01)
	char pad_34[0x4]; // 0x34(0x04)
};

// Class FortniteUI.MinigameWidgetBase
// Size: 0x328 (Inherited: 0x2d0)
struct UMinigameWidgetBase : UFortHUDElementWidget {
	char pad_2D0[0x30]; // 0x2d0(0x30)
	bool bDisplayCaptureObjectiveRow; // 0x300(0x01)
	char pad_301[0x7]; // 0x301(0x07)
	struct AFortMinigame* CurrentMinigame; // 0x308(0x08)
	char pad_310[0x10]; // 0x310(0x10)
	struct AActor* CurrentContainer; // 0x320(0x08)

	void ResetDisplayValues(); // Function FortniteUI.MinigameWidgetBase.ResetDisplayValues // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnVolumeMinigameChanged(struct AFortMinigame* Minigame); // Function FortniteUI.MinigameWidgetBase.OnVolumeMinigameChanged // (Final|Native|Private) // @ game+0x9dfb588
	void OnPlayerStatUpdated(); // Function FortniteUI.MinigameWidgetBase.OnPlayerStatUpdated // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnObjectiveUpdated(); // Function FortniteUI.MinigameWidgetBase.OnObjectiveUpdated // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnDisplayMinigameStartUI(bool bDisplay); // Function FortniteUI.MinigameWidgetBase.OnDisplayMinigameStartUI // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnDisplayMinigamePregameCountdownUI(bool bDisplay); // Function FortniteUI.MinigameWidgetBase.OnDisplayMinigamePregameCountdownUI // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnDisplayMinigameInProgressUI(bool bDisplay); // Function FortniteUI.MinigameWidgetBase.OnDisplayMinigameInProgressUI // (Native|Event|Protected|BlueprintEvent) // @ game+0x9df9fd4
	void OnDisplayMinigameEndUI(bool bDisplay); // Function FortniteUI.MinigameWidgetBase.OnDisplayMinigameEndUI // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnDisplayMiniGameAbortUI(bool bDisplay); // Function FortniteUI.MinigameWidgetBase.OnDisplayMiniGameAbortUI // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnDisplayCaptureObjectiveUI(bool bDisplay); // Function FortniteUI.MinigameWidgetBase.OnDisplayCaptureObjectiveUI // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnCurrentStateChangedDelegate(struct AFortMinigame* Minigame, enum class EFortMinigameState MinigameState); // Function FortniteUI.MinigameWidgetBase.OnCurrentStateChangedDelegate // (Final|Native|Private) // @ game+0x9df9f10
	struct FAthenaGameMessageData MakeMessageData(enum class EAthenaGameMsgType MsgType, struct FText MsgText, struct USoundCue* MsgSound, float DisplayTime); // Function FortniteUI.MinigameWidgetBase.MakeMessageData // (Final|Native|Static|Protected|BlueprintCallable|BlueprintPure) // @ game+0x9df9b94
	void HideAllMinigameWidgetUI(); // Function FortniteUI.MinigameWidgetBase.HideAllMinigameWidgetUI // (Final|Native|Private) // @ game+0x9df9930
	void HandlePlayerStatChanged(); // Function FortniteUI.MinigameWidgetBase.HandlePlayerStatChanged // (Final|Native|Private) // @ game+0x7b74148
	int32_t GetStatValue(struct UFortMinigameStatFilter* InFilter, bool bGameTotal); // Function FortniteUI.MinigameWidgetBase.GetStatValue // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x9df8748
};

// Class FortniteUI.FortCoreGamerScoreTracker
// Size: 0x330 (Inherited: 0x328)
struct UFortCoreGamerScoreTracker : UMinigameWidgetBase {
	char pad_328[0x8]; // 0x328(0x08)

	void OnUpdate(); // Function FortniteUI.FortCoreGamerScoreTracker.OnUpdate // (Event|Public|BlueprintEvent) // @ game+0xdef49c
	struct FText GetTimeRemainingText(bool& bHasTimeLimit); // Function FortniteUI.FortCoreGamerScoreTracker.GetTimeRemainingText // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x9c93a50
	int32_t GetTeamPlacement(int32_t InTeamIndex); // Function FortniteUI.FortCoreGamerScoreTracker.GetTeamPlacement // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9c939c8
	struct FText GetTeamNameForPlayerState(struct AFortPlayerState* PlayerState); // Function FortniteUI.FortCoreGamerScoreTracker.GetTeamNameForPlayerState // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9c938bc
	struct FText GetTeamName(int32_t InTeamIndex); // Function FortniteUI.FortCoreGamerScoreTracker.GetTeamName // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9c937c0
	int32_t GetTeamIndexFromTeamByte(char InTeamByte); // Function FortniteUI.FortCoreGamerScoreTracker.GetTeamIndexFromTeamByte // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9c93734
	int32_t GetScoreForTeam(int32_t InTeamIndex); // Function FortniteUI.FortCoreGamerScoreTracker.GetScoreForTeam // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9c936a8
	int32_t GetLocalTeamIndex(); // Function FortniteUI.FortCoreGamerScoreTracker.GetLocalTeamIndex // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9c93684
	int32_t GetHighestOpposingTeamIndex(); // Function FortniteUI.FortCoreGamerScoreTracker.GetHighestOpposingTeamIndex // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9c93660
	int32_t GetGoalScore(); // Function FortniteUI.FortCoreGamerScoreTracker.GetGoalScore // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9c935f4
};

// Class FortniteUI.FortCorrectiveActionFlow
// Size: 0x3d8 (Inherited: 0x3a8)
struct UFortCorrectiveActionFlow : UCommonActivatableWidget {
	char pad_3A8[0x10]; // 0x3a8(0x10)
	struct UCommonActivatableWidgetSwitcher* CorrectiveActionScreenSwitcher; // 0x3b8(0x08)
	struct UFortCorrectiveActionGuardianEmailScreen* GuardianEmailScreen; // 0x3c0(0x08)
	struct UFortCorrectiveActionDisplayNameScreen* DisplayNameScreen; // 0x3c8(0x08)
	struct UFortCorrectiveActionDateOfBirthScreen* DateOfBirthScreen; // 0x3d0(0x08)
};

// Class FortniteUI.FortCorrectiveActionScreen
// Size: 0x3c8 (Inherited: 0x3a8)
struct UFortCorrectiveActionScreen : UCommonActivatableWidget {
	char pad_3A8[0x10]; // 0x3a8(0x10)
	struct UCommonButtonBase* Button_Continue; // 0x3b8(0x08)
	struct UCommonButtonBase* Button_PrivacyPolicy; // 0x3c0(0x08)

	void ShowFailureReason(struct FText& FailureReason); // Function FortniteUI.FortCorrectiveActionScreen.ShowFailureReason // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xdef49c
	void ShowCorrectiveActionProcessing(bool bShowProcessing); // Function FortniteUI.FortCorrectiveActionScreen.ShowCorrectiveActionProcessing // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
};

// Class FortniteUI.FortCorrectiveActionGuardianEmailScreen
// Size: 0x3d8 (Inherited: 0x3c8)
struct UFortCorrectiveActionGuardianEmailScreen : UFortCorrectiveActionScreen {
	struct UEditableText* EditableText_GuardianEmailEntry; // 0x3c8(0x08)
	struct UCommonTextBlock* Text_InvalidEmail; // 0x3d0(0x08)
};

// Class FortniteUI.FortCorrectiveActionDisplayNameScreen
// Size: 0x3d0 (Inherited: 0x3c8)
struct UFortCorrectiveActionDisplayNameScreen : UFortCorrectiveActionScreen {
	struct UCommonTextBlock* Text_DisplayName; // 0x3c8(0x08)

	void ShowDisplayNameDownloading(bool bShowProcessing); // Function FortniteUI.FortCorrectiveActionDisplayNameScreen.ShowDisplayNameDownloading // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
};

// Class FortniteUI.FortCorrectiveActionDateOfBirthScreen
// Size: 0x3f0 (Inherited: 0x3c8)
struct UFortCorrectiveActionDateOfBirthScreen : UFortCorrectiveActionScreen {
	char pad_3C8[0x10]; // 0x3c8(0x10)
	struct UComboBoxString* ComboBox_Month; // 0x3d8(0x08)
	struct UComboBoxString* ComboBox_Day; // 0x3e0(0x08)
	struct UEditableText* EditableText_Year; // 0x3e8(0x08)

	void HandleYearChanged(struct FText& Text, enum class ETextCommit CommitMethod); // Function FortniteUI.FortCorrectiveActionDateOfBirthScreen.HandleYearChanged // (Final|Native|Private|HasOutParms) // @ game+0x9c94828
	void HandleMonthChanged(struct FString SelectedItem, enum class ESelectInfo SelectionType); // Function FortniteUI.FortCorrectiveActionDateOfBirthScreen.HandleMonthChanged // (Final|Native|Private) // @ game+0x9c9467c
};

// Class FortniteUI.FortEnterCabinModal
// Size: 0x3d0 (Inherited: 0x3a8)
struct UFortEnterCabinModal : UCommonActivatableWidget {
	char pad_3A8[0x8]; // 0x3a8(0x08)
	struct UWidgetSwitcher* WidgetSwitcher_CabinScreens; // 0x3b0(0x08)
	struct UWidget* VerticalBox_CrewCancelled; // 0x3b8(0x08)
	struct UWidget* VerticalBox_EnterCabin; // 0x3c0(0x08)
	struct UCommonButtonBase* Button_Continue; // 0x3c8(0x08)

	void SwapPanel(struct UWidget* PanelToSwapTo); // Function FortniteUI.FortEnterCabinModal.SwapPanel // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
};

// Class FortniteUI.FortEventDateTimeTextBlock
// Size: 0x390 (Inherited: 0x350)
struct UFortEventDateTimeTextBlock : UCommonTextBlock {
	char pad_350[0x40]; // 0x350(0x40)

	void SetTimespanValue(struct FTimespan InTimespan, enum class DateFormat InFormatStyle); // Function FortniteUI.FortEventDateTimeTextBlock.SetTimespanValue // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x9c94b34
	void SetDateTimeValue(struct FDateTime InDateTime, enum class DateFormat InFormatStyle, float InRefreshDelay); // Function FortniteUI.FortEventDateTimeTextBlock.SetDateTimeValue // (Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x9c94a34
	void SetCountDownCompletionText(struct FText InCompletionText); // Function FortniteUI.FortEventDateTimeTextBlock.SetCountDownCompletionText // (Final|Native|Public|BlueprintCallable) // @ game+0x9c94998
	struct FDateTime GetDateTime(); // Function FortniteUI.FortEventDateTimeTextBlock.GetDateTime // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x5cc28a4
};

// Class FortniteUI.FortEventLevelData
// Size: 0x98 (Inherited: 0x30)
struct UFortEventLevelData : UDataAsset {
	struct FString EventLevelStoreFrontName; // 0x30(0x10)
	struct TSoftObjectPtr<UAthenaRewardEventGraph> EventLevelRewards; // 0x40(0x28)
	struct UFortActivatableVideoPanel* CinematicMovieWidget; // 0x68(0x08)
	struct UFortStreamMediaSource* ElectraMediaSource; // 0x70(0x08)
	struct UMediaPlayer* StreamedMediaPlayer; // 0x78(0x08)
	struct FName CinematicVideoName; // 0x80(0x04)
	char pad_84[0x4]; // 0x84(0x04)
	struct FDataTableRowHandle InteractionHandle; // 0x88(0x10)
};

// Class FortniteUI.FortFrontendOverlayInterface
// Size: 0x28 (Inherited: 0x28)
struct UFortFrontendOverlayInterface : UInterface {
};

// Class FortniteUI.FortGlobalActionDetailsDataSource
// Size: 0x28 (Inherited: 0x28)
struct UFortGlobalActionDetailsDataSource : UInterface {

	void RemoveOnChangeDelegate(struct FDelegate& InDelegate); // Function FortniteUI.FortGlobalActionDetailsDataSource.RemoveOnChangeDelegate // (Native|Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x9c948f4
	struct FFortGlobalActionDetails GetValue(); // Function FortniteUI.FortGlobalActionDetailsDataSource.GetValue // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x9c94650
	void AddOnChangeDelegate(struct FDelegate& InDelegate); // Function FortniteUI.FortGlobalActionDetailsDataSource.AddOnChangeDelegate // (Native|Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x9c945ac
};

// Class FortniteUI.FortHUDVisibilityData
// Size: 0x70 (Inherited: 0x30)
struct UFortHUDVisibilityData : UDataAsset {
	struct FGameplayTag HUDVisibilityGameplayTag; // 0x30(0x04)
	char pad_34[0x4]; // 0x34(0x04)
	struct FText DisplayText; // 0x38(0x18)
	struct FText ToolTipText; // 0x50(0x18)
	bool Visible; // 0x68(0x01)
	char pad_69[0x7]; // 0x69(0x07)
};

// Class FortniteUI.FortIslandDescriptionLineData
// Size: 0x40 (Inherited: 0x28)
struct UFortIslandDescriptionLineData : UObject {
	struct FText IslandDescriptionLine; // 0x28(0x18)
};

// Class FortniteUI.FortIslandDescriptionListEntry
// Size: 0x2a0 (Inherited: 0x290)
struct UFortIslandDescriptionListEntry : UCommonUserWidget {
	char pad_290[0x8]; // 0x290(0x08)
	struct UCommonTextBlock* Text_IslandDescriptionLine; // 0x298(0x08)
};

// Class FortniteUI.FortIslandDescriptionWidget
// Size: 0x298 (Inherited: 0x290)
struct UFortIslandDescriptionWidget : UCommonUserWidget {
	struct UCommonListView* ListView_IslandDescriptionLines; // 0x290(0x08)

	void OnDescriptionChanged(bool bIsEmptyDescription); // Function FortniteUI.FortIslandDescriptionWidget.OnDescriptionChanged // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
};

// Class FortniteUI.FortItemManagementMulchPanel
// Size: 0x28 (Inherited: 0x28)
struct UFortItemManagementMulchPanel : UInterface {

	void ShowMulchConfirmationModal(); // Function FortniteUI.FortItemManagementMulchPanel.ShowMulchConfirmationModal // (Native|Public|BlueprintCallable) // @ game+0x290e680
	void NotifyPanelDeactivated(); // Function FortniteUI.FortItemManagementMulchPanel.NotifyPanelDeactivated // (Native|Protected|BlueprintCallable) // @ game+0x759c204
	void NotifyPanelActivated(); // Function FortniteUI.FortItemManagementMulchPanel.NotifyPanelActivated // (Native|Protected|BlueprintCallable) // @ game+0x63f0ab4
	void HideMulchConfirmationModal(); // Function FortniteUI.FortItemManagementMulchPanel.HideMulchConfirmationModal // (Native|Public|BlueprintCallable) // @ game+0x2944f44
};

// Class FortniteUI.FortPresentationItemLootInfo
// Size: 0xf0 (Inherited: 0x28)
struct UFortPresentationItemLootInfo : UObject {
	struct FFortReceivedItemLootInfo ItemReceivedInfo; // 0x28(0xc8)
};

// Class FortniteUI.ItemReceivedHeaderBase
// Size: 0x280 (Inherited: 0x268)
struct UItemReceivedHeaderBase : UUserWidget {
	struct UFortGiftBoxItem* GiftBoxItem; // 0x268(0x08)
	struct FString FromUsername; // 0x270(0x10)

	void SetBlueprintGiftBoxItem(struct UFortGiftBoxItem* GiftBox, struct FString FromUser, struct TArray<struct FFortReceivedItemLootInfo>& ItemDefs, bool bSelfGift); // Function FortniteUI.ItemReceivedHeaderBase.SetBlueprintGiftBoxItem // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0xdef49c
	void InitFromGiftBoxItem_BP(); // Function FortniteUI.ItemReceivedHeaderBase.InitFromGiftBoxItem_BP // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0xdef49c
};

// Class FortniteUI.FortModalContainerData
// Size: 0x40 (Inherited: 0x30)
struct UFortModalContainerData : UDataAsset {
	struct TArray<struct FFortModalContainerSizeEntry> Entries; // 0x30(0x10)
};

// Class FortniteUI.FortNodeCanvasEntityInterface
// Size: 0x28 (Inherited: 0x28)
struct UFortNodeCanvasEntityInterface : UInterface {
};

// Class FortniteUI.FortOptionsCategoryHeader
// Size: 0x40 (Inherited: 0x28)
struct UFortOptionsCategoryHeader : UObject {
	struct FText DisplayText; // 0x28(0x18)
};

// Class FortniteUI.FortOptionsMenuInputData
// Size: 0x100 (Inherited: 0x30)
struct UFortOptionsMenuInputData : UDataAsset {
	struct FName ActionName; // 0x30(0x04)
	char pad_34[0x4]; // 0x34(0x04)
	struct FText DisplayText; // 0x38(0x18)
	struct FText PrimaryText; // 0x50(0x18)
	struct FText SecondaryText; // 0x68(0x18)
	int32_t ElementNumber; // 0x80(0x04)
	char pad_84[0x4]; // 0x84(0x04)
	struct UCommonTextBlock* TabText; // 0x88(0x08)
	struct FFortActionKeyMapping ActionKeyMapping; // 0x90(0x70)

	float GetInputScale(); // Function FortniteUI.FortOptionsMenuInputData.GetInputScale // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x91bc040
	enum class EFortInputActionGroup GetInputActionGroup(); // Function FortniteUI.FortOptionsMenuInputData.GetInputActionGroup // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9c96050
};

// Class FortniteUI.FortPlayerSurveyResponseChoiceBase
// Size: 0x13f0 (Inherited: 0x13e0)
struct UFortPlayerSurveyResponseChoiceBase : UCommonButtonBase {
	struct UCommonTextBlock* Text_Response; // 0x13e0(0x08)
	char pad_13E8[0x8]; // 0x13e8(0x08)

	void SetChoiceType(enum class EFortPlayerSurveyResponseChoiceType Type); // Function FortniteUI.FortPlayerSurveyResponseChoiceBase.SetChoiceType // (Event|Public|BlueprintEvent) // @ game+0xdef49c
	void OnSurveyResetChoice(); // Function FortniteUI.FortPlayerSurveyResponseChoiceBase.OnSurveyResetChoice // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
};

// Class FortniteUI.FortPlayerSurveyResponseWidget
// Size: 0x3d8 (Inherited: 0x3a8)
struct UFortPlayerSurveyResponseWidget : UCommonActivatableWidget {
	char pad_3A8[0x30]; // 0x3a8(0x30)
};

// Class FortniteUI.FortPopupModal
// Size: 0x270 (Inherited: 0x268)
struct UFortPopupModal : UUserWidget {
	struct UCommonButtonLegacy* IconTextButton_Close; // 0x268(0x08)
};

// Class FortniteUI.FortServerBrowserActionData
// Size: 0x130 (Inherited: 0x30)
struct UFortServerBrowserActionData : UPrimaryDataAsset {
	enum class EFortServerBrowserAction ActionType; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)
	struct FText Title; // 0x38(0x18)
	struct FText Description; // 0x50(0x18)
	char pad_68[0x8]; // 0x68(0x08)
	struct FSlateBrush TileImage; // 0x70(0xc0)
};

// Class FortniteUI.FortServerBrowserActionDataPopup
// Size: 0x160 (Inherited: 0x130)
struct UFortServerBrowserActionDataPopup : UFortServerBrowserActionData {
	struct TSoftClassPtr<UObject> PopupClass; // 0x130(0x28)
	char pad_158[0x8]; // 0x158(0x08)
};

// Class FortniteUI.FortSetting
// Size: 0x180 (Inherited: 0x28)
struct UFortSetting : UObject {
	char pad_28[0x48]; // 0x28(0x48)
	struct UFortLocalPlayer* LocalPlayer; // 0x70(0x08)
	struct UFortSetting* SettingParent; // 0x78(0x08)
	struct UFortSettingRegistry* OwningRegistry; // 0x80(0x08)
	char pad_88[0x60]; // 0x88(0x60)
	struct FFortSettingNameExtensions CustomExtensions; // 0xe8(0x18)
	char pad_100[0x80]; // 0x100(0x80)

	struct FText GetWarningRichText(); // Function FortniteUI.FortSetting.GetWarningRichText // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xa1d19a0
	struct FText GetDynamicDetails(); // Function FortniteUI.FortSetting.GetDynamicDetails // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xa1d18dc
	enum class ESlateVisibility GetDisplayNameVisibility(); // Function FortniteUI.FortSetting.GetDisplayNameVisibility // (Final|Native|Public|BlueprintCallable) // @ game+0x2e65abc
	struct FText GetDisplayName(); // Function FortniteUI.FortSetting.GetDisplayName // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xa1d1860
	struct FString GetDevName(); // Function FortniteUI.FortSetting.GetDevName // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xa1d15d8
	struct FText GetDescriptionRichText(); // Function FortniteUI.FortSetting.GetDescriptionRichText // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x83e8244
};

// Class FortniteUI.FortSettingValue
// Size: 0x180 (Inherited: 0x180)
struct UFortSettingValue : UFortSetting {
};

// Class FortniteUI.FortSettingValueDiscrete
// Size: 0x180 (Inherited: 0x180)
struct UFortSettingValueDiscrete : UFortSettingValue {

	struct TArray<struct FText> GetDiscreteOptions(); // Function FortniteUI.FortSettingValueDiscrete.GetDiscreteOptions // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xa1d1820
	int32_t GetDiscreteOptionInitialIndex(); // Function FortniteUI.FortSettingValueDiscrete.GetDiscreteOptionInitialIndex // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xa1d17f8
	int32_t GetDiscreteOptionIndex(); // Function FortniteUI.FortSettingValueDiscrete.GetDiscreteOptionIndex // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xa1d17d0
	int32_t GetDiscreteOptionDefaultIndex(); // Function FortniteUI.FortSettingValueDiscrete.GetDiscreteOptionDefaultIndex // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xa1d17a8
	struct TArray<struct FText> GetDisabledOptionsReasons(); // Function FortniteUI.FortSettingValueDiscrete.GetDisabledOptionsReasons // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xa1d1768
	struct TArray<struct FText> GetDisabledOptions(); // Function FortniteUI.FortSettingValueDiscrete.GetDisabledOptions // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xa1d1728
};

// Class FortniteUI.FortSettingValueDiscreteDynamic
// Size: 0x1e8 (Inherited: 0x180)
struct UFortSettingValueDiscreteDynamic : UFortSettingValueDiscrete {
	char pad_180[0x68]; // 0x180(0x68)
};

// Class FortniteUI.FortSettingValueDiscreteDynamic_Vector2D
// Size: 0x1e8 (Inherited: 0x1e8)
struct UFortSettingValueDiscreteDynamic_Vector2D : UFortSettingValueDiscreteDynamic {
};

// Class FortniteUI.FortSettingValueDiscreteDynamic_Anchors
// Size: 0x1e8 (Inherited: 0x1e8)
struct UFortSettingValueDiscreteDynamic_Anchors : UFortSettingValueDiscreteDynamic_Vector2D {
};

// Class FortniteUI.FortSocialPanelContainerInterface
// Size: 0x28 (Inherited: 0x28)
struct UFortSocialPanelContainerInterface : UInterface {
};

// Class FortniteUI.FortSocialSidebarPanelInterface
// Size: 0x28 (Inherited: 0x28)
struct UFortSocialSidebarPanelInterface : UInterface {
};

// Class FortniteUI.FortSocialStyle
// Size: 0x9260 (Inherited: 0x30)
struct UFortSocialStyle : UDataAsset {
	struct FSocialStyle style; // 0x30(0x9220)
	struct USocialStyleDataAsset* OverrideStyle; // 0x9250(0x08)
	char pad_9258[0x8]; // 0x9258(0x08)
};

// Class FortniteUI.FortTimespanDataSource
// Size: 0x28 (Inherited: 0x28)
struct UFortTimespanDataSource : UInterface {

	void RemoveOnChangeDelegate(struct FDelegate& InDelegate); // Function FortniteUI.FortTimespanDataSource.RemoveOnChangeDelegate // (Native|Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x9c948f4
	struct FTimespan GetValue(); // Function FortniteUI.FortTimespanDataSource.GetValue // (Native|Event|Public|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x9c94650
	void AddOnChangeDelegate(struct FDelegate& InDelegate); // Function FortniteUI.FortTimespanDataSource.AddOnChangeDelegate // (Native|Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x9c945ac
};

// Class FortniteUI.FortUISpecialEventSubsystem
// Size: 0x58 (Inherited: 0x30)
struct UFortUISpecialEventSubsystem : UGameInstanceSubsystem {
	struct FMulticastInlineDelegate OnNewUISpecialEventState; // 0x30(0x10)
	struct FMulticastInlineDelegate OnTemporarySpecialUIEvent; // 0x40(0x10)
	char pad_50[0x8]; // 0x50(0x08)

	void SpecialUIEventDelegate__DelegateSignature(enum class EFortUISpecialEvents InEventName); // DelegateFunction FortniteUI.FortUISpecialEventSubsystem.SpecialUIEventDelegate__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0xdef49c
	void SetCurrentUISpecialEventState(enum class EFortUISpecialEvents InNewEventState); // Function FortniteUI.FortUISpecialEventSubsystem.SetCurrentUISpecialEventState // (Final|Native|Public|BlueprintCallable) // @ game+0x9c97548
	enum class EFortUISpecialEvents GetCurrentUIEventState(); // Function FortniteUI.FortUISpecialEventSubsystem.GetCurrentUIEventState // (Final|Native|Public|BlueprintCallable) // @ game+0x73190bc
	void CallTemporarySpecialUIEvent(enum class EFortUISpecialEvents InNewTemporaryEvent); // Function FortniteUI.FortUISpecialEventSubsystem.CallTemporarySpecialUIEvent // (Final|Native|Public|BlueprintCallable) // @ game+0x9c974c0
};

// Class FortniteUI.FortUIStateWidget_ForcedIntro
// Size: 0x478 (Inherited: 0x3c0)
struct UFortUIStateWidget_ForcedIntro : UFortUIStateWidgetBase {
	struct FString PlaylistPluginName; // 0x3c0(0x10)
	struct FName PlaylistName; // 0x3d0(0x04)
	char pad_3D4[0x4]; // 0x3d4(0x04)
	struct FDateTime MatchmakingStartTime; // 0x3d8(0x08)
	float MatchmakingStartTimeRandomness; // 0x3e0(0x04)
	bool bUseMCPTime; // 0x3e4(0x01)
	char pad_3E5[0x3]; // 0x3e5(0x03)
	float MaxWaitTimeForMeshConfig; // 0x3e8(0x04)
	float InitialDelayBeforeMM; // 0x3ec(0x04)
	float MMTimeoutTime; // 0x3f0(0x04)
	int32_t MaxNumOfMMAttempts; // 0x3f4(0x04)
	float TimeBetweenMMAttempts; // 0x3f8(0x04)
	float TimeBetweenMMAttemptsMultiplier; // 0x3fc(0x04)
	char pad_400[0x1]; // 0x400(0x01)
	bool bLocalOnlyOnFail; // 0x401(0x01)
	bool bSetToDefaulPlaylistOnDeactivated; // 0x402(0x01)
	bool bSetLocalHasSeenForcedIntroOnDeactivated; // 0x403(0x01)
	char pad_404[0x4]; // 0x404(0x04)
	struct UAthenaLoadingScreenItemDefinition* LoadingScreenDefinition; // 0x408(0x08)
	struct UCommonTextBlock* Text_ForcedIntroState; // 0x410(0x08)
	char pad_418[0x60]; // 0x418(0x60)

	void StartMatch(); // Function FortniteUI.FortUIStateWidget_ForcedIntro.StartMatch // (Final|Exec|Native|Protected|BlueprintCallable) // @ game+0x258f6c0
	void OnNewForcedIntroTextDisplayState(enum class EForcedIntroTextDisplayState NewState); // Function FortniteUI.FortUIStateWidget_ForcedIntro.OnNewForcedIntroTextDisplayState // (Native|Event|Protected|BlueprintEvent) // @ game+0x9ffa50c
	struct TSoftClassPtr<UObject> GetPlaylistLoadingScreenWidget(); // Function FortniteUI.FortUIStateWidget_ForcedIntro.GetPlaylistLoadingScreenWidget // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x9ff9a3c
};

// Class FortniteUI.FortUIStateWidget_ForcedPlaylist
// Size: 0x478 (Inherited: 0x478)
struct UFortUIStateWidget_ForcedPlaylist : UFortUIStateWidget_ForcedIntro {
};

// Class FortniteUI.FortUIStyleDefinitionAsset
// Size: 0xef0 (Inherited: 0x30)
struct UFortUIStyleDefinitionAsset : UDataAsset {
	struct FFortUIStyleDefinition StyleDefinition; // 0x30(0xec0)
};

// Class FortniteUI.FortUserChoiceWidget
// Size: 0x278 (Inherited: 0x278)
struct UFortUserChoiceWidget : UFortUserWidget {

	void SetChoices(struct FChoiceData& ChoiceItems); // Function FortniteUI.FortUserChoiceWidget.SetChoices // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0xdef49c
};

// Class FortniteUI.HudBindingCheckInterface
// Size: 0x28 (Inherited: 0x28)
struct UHudBindingCheckInterface : UInterface {

	void ShowBindWidgets(); // Function FortniteUI.HudBindingCheckInterface.ShowBindWidgets // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x73b31c4
	bool ShouldShowPromptInHud(); // Function FortniteUI.HudBindingCheckInterface.ShouldShowPromptInHud // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1e30d9c
	void HideBindWidgets(); // Function FortniteUI.HudBindingCheckInterface.HideBindWidgets // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x2944f44
	void GetBindActions(struct TArray<struct FName>& OutActions); // Function FortniteUI.HudBindingCheckInterface.GetBindActions // (Native|Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x76dcb58
};

// Class FortniteUI.RebootRallyQRCode
// Size: 0x13e0 (Inherited: 0x13e0)
struct URebootRallyQRCode : UCommonButtonBase {

	void SetIsInvite(bool bIsInvite); // Function FortniteUI.RebootRallyQRCode.SetIsInvite // (Event|Public|BlueprintEvent) // @ game+0xdef49c
};

// Class FortniteUI.SidebarListEmptyPanelButton
// Size: 0x13f0 (Inherited: 0x13e0)
struct USidebarListEmptyPanelButton : UCommonButtonBase {
	struct UCommonTextBlock* ButtonText; // 0x13e0(0x08)
	char pad_13E8[0x8]; // 0x13e8(0x08)
};

// Class FortniteUI.AthenaSpatialStyleChallengeScreenData
// Size: 0x48 (Inherited: 0x30)
struct UAthenaSpatialStyleChallengeScreenData : UDataAsset {
	struct TArray<struct FAthenaSpatialStyleCharacterData> CharacterStyleChallenges; // 0x30(0x10)
	struct UFortChallengeBundleScheduleDefinition* CharacterStyleChallengesSchedule; // 0x40(0x08)
};

// Class FortniteUI.SpatialWidgetInterface
// Size: 0x28 (Inherited: 0x28)
struct USpatialWidgetInterface : UInterface {
};

// Class FortniteUI.FortSubscriptionContentInterface
// Size: 0x28 (Inherited: 0x28)
struct UFortSubscriptionContentInterface : UInterface {
};

// Class FortniteUI.FortActiveFriendsViolator
// Size: 0x298 (Inherited: 0x290)
struct UFortActiveFriendsViolator : UCommonUserWidget {
	struct UCommonTextBlock* Text_ActivePlayerCount; // 0x290(0x08)
};

// Class FortniteUI.FortServerBrowser
// Size: 0x460 (Inherited: 0x3a8)
struct UFortServerBrowser : UCommonActivatableWidget {
	char pad_3A8[0x10]; // 0x3a8(0x10)
	struct TArray<struct UFortServerBrowserActionData*> SupportedActions; // 0x3b8(0x10)
	struct TArray<struct TSoftObjectPtr<UFortServerBrowserActionData>> ExcludedSupportedActions; // 0x3c8(0x10)
	struct TSoftObjectPtr<UFortServerBrowserActionData> DefaultSelectedAction; // 0x3d8(0x28)
	struct UFortServerBrowserListView* ListView_ServerBrowser; // 0x400(0x08)
	struct FDataTableRowHandle NavigateLeftInputAction; // 0x408(0x10)
	struct FDataTableRowHandle NavigateRightInputAction; // 0x418(0x10)
	char pad_428[0x10]; // 0x428(0x10)
	struct UCommonButtonLegacy* Button_Cancel; // 0x438(0x08)
	struct UCommonButtonLegacy* Button_Close; // 0x440(0x08)
	char pad_448[0x18]; // 0x448(0x18)
};

// Class FortniteUI.FortServerBrowserBattleLab
// Size: 0x490 (Inherited: 0x460)
struct UFortServerBrowserBattleLab : UFortServerBrowser {
	char pad_460[0x18]; // 0x460(0x18)
	struct UCommonButtonLegacy* Button_ResetIsland; // 0x478(0x08)
	struct UCommonButtonLegacy* Button_MatchmakingKnobs; // 0x480(0x08)
	struct UFortMatchmakingKnobsModal* Modal_MatchmakingKnobs; // 0x488(0x08)
};

// Class FortniteUI.FortServerBrowserCreative
// Size: 0x4d0 (Inherited: 0x460)
struct UFortServerBrowserCreative : UFortServerBrowser {
	struct TSoftObjectPtr<UFortServerBrowserActionData> DefaultActionIfDiscoveryDisabled; // 0x460(0x28)
	char pad_488[0x48]; // 0x488(0x48)
};

// Class FortniteUI.FortServerBrowserHelper
// Size: 0x90 (Inherited: 0x28)
struct UFortServerBrowserHelper : UObject {
	char pad_28[0x68]; // 0x28(0x68)
};

// Class FortniteUI.FortServerBrowserListView
// Size: 0x398 (Inherited: 0x260)
struct UFortServerBrowserListView : UListViewBase {
	char pad_260[0xd8]; // 0x260(0xd8)
	enum class EOrientation Orientation; // 0x338(0x01)
	char pad_339[0x3]; // 0x339(0x03)
	float EntrySpacing; // 0x33c(0x04)
	char pad_340[0x18]; // 0x340(0x18)
	struct UFortCreativeServerInfoTile* CreativeServerInfoTileEntryClass; // 0x358(0x08)
	struct UFortServerActionTile* ServerActionTileEntryClass; // 0x360(0x08)
	struct UFortServerActionTile* OwnServerActionTileEntryClass; // 0x368(0x08)
	struct UFortPlaylistSelectionActionTile* PlaylistSelectionActionTileEntryClass; // 0x370(0x08)
	char pad_378[0x20]; // 0x378(0x20)
};

// Class FortniteUI.FortServerBrowserPlayground
// Size: 0x478 (Inherited: 0x460)
struct UFortServerBrowserPlayground : UFortServerBrowser {
	char pad_460[0x18]; // 0x460(0x18)
};

// Class FortniteUI.FortServerInfoFriendEntry
// Size: 0x298 (Inherited: 0x290)
struct UFortServerInfoFriendEntry : UCommonUserWidget {
	struct UCommonTextBlock* Text_FriendName; // 0x290(0x08)
};

// Class FortniteUI.FortServerTileBase
// Size: 0x1480 (Inherited: 0x1430)
struct UFortServerTileBase : UCommonButtonLegacy {
	char pad_1430[0x38]; // 0x1430(0x38)
	struct UCommonTextBlock* Text_ServerWarning; // 0x1468(0x08)
	struct UCommonButtonLegacy* Button_Launch; // 0x1470(0x08)
	char pad_1478[0x8]; // 0x1478(0x08)

	void OnLaunchButtonEnableChanged(bool bEnableValue); // Function FortniteUI.FortServerTileBase.OnLaunchButtonEnableChanged // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
};

// Class FortniteUI.FortServerActionTile
// Size: 0x1480 (Inherited: 0x1480)
struct UFortServerActionTile : UFortServerTileBase {
};

// Class FortniteUI.FortNamedServerActionTile
// Size: 0x14a0 (Inherited: 0x1480)
struct UFortNamedServerActionTile : UFortServerActionTile {
	struct UCommonTextBlock* Text_ActionTitle; // 0x1480(0x08)
	struct UCommonTextBlock* Text_ActionDescription; // 0x1488(0x08)
	struct UImage* Image_Background; // 0x1490(0x08)
	char pad_1498[0x8]; // 0x1498(0x08)

	void UpdateButtonText(); // Function FortniteUI.FortNamedServerActionTile.UpdateButtonText // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	bool IsActionIslandSelectType(); // Function FortniteUI.FortNamedServerActionTile.IsActionIslandSelectType // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x9cba538
};

// Class FortniteUI.FortPlaylistSelectionActionTile
// Size: 0x14a0 (Inherited: 0x14a0)
struct UFortPlaylistSelectionActionTile : UFortNamedServerActionTile {
};

// Class FortniteUI.FortServerInfoTileBase
// Size: 0x14a0 (Inherited: 0x1480)
struct UFortServerInfoTileBase : UFortServerTileBase {
	struct UCommonTextBlock* Text_PlayerCount; // 0x1478(0x08)
	struct UDynamicEntryBox* EntryBox_ServerFriendList; // 0x1480(0x08)
	struct UCommonTextBlock* Text_OwnerName; // 0x1488(0x08)
	struct UVerticalBox* VerticalBox_Ownership; // 0x1490(0x08)

	void RequestUpdateBackgroundImage(int32_t FriendListHash); // Function FortniteUI.FortServerInfoTileBase.RequestUpdateBackgroundImage // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnOwnerNameUpdated(); // Function FortniteUI.FortServerInfoTileBase.OnOwnerNameUpdated // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
};

// Class FortniteUI.FortCreativeServerInfoTile
// Size: 0x14b0 (Inherited: 0x14a0)
struct UFortCreativeServerInfoTile : UFortServerInfoTileBase {
	struct UCommonTextBlock* Text_FriendsPlaying; // 0x1498(0x08)
	struct URichTextBlock* RichText_RemainingFriends; // 0x14a0(0x08)
};

// Class FortniteUI.ApolloIntroShimBase
// Size: 0x268 (Inherited: 0x268)
struct UApolloIntroShimBase : UUserWidget {

	void HandleGamePhaseChanged(enum class EAthenaGamePhase GamePhase); // Function FortniteUI.ApolloIntroShimBase.HandleGamePhaseChanged // (Final|Native|Private) // @ game+0x9cb9ef0
};

// Class FortniteUI.FortAsyncAction_CheckForStwMfaReward
// Size: 0x58 (Inherited: 0x30)
struct UFortAsyncAction_CheckForStwMfaReward : UBlueprintAsyncActionBase {
	struct FMulticastInlineDelegate OnCompleted; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFailed; // 0x40(0x10)
	struct AFortPlayerController* PlayerController; // 0x50(0x08)

	struct UFortAsyncAction_CheckForStwMfaReward* CheckForStwMfaReward(struct AFortPlayerController* PlayerController); // Function FortniteUI.FortAsyncAction_CheckForStwMfaReward.CheckForStwMfaReward // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x9cb9a80
};

// Class FortniteUI.FortAsyncAction_CreateWidgetAsync
// Size: 0x98 (Inherited: 0x30)
struct UFortAsyncAction_CreateWidgetAsync : UBlueprintAsyncActionBase {
	struct FMulticastInlineDelegate OnComplete; // 0x30(0x10)
	char pad_40[0x58]; // 0x40(0x58)

	struct UFortAsyncAction_CreateWidgetAsync* CreateWidgetAsync(struct UObject* WorldContextObject, struct TSoftClassPtr<UObject> UserWidgetSoftClass, struct APlayerController* OwningPlayer, bool bSuspendInputUntilComplete); // Function FortniteUI.FortAsyncAction_CreateWidgetAsync.CreateWidgetAsync // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1cc272c
};

// Class FortniteUI.FortAsyncAction_LoadBannerAsset
// Size: 0x78 (Inherited: 0x30)
struct UFortAsyncAction_LoadBannerAsset : UBlueprintAsyncActionBase {
	struct FMulticastInlineDelegate BannerAssetLoadComplete; // 0x30(0x10)
	char pad_40[0x38]; // 0x40(0x38)

	struct UFortAsyncAction_LoadBannerAsset* AsyncLoadBannerAsset(struct UObject* WorldContextObject, struct TSoftObjectPtr<UObject> AssetToLoad, struct UMaterialInstanceDynamic* MIDRef, struct FName BannerColorName); // Function FortniteUI.FortAsyncAction_LoadBannerAsset.AsyncLoadBannerAsset // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x9cb9910
};

// Class FortniteUI.FortAsyncAction_LoadCurrentSubgameProfiles
// Size: 0x58 (Inherited: 0x30)
struct UFortAsyncAction_LoadCurrentSubgameProfiles : UBlueprintAsyncActionBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFailure; // 0x40(0x10)
	struct AFortPlayerController* PlayerController; // 0x50(0x08)

	struct UFortAsyncAction_LoadCurrentSubgameProfiles* LoadCurrentSubgameProfiles(struct AFortPlayerController* PlayerController); // Function FortniteUI.FortAsyncAction_LoadCurrentSubgameProfiles.LoadCurrentSubgameProfiles // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x9cba568
};

// Class FortniteUI.FortAsyncAction_ShowConfirmation_NUI
// Size: 0x1c0 (Inherited: 0x30)
struct UFortAsyncAction_ShowConfirmation_NUI : UBlueprintAsyncActionBase {
	struct FMulticastInlineDelegate DialogResult; // 0x30(0x10)
	struct UObject* WorldContextObject; // 0x40(0x08)
	struct UFortLocalPlayer* TargetLocalPlayer; // 0x48(0x08)
	struct FFortDialogDescription_NUI Description; // 0x50(0x160)
	char pad_1B0[0x10]; // 0x1b0(0x10)

	struct UFortAsyncAction_ShowConfirmation_NUI* ShowSimpleConfirmationDialog_NUI(struct UObject* InWorldContextObject, struct FSlateBrush Icon, struct FText Title, struct FText message, bool bShowConfirm, bool bShowDecline, struct UWidget* AdditionalContent, struct UWidget* LeftAdditionalContent, struct ULocalPlayer* TargetPlayer); // Function FortniteUI.FortAsyncAction_ShowConfirmation_NUI.ShowSimpleConfirmationDialog_NUI // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x9cbb274
	struct UFortAsyncAction_ShowConfirmation_NUI* ShowSimpleConfirmationDialog_CustomInput(struct UObject* InWorldContextObject, struct FSlateBrush Icon, struct FText Title, struct FText message, struct FName ConfirmAction, struct FName DeclineAction, struct UWidget* AdditionalContent, struct UWidget* LeftAdditionalContent, bool Cancelable, struct ULocalPlayer* TargetPlayer); // Function FortniteUI.FortAsyncAction_ShowConfirmation_NUI.ShowSimpleConfirmationDialog_CustomInput // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x9cbaefc
	struct UFortAsyncAction_ShowConfirmation_NUI* ShowConfirmationDialog_NUI(struct UObject* InWorldContextObject, struct FSlateBrush Icon, struct FText Title, struct FText message, struct TArray<struct FConfirmationDialogAction>& ConfirmButtonInputActions, struct FName& DeclineButtonInputAction, struct UWidget* AdditionalContent, struct UWidget* LeftAdditionalContent, struct ULocalPlayer* TargetPlayer); // Function FortniteUI.FortAsyncAction_ShowConfirmation_NUI.ShowConfirmationDialog_NUI // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9cbaae4
};

// Class FortniteUI.FortAsyncAction_PushPrimaryContent
// Size: 0x78 (Inherited: 0x30)
struct UFortAsyncAction_PushPrimaryContent : UBlueprintAsyncActionBase {
	struct FMulticastInlineDelegate OnPrimaryContentPushed; // 0x30(0x10)
	char pad_40[0x38]; // 0x40(0x38)

	struct UFortAsyncAction_PushPrimaryContent* PushPrimaryContentSoftClassAsyncForPlayer(struct APlayerController* ContextPC, struct TSoftClassPtr<UObject> SoftWidgetClass); // Function FortniteUI.FortAsyncAction_PushPrimaryContent.PushPrimaryContentSoftClassAsyncForPlayer // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x9cba890
	struct UFortAsyncAction_PushPrimaryContent* PushPrimaryContentSoftClassAsync(struct UUserWidget* ContextWidget, struct TSoftClassPtr<UObject> SoftWidgetClass); // Function FortniteUI.FortAsyncAction_PushPrimaryContent.PushPrimaryContentSoftClassAsync // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x9cba798
	struct UFortAsyncAction_PushPrimaryContent* PushPrimaryContentClassAsyncForPlayer(struct APlayerController* ContextPC, struct UCommonActivatableWidget* WidgetClass); // Function FortniteUI.FortAsyncAction_PushPrimaryContent.PushPrimaryContentClassAsyncForPlayer // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x9cba6d4
	struct UFortAsyncAction_PushPrimaryContent* PushPrimaryContentClassAsync(struct UUserWidget* ContextWidget, struct UCommonActivatableWidget* WidgetClass); // Function FortniteUI.FortAsyncAction_PushPrimaryContent.PushPrimaryContentClassAsync // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x9cba610
	void OnPrimaryContentPushed__DelegateSignature(struct UCommonActivatableWidget* ActivatableWidget); // DelegateFunction FortniteUI.FortAsyncAction_PushPrimaryContent.OnPrimaryContentPushed__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0xdef49c
};

// Class FortniteUI.AthenaFPSBase
// Size: 0x2b0 (Inherited: 0x290)
struct UAthenaFPSBase : UCommonUserWidget {
	struct UCommonTextBlock* FPS; // 0x290(0x08)
	char pad_298[0x18]; // 0x298(0x18)

	void HandleShowFPSChanged(bool bInShowFPS); // Function FortniteUI.AthenaFPSBase.HandleShowFPSChanged // (Final|Native|Protected) // @ game+0x9cba25c
};

// Class FortniteUI.AthenaMinimap
// Size: 0x158 (Inherited: 0x148)
struct UAthenaMinimap : UWidget {
	struct FVector2D DesiredSize; // 0x148(0x10)
};

// Class FortniteUI.AthenaRecordingBase
// Size: 0x2d0 (Inherited: 0x2d0)
struct UAthenaRecordingBase : UFortHUDElementWidget {
};

// Class FortniteUI.AthenaTemperatureBase
// Size: 0x2a0 (Inherited: 0x290)
struct UAthenaTemperatureBase : UCommonUserWidget {
	struct UTextBlock* Temperature; // 0x290(0x08)
	char pad_298[0x8]; // 0x298(0x08)

	void StopTimer(); // Function FortniteUI.AthenaTemperatureBase.StopTimer // (Final|Native|Private|BlueprintCallable) // @ game+0x9cbb84c
	void StartTimer(); // Function FortniteUI.AthenaTemperatureBase.StartTimer // (Final|Native|Private|BlueprintCallable) // @ game+0x9cbb838
};

// Class FortniteUI.AthenaLoadingScreenPreviewPanelBase
// Size: 0x508 (Inherited: 0x4e8)
struct UAthenaLoadingScreenPreviewPanelBase : UAthenaLoadingScreenPreviewPanel {
	struct UNativeWidgetHost* LoadingScreenSlot; // 0x4e8(0x08)
	char pad_4F0[0x8]; // 0x4f0(0x08)
	struct UCommonButtonLegacy* Button_Close; // 0x4f8(0x08)
	struct UCommonButtonLegacy* Button_CloseMobile; // 0x500(0x08)
};

// Class FortniteUI.ApolloIntroLoadingPanel
// Size: 0x510 (Inherited: 0x508)
struct UApolloIntroLoadingPanel : UAthenaLoadingScreenPreviewPanelBase {
	struct UFortPlaylistAthena* ApolloIntroPlaylist; // 0x508(0x08)
};

// Class FortniteUI.AthenaAIKillsBase
// Size: 0x2e8 (Inherited: 0x2d0)
struct UAthenaAIKillsBase : UFortHUDElementWidget {
	struct UTextBlock* KillsText; // 0x2d0(0x08)
	struct UObject* KillsSource; // 0x2d8(0x08)
	bool bCustomKillSource; // 0x2e0(0x01)
	char pad_2E1[0x7]; // 0x2e1(0x07)

	void SetKillsSourcePlayerState(struct AFortPlayerStateAthena* InPlayerState); // Function FortniteUI.AthenaAIKillsBase.SetKillsSourcePlayerState // (Final|Native|Public|BlueprintCallable) // @ game+0x9cbaa40
	void SetKillsSourcePlayerController(struct AFortPlayerControllerAthena* InPlayerController); // Function FortniteUI.AthenaAIKillsBase.SetKillsSourcePlayerController // (Final|Native|Public|BlueprintCallable) // @ game+0x9cbaa40
};

// Class FortniteUI.AthenaAvailableSquadSlotsListBase
// Size: 0x2f0 (Inherited: 0x2d0)
struct UAthenaAvailableSquadSlotsListBase : UFortHUDElementWidget {
	int32_t MaxNumberOfAvailableSquadSlots; // 0x2d0(0x04)
	bool bAlwaysDisplayTopEntryAsDetailed; // 0x2d4(0x01)
	char pad_2D5[0xb]; // 0x2d5(0x0b)
	struct UDynamicEntryBox* EntryBox_AvailableSlotsList; // 0x2e0(0x08)
	struct UAthenaPlayerViewModel* CachedPlayerVM; // 0x2e8(0x08)

	void UpdateSquadFromMinigameOptionChange(); // Function FortniteUI.AthenaAvailableSquadSlotsListBase.UpdateSquadFromMinigameOptionChange // (Final|Native|Private) // @ game+0x9cbbddc
	void UpdateIsTeamMiniGameOnMinigameVolumeChanged(struct AFortVolume* Volume); // Function FortniteUI.AthenaAvailableSquadSlotsListBase.UpdateIsTeamMiniGameOnMinigameVolumeChanged // (Final|Native|Private) // @ game+0x9cbb938
	void UpdateIsTeamMiniGameOnGameStateChanged(struct AFortMinigame* Minigame, enum class EFortMinigameState MinigameState); // Function FortniteUI.AthenaAvailableSquadSlotsListBase.UpdateIsTeamMiniGameOnGameStateChanged // (Final|Native|Private) // @ game+0x9cbb874
	void HandleSquadMemberDisconnected(struct AFortPlayerStateAthena* Player); // Function FortniteUI.AthenaAvailableSquadSlotsListBase.HandleSquadMemberDisconnected // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void HandlePlayerUniqueIdReplicated(struct FUniqueNetIdRepl& UniqueId); // Function FortniteUI.AthenaAvailableSquadSlotsListBase.HandlePlayerUniqueIdReplicated // (Final|Native|Private|HasOutParms) // @ game+0x9cba19c
	void HandlePlayerExitVolume(struct APlayerState* ClientPlayerState, struct AFortVolume* Volume); // Function FortniteUI.AthenaAvailableSquadSlotsListBase.HandlePlayerExitVolume // (Final|Native|Private) // @ game+0x9cba0d8
	void HandlePlayerEnterVolume(struct APlayerState* ClientPlayerState, struct AFortVolume* Volume); // Function FortniteUI.AthenaAvailableSquadSlotsListBase.HandlePlayerEnterVolume // (Final|Native|Private) // @ game+0x9cba014
	void HandleGameMemberChanged(char InSquadId, char InTeamIndex, struct AFortPlayerStateAthena* ChangedPS); // Function FortniteUI.AthenaAvailableSquadSlotsListBase.HandleGameMemberChanged // (Final|Native|Private) // @ game+0x9cb9df8
};

// Class FortniteUI.AthenaAvailableSquadSlotsListEntryBase
// Size: 0x2d8 (Inherited: 0x2d0)
struct UAthenaAvailableSquadSlotsListEntryBase : UFortHUDElementWidget {
	enum class EAvailableSquadSlotsListEntryState CurrentEntryState; // 0x2d0(0x01)
	char pad_2D1[0x7]; // 0x2d1(0x07)

	void BP_OnEntryStateUpdated(enum class EAvailableSquadSlotsListEntryState NewEntryState); // Function FortniteUI.AthenaAvailableSquadSlotsListEntryBase.BP_OnEntryStateUpdated // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
};

// Class FortniteUI.AthenaCareerScreen
// Size: 0x590 (Inherited: 0x4e0)
struct UAthenaCareerScreen : UCommonActivatablePanelLegacy {
	struct TSoftClassPtr<UObject> LeaderboardsScreenClass; // 0x4e0(0x28)
	struct TSoftClassPtr<UObject> ReplayBrowserScreenClass; // 0x508(0x28)
	struct FDataTableRowHandle BackToSocialTabInputActionRowHandle; // 0x530(0x10)
	struct UCommonTextBlock* Text_AccountLevel; // 0x540(0x08)
	struct UCommonButtonLegacy* Button_Leaderboards; // 0x548(0x08)
	struct UCommonButtonLegacy* Button_Replays; // 0x550(0x08)
	struct UAthenaFeatTimelineListView* ListView_FeatTimeline; // 0x558(0x08)
	struct UCommonTextBlock* Text_ChapterContext; // 0x560(0x08)
	struct UBacchusCloseButton* Mobile_CloseButton; // 0x568(0x08)
	struct UCommonTextBlock* Text_MobileTabLabel; // 0x570(0x08)
	struct UImage* Image_LeftFill; // 0x578(0x08)
	struct UImage* Image_RightFill; // 0x580(0x08)
	struct UImage* Image_Gradient; // 0x588(0x08)

	void ShowFeats(bool bHasCompletedFeats); // Function FortniteUI.AthenaCareerScreen.ShowFeats // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
};

// Class FortniteUI.AthenaChallengeEntry
// Size: 0x270 (Inherited: 0x268)
struct UAthenaChallengeEntry : UUserWidget {
	struct UCommonRichTextBlock* Text_CurrentTask; // 0x268(0x08)
};

// Class FortniteUI.AthenaChallengesWidget
// Size: 0x378 (Inherited: 0x2d0)
struct UAthenaChallengesWidget : UFortHUDElementWidget {
	char pad_2D0[0x40]; // 0x2d0(0x40)
	struct UCommonTextBlock* Text_Challenges; // 0x310(0x08)
	struct UDynamicEntryBox* DynamicEntryBox_ChallengeEntries; // 0x318(0x08)
	char pad_320[0x50]; // 0x320(0x50)
	struct FFortPrioritizedWidgetData PrioritizedWidgetData; // 0x370(0x02)
	bool bXPSystemRequiredForChallenges; // 0x372(0x01)
	char pad_373[0x5]; // 0x373(0x05)

	bool IsXPSystemRequiredForChallenges(); // Function FortniteUI.AthenaChallengesWidget.IsXPSystemRequiredForChallenges // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x9cba550
	void HandleDisplayDynamicQuestUpdate(struct UFortQuestObjectiveInfo* QuestObjective, bool DisplayStatusUpdate, bool DisplayAnnouncementUpdate); // Function FortniteUI.AthenaChallengesWidget.HandleDisplayDynamicQuestUpdate // (Native|Protected) // @ game+0x9cb9cf8
	void BP_WidgetIsFinished(); // Function FortniteUI.AthenaChallengesWidget.BP_WidgetIsFinished // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void BP_OnWidgetActivated(); // Function FortniteUI.AthenaChallengesWidget.BP_OnWidgetActivated // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
};

// Class FortniteUI.AthenaCollectionScreenContainer
// Size: 0x500 (Inherited: 0x3a8)
struct UAthenaCollectionScreenContainer : UCommonActivatableWidget {
	char pad_3A8[0x20]; // 0x3a8(0x20)
	struct FAthenaMapScreenContainerTabInfo MapTabInfo; // 0x3c8(0x50)
	struct UCommonVisibilitySwitcher* VisibilitySwitcher_Content; // 0x418(0x08)
	struct UCommonButtonLegacy* MobileCloseButton; // 0x420(0x08)
	struct TArray<struct FAthenaCollectionScreenContainerTabInfo> TabInfos; // 0x428(0x10)
	struct FDataTableRowHandle NextTabInputAction; // 0x438(0x10)
	struct FDataTableRowHandle PreviousTabInputAction; // 0x448(0x10)
	struct UDynamicEntryBox* EntryBox_TabButtons; // 0x458(0x08)
	struct UCommonTextBlock* Text_TabTitle; // 0x460(0x08)
	struct TArray<struct FAthenaCollectionScreenContainerTabInfo> ActiveTabInfos; // 0x468(0x10)
	char pad_478[0x88]; // 0x478(0x88)

	void EnableTabActions(); // Function FortniteUI.AthenaCollectionScreenContainer.EnableTabActions // (Final|Native|Protected|BlueprintCallable) // @ game+0x9cb9b40
	void DisableTabActions(); // Function FortniteUI.AthenaCollectionScreenContainer.DisableTabActions // (Final|Native|Protected|BlueprintCallable) // @ game+0x9cb9b0c
	void BP_OnShowTabsSet(bool bShowTabs); // Function FortniteUI.AthenaCollectionScreenContainer.BP_OnShowTabsSet // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
};

// Class FortniteUI.AthenaCollectionScreenContainerTabButton
// Size: 0x1470 (Inherited: 0x1430)
struct UAthenaCollectionScreenContainerTabButton : UCommonButtonLegacy {
	struct UCommonLazyImage* LazyImage_Icon; // 0x1430(0x08)
	struct FString CollectionType; // 0x1438(0x10)
	struct FVector2D ImageSize_Mobile; // 0x1448(0x10)
	struct FText TabTitle; // 0x1458(0x18)

	void SetIcon(struct TSoftObjectPtr<UObject> LazyObject); // Function FortniteUI.AthenaCollectionScreenContainerTabButton.SetIcon // (Final|Native|Public|BlueprintCallable) // @ game+0x9cba988
	void BP_ShowBang(bool bShow); // Function FortniteUI.AthenaCollectionScreenContainerTabButton.BP_ShowBang // (Event|Public|BlueprintEvent) // @ game+0xdef49c
};

// Class FortniteUI.AthenaCommonPrioritizedWidget
// Size: 0x318 (Inherited: 0x2d0)
struct UAthenaCommonPrioritizedWidget : UFortHUDElementWidget {
	char pad_2D0[0x40]; // 0x2d0(0x40)
	bool bAutoManagePriorityByVisibility; // 0x310(0x01)
	struct FFortPrioritizedWidgetData PrioritizationData; // 0x311(0x02)
	char pad_313[0x5]; // 0x313(0x05)

	void OnStompFailed(); // Function FortniteUI.AthenaCommonPrioritizedWidget.OnStompFailed // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnStompedByOtherWidget(); // Function FortniteUI.AthenaCommonPrioritizedWidget.OnStompedByOtherWidget // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void K2_OnBecomeInactive(); // Function FortniteUI.AthenaCommonPrioritizedWidget.K2_OnBecomeInactive // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void K2_OnBecomeActive(); // Function FortniteUI.AthenaCommonPrioritizedWidget.K2_OnBecomeActive // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
};

// Class FortniteUI.AthenaCompassBase
// Size: 0x8e0 (Inherited: 0x2d0)
struct UAthenaCompassBase : UFortHUDElementWidget {
	struct UMaterialInstanceDynamic* CompassMaterial; // 0x2d0(0x08)
	struct UImage* Image_Compass; // 0x2d8(0x08)
	struct FSlateBrush MarkerBrush; // 0x2e0(0xc0)
	struct FSlateBrush HeadingIndicatorBrush; // 0x3a0(0xc0)
	struct FSlateBrush StormIndicatorBrush; // 0x460(0xc0)
	float MarkerVerticalOffset; // 0x520(0x04)
	float DistanceTextVerticalOffset; // 0x524(0x04)
	float DistanceTextHorizontalOffset; // 0x528(0x04)
	char pad_52C[0x4]; // 0x52c(0x04)
	struct FSlateFontInfo HeadingFont; // 0x530(0x58)
	struct FSlateFontInfo DistanceTextFont; // 0x588(0x58)
	struct FSlateBrush TeammateGunshotIndicatorBrush; // 0x5e0(0xc0)
	struct FSlateBrush EnemyGunshotIndicatorBrush; // 0x6a0(0xc0)
	float TimeToShowGunshotIndicators; // 0x760(0x04)
	char pad_764[0x4]; // 0x764(0x04)
	struct UCurveFloat* GunshotIndicatorScaleOverTime; // 0x768(0x08)
	struct UCurveFloat* GunshotIndicatorScaleByStrength; // 0x770(0x08)
	struct UCurveFloat* GunshotIndicatorAlphaOverTime; // 0x778(0x08)
	struct UCurveFloat* GunshotIndicatorAlphaByHeading; // 0x780(0x08)
	char pad_788[0x8]; // 0x788(0x08)
	struct FSlateBrush DefaultPinnedQuestIconBrush; // 0x790(0xc0)
	float PinnedQuestAlphaRotCutoff; // 0x850(0x04)
	float PinnedQuestDistanceRotCutoff; // 0x854(0x04)
	float PinnedQuestIconVerticalOffset; // 0x858(0x04)
	float PinnedQuestDistanceTextVerticalOffset; // 0x85c(0x04)
	struct FSlateFontInfo PinnedQuestDistanceTextFont; // 0x860(0x58)
	char pad_8B8[0x28]; // 0x8b8(0x28)
};

// Class FortniteUI.AthenaConfirmationWindow
// Size: 0x428 (Inherited: 0x3a8)
struct UAthenaConfirmationWindow : UCommonActivatableWidget {
	struct UCommonTextBlock* Text_Title; // 0x3a8(0x08)
	struct UCommonTextBlock* Text_PostConfirmation; // 0x3b0(0x08)
	struct UCommonRichTextBlock* RichText_Description; // 0x3b8(0x08)
	struct UFortLazyImage* Image_MainIcon; // 0x3c0(0x08)
	struct UDynamicEntryBox* EntryBox_Buttons; // 0x3c8(0x08)
	struct UBacchusCloseButton* Button_Close; // 0x3d0(0x08)
	struct UCommonBorder* Border_TapToCloseZone; // 0x3d8(0x08)
	struct UWidgetAnimation* BoundAnim_PostConfirm; // 0x3e0(0x08)
	struct FDataTableRowHandle CancelAction; // 0x3e8(0x10)
	struct UCommonButtonBase* ConfirmButtonClass; // 0x3f8(0x08)
	struct UCommonButtonBase* DeclineButtonClass; // 0x400(0x08)
	struct UCommonButtonBase* CancelButtonClass; // 0x408(0x08)
	char pad_410[0x18]; // 0x410(0x18)

	void OnShowConfirmationContent(); // Function FortniteUI.AthenaConfirmationWindow.OnShowConfirmationContent // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnSetButtonText(struct UCommonButtonBase* Button, struct FText& Text); // Function FortniteUI.AthenaConfirmationWindow.OnSetButtonText // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xdef49c
	struct FEventReply HandleTapToCloseZoneMouseButtonDown(struct FGeometry MyGeometry, struct FPointerEvent& MouseEvent); // Function FortniteUI.AthenaConfirmationWindow.HandleTapToCloseZoneMouseButtonDown // (Final|Native|Private|HasOutParms) // @ game+0x9cba2ec
};

// Class FortniteUI.AthenaMarkedActorIndicator
// Size: 0x5c0 (Inherited: 0x370)
struct UAthenaMarkedActorIndicator : UFortActorIndicatorWidget {
	char pad_370[0x28]; // 0x370(0x28)
	struct FFortWorldMarkerData MarkerData; // 0x398(0x160)
	struct FMarkedActorDisplayInfo MarkerDisplay; // 0x4f8(0x98)
	struct UFortMarkerDetailsTable* DetailsTable; // 0x590(0x08)
	float FreshLargeItemShowTime; // 0x598(0x04)
	float IndicatorDotSizeThreshold; // 0x59c(0x04)
	struct UWidgetSwitcher* Switcher_IndicatorSize; // 0x5a0(0x08)
	struct UPanelWidget* Panel_SmallIndicator; // 0x5a8(0x08)
	struct UPanelWidget* Panel_LargeIndicator; // 0x5b0(0x08)
	struct UCommonTextBlock* Text_Distance; // 0x5b8(0x08)

	void OnSetMarkerData(struct FFortWorldMarkerData& FortWorldMarkerData); // Function FortniteUI.AthenaMarkedActorIndicator.OnSetMarkerData // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xdef49c
};

// Class FortniteUI.AthenaContextTutorialIndicator
// Size: 0x600 (Inherited: 0x5c0)
struct UAthenaContextTutorialIndicator : UAthenaMarkedActorIndicator {
	float OffscreenMaxTreshold; // 0x5c0(0x04)
	char pad_5C4[0x4]; // 0x5c4(0x04)
	struct UOverlay* ; // 0x5c8(0x08)
	char pad_5D0[0x4]; // 0x5d0(0x04)
	float ScreenEdgePaddingSizePercent; // 0x5d4(0x04)
	char pad_5D8[0x28]; // 0x5d8(0x28)

	void SwitchIndicatorSize(); // Function FortniteUI.AthenaContextTutorialIndicator.SwitchIndicatorSize // (Final|Native|Protected|BlueprintCallable) // @ game+0x9cbb860
	void SetScreenPercent(float Percent); // Function FortniteUI.AthenaContextTutorialIndicator.SetScreenPercent // (Event|Public|BlueprintEvent) // @ game+0xdef49c
	void SetIndicatorText(struct FText& Text); // Function FortniteUI.AthenaContextTutorialIndicator.SetIndicatorText // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0xdef49c
	void PlayOutAnimation(); // Function FortniteUI.AthenaContextTutorialIndicator.PlayOutAnimation // (Event|Public|BlueprintEvent) // @ game+0xdef49c
	void PlayInAnimation(); // Function FortniteUI.AthenaContextTutorialIndicator.PlayInAnimation // (Event|Public|BlueprintEvent) // @ game+0xdef49c
	void PlayBounceAnimation(); // Function FortniteUI.AthenaContextTutorialIndicator.PlayBounceAnimation // (Event|Public|BlueprintEvent) // @ game+0xdef49c
	float GetMinTreshold(); // Function FortniteUI.AthenaContextTutorialIndicator.GetMinTreshold // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9cb9b9c
	float GetMaxTreshold(); // Function FortniteUI.AthenaContextTutorialIndicator.GetMaxTreshold // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9cb9b84
	float GetMaxOffscreenTreshold(); // Function FortniteUI.AthenaContextTutorialIndicator.GetMaxOffscreenTreshold // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9cb9b6c
	float GetCurrentDotProduct(); // Function FortniteUI.AthenaContextTutorialIndicator.GetCurrentDotProduct // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9cb9b54
};

// Class FortniteUI.AthenaContextualChallengesWidget
// Size: 0x378 (Inherited: 0x378)
struct UAthenaContextualChallengesWidget : UAthenaChallengesWidget {

	bool ShouldOutroAutomatically(); // Function FortniteUI.AthenaContextualChallengesWidget.ShouldOutroAutomatically // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x9cbaac0
	void OnResetOutroDelay(); // Function FortniteUI.AthenaContextualChallengesWidget.OnResetOutroDelay // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnNewContextualHeader(struct FText& NewText); // Function FortniteUI.AthenaContextualChallengesWidget.OnNewContextualHeader // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xdef49c
	void HandleToggleFullscreenMap(bool bFullscreenMapVisible); // Function FortniteUI.AthenaContextualChallengesWidget.HandleToggleFullscreenMap // (Final|Native|Protected) // @ game+0x9cba4a4
	void HandleNewContextualObjectives(struct TArray<struct UFortQuestItem*>& InContextualQuests); // Function FortniteUI.AthenaContextualChallengesWidget.HandleNewContextualObjectives // (Final|Native|Protected|HasOutParms) // @ game+0x9cb9f78
	float GetOutroDelay(); // Function FortniteUI.AthenaContextualChallengesWidget.GetOutroDelay // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x9cb9bb4
};

// Class FortniteUI.AthenaCosmeticUnlockingInfo
// Size: 0x2e8 (Inherited: 0x290)
struct UAthenaCosmeticUnlockingInfo : UCommonUserWidget {
	struct UCommonRichTextBlock* RichText_StaticUnlockingText; // 0x290(0x08)
	struct UCommonRichTextBlock* RichText_UnlockingText; // 0x298(0x08)
	struct UProgressBar* ProgressBar_StepsCompleted; // 0x2a0(0x08)
	struct UCommonRichTextBlock* RichText_ProgressCompletion; // 0x2a8(0x08)
	struct FString EmphasisStyle; // 0x2b0(0x10)
	struct FString ProgressCompletionNumericStyle; // 0x2c0(0x10)
	struct UAthenaCosmeticItemDefinition* CosmeticItemDef; // 0x2d0(0x08)
	char pad_2D8[0x10]; // 0x2d8(0x10)

	void ShowUnlockingInfoForCosmeticVariant(struct UAthenaCosmeticItemDefinition* InCosmeticItemDef, struct FGameplayTag& InVariantChannel, struct FGameplayTag& InVariant); // Function FortniteUI.AthenaCosmeticUnlockingInfo.ShowUnlockingInfoForCosmeticVariant // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x9cbb718
	void ShowUnlockingInfoForCosmetic(struct UAthenaCosmeticItemDefinition* InCosmeticItemDef); // Function FortniteUI.AthenaCosmeticUnlockingInfo.ShowUnlockingInfoForCosmetic // (Final|Native|Public|BlueprintCallable) // @ game+0x9cbb698
	void ShowUnlockingInfo(struct UAthenaCosmeticItemDefinition* UnlockItem, struct UFortItemDefinition* UnlockSource); // Function FortniteUI.AthenaCosmeticUnlockingInfo.ShowUnlockingInfo // (Final|Native|Public|BlueprintCallable) // @ game+0x9cbb5a8
	void ShowSeasonUnlockingInfo(int32_t SeasonNumber, int32_t TierNumber); // Function FortniteUI.AthenaCosmeticUnlockingInfo.ShowSeasonUnlockingInfo // (Final|Native|Public|BlueprintCallable) // @ game+0x9cbae3c
	void RequestUpdateAnim(); // Function FortniteUI.AthenaCosmeticUnlockingInfo.RequestUpdateAnim // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void RequestOutroAnim(); // Function FortniteUI.AthenaCosmeticUnlockingInfo.RequestOutroAnim // (Event|Protected|BlueprintCallable|BlueprintEvent) // @ game+0xdef49c
	void RequestIntroAnim(); // Function FortniteUI.AthenaCosmeticUnlockingInfo.RequestIntroAnim // (Event|Protected|BlueprintCallable|BlueprintEvent) // @ game+0xdef49c
	void OutroAnimFinished(); // Function FortniteUI.AthenaCosmeticUnlockingInfo.OutroAnimFinished // (Final|Native|Protected|BlueprintCallable) // @ game+0x9cba5f4
	void OnUnlockingInfoSet(bool bShowProgression); // Function FortniteUI.AthenaCosmeticUnlockingInfo.OnUnlockingInfoSet // (Event|Public|BlueprintEvent) // @ game+0xdef49c
	void HideUnlockingInfo(); // Function FortniteUI.AthenaCosmeticUnlockingInfo.HideUnlockingInfo // (Final|Native|Public|BlueprintCallable) // @ game+0x9cba524
};

// Class FortniteUI.AthenaCountdownWidgetBase
// Size: 0x318 (Inherited: 0x2d0)
struct UAthenaCountdownWidgetBase : UFortHUDElementWidget {
	char pad_2D0[0x40]; // 0x2d0(0x40)
	struct FFortPrioritizedWidgetData PrioritizationData; // 0x310(0x02)
	char pad_312[0x6]; // 0x312(0x06)

	void OnDisplayWarningMessage(struct FText& FirstLineText, struct FText& SecondLineText); // Function FortniteUI.AthenaCountdownWidgetBase.OnDisplayWarningMessage // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xdef49c
	void OnCountdownUpdate(int32_t TimeRemaining, struct FText& CountdownUpdateText); // Function FortniteUI.AthenaCountdownWidgetBase.OnCountdownUpdate // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xdef49c
	void OnCountdownStopped(); // Function FortniteUI.AthenaCountdownWidgetBase.OnCountdownStopped // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnCountdownStarted(int32_t TimeRemaining, struct FText& CountdownIntroText); // Function FortniteUI.AthenaCountdownWidgetBase.OnCountdownStarted // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xdef49c
	void OnCountdownFinished(); // Function FortniteUI.AthenaCountdownWidgetBase.OnCountdownFinished // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void HandleGamePhaseStepChanged(struct TScriptInterface<IFortSafeZoneInterface>& SafeZoneInterface, enum class EAthenaGamePhaseStep GamePhaseStep); // Function FortniteUI.AthenaCountdownWidgetBase.HandleGamePhaseStepChanged // (Final|Native|Protected|HasOutParms) // @ game+0xd8c8c4
	void HandleCountdownUpdate(int32_t TimeRemaining); // Function FortniteUI.AthenaCountdownWidgetBase.HandleCountdownUpdate // (Final|Native|Protected) // @ game+0x9cb9c78
	void HandleCountdownStopped(); // Function FortniteUI.AthenaCountdownWidgetBase.HandleCountdownStopped // (Final|Native|Protected) // @ game+0x9cb9c64
	void HandleCountdownStarted(int32_t TimeRemaining); // Function FortniteUI.AthenaCountdownWidgetBase.HandleCountdownStarted // (Final|Native|Protected) // @ game+0x9cb9be4
	void HandleCountdownFinished(); // Function FortniteUI.AthenaCountdownWidgetBase.HandleCountdownFinished // (Final|Native|Protected) // @ game+0x9cb9bd0
};

// Class FortniteUI.AthenaCurieStatusWidget
// Size: 0x318 (Inherited: 0x2d0)
struct UAthenaCurieStatusWidget : UFortHUDElementWidget {
	char pad_2D0[0x48]; // 0x2d0(0x48)

	void SetPlayerState(struct AFortPlayerStateAthena* PlayerState); // Function FortniteUI.AthenaCurieStatusWidget.SetPlayerState // (Final|Native|Public|BlueprintCallable) // @ game+0x9cdde68
	void OnPlayerStatePawnChanged(); // Function FortniteUI.AthenaCurieStatusWidget.OnPlayerStatePawnChanged // (Final|Native|Protected) // @ game+0x9cdd8ec
	void OnHandleSpectatingChanged(struct AFortPlayerStateZone* NewSpectatingTarget); // Function FortniteUI.AthenaCurieStatusWidget.OnHandleSpectatingChanged // (Final|Native|Protected) // @ game+0x9cdd76c
	void OnCurieStateRemoved(struct FGameplayTag& RemovedState); // Function FortniteUI.AthenaCurieStatusWidget.OnCurieStateRemoved // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xdef49c
	void OnCurieStateDetachedFromSpectator(struct UObject* InOwner, struct FCurieContainerHandle ContainerHandle, struct FGameplayTag& ElementIdentifier); // Function FortniteUI.AthenaCurieStatusWidget.OnCurieStateDetachedFromSpectator // (Final|Native|Protected|HasOutParms) // @ game+0x9cdd664
	void OnCurieStateAttachedToSpectator(struct UObject* InOwner, struct FCurieContainerHandle ContainerHandle, struct FGameplayTag& ElementIdentifier); // Function FortniteUI.AthenaCurieStatusWidget.OnCurieStateAttachedToSpectator // (Final|Native|Protected|HasOutParms) // @ game+0x9cdd55c
	void OnCurieStateAdded(struct FGameplayTag& AddedState); // Function FortniteUI.AthenaCurieStatusWidget.OnCurieStateAdded // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xdef49c
	bool HasState(struct FGameplayTag CurieState); // Function FortniteUI.AthenaCurieStatusWidget.HasState // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x9cdd328
};

// Class FortniteUI.AthenaCustomizationPicker
// Size: 0x538 (Inherited: 0x3d0)
struct UAthenaCustomizationPicker : UFortItemPickerBase {
	struct FMulticastInlineDelegate OnCosmeticSelectionSaving; // 0x3d0(0x10)
	struct FMulticastInlineDelegate OnCosmeticSelectionSaved; // 0x3e0(0x10)
	struct TMap<enum class EInventoryContentSortType, struct FText> SortLabels; // 0x3f0(0x50)
	struct TArray<struct FFortAthenaItemManagementInventoryFilterTabLabelInfo> FilterTabLabelInfoArray; // 0x440(0x10)
	struct UCommonButtonBase* Button_JumpToTop; // 0x450(0x08)
	struct UCommonButtonBase* Button_TextSearch; // 0x458(0x08)
	struct UCommonButtonBase* Button_SortAndFilter; // 0x460(0x08)
	struct FName CurrentFilterName; // 0x468(0x04)
	char pad_46C[0x26]; // 0x46c(0x26)
	bool bArchiveFiltering; // 0x492(0x01)
	char pad_493[0x5]; // 0x493(0x05)
	struct UCommonTextBlock* Text_SortTag; // 0x498(0x08)
	struct UCommonTextBlock* Text_FilterTag; // 0x4a0(0x08)
	struct UCommonTextBlock* Text_NumArchived; // 0x4a8(0x08)
	struct UWidget* Widget_ArchivedTag; // 0x4b0(0x08)
	enum class EAthenaCustomizationCategory CustomizeCategory; // 0x4b8(0x01)
	char pad_4B9[0x3]; // 0x4b9(0x03)
	int32_t SubslotIndex; // 0x4bc(0x04)
	float ItemOffsetForJumpToTopButton; // 0x4c0(0x04)
	char pad_4C4[0x4]; // 0x4c4(0x04)
	struct UAthenaCustomizationPickerSortAndFilterBlade* Blade_SortAndFilter; // 0x4c8(0x08)
	struct UUserWidget* Tooltip_ArchiveFilter; // 0x4d0(0x08)
	bool bAllowUnownedItems; // 0x4d8(0x01)
	bool bAllowCommits; // 0x4d9(0x01)
	bool bOneItemPerSlot; // 0x4da(0x01)
	char pad_4DB[0x15]; // 0x4db(0x15)
	struct TArray<struct UObject*> InitialPickerItems; // 0x4f0(0x10)
	struct UFortItem* ItemListeningTo; // 0x500(0x08)
	struct UAthenaCosmeticAccountItem* LocalCampaignHeroItem; // 0x508(0x08)
	char pad_510[0x28]; // 0x510(0x28)

	void SetFilter(struct FName FilterName); // Function FortniteUI.AthenaCustomizationPicker.SetFilter // (Final|Native|Public|BlueprintCallable) // @ game+0x9cddde8
	void SearchText(struct FText& Text); // Function FortniteUI.AthenaCustomizationPicker.SearchText // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x9cddaa4
	void OnUpdateArchiveFilterTooltipText(struct FText& Text); // Function FortniteUI.AthenaCustomizationPicker.OnUpdateArchiveFilterTooltipText // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0xdef49c
	void OnShowArchiveFilterTooltip(bool bShowTooltip); // Function FortniteUI.AthenaCustomizationPicker.OnShowArchiveFilterTooltip // (Event|Public|BlueprintEvent) // @ game+0xdef49c
	void OnSearchEnabled(bool bEnabled); // Function FortniteUI.AthenaCustomizationPicker.OnSearchEnabled // (Event|Public|BlueprintEvent) // @ game+0xdef49c
	void OnNoItemsAvailableInFilter(struct FText& EmptyDisplayText); // Function FortniteUI.AthenaCustomizationPicker.OnNoItemsAvailableInFilter // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0xdef49c
	void OnItemsAvailableInFilter(); // Function FortniteUI.AthenaCustomizationPicker.OnItemsAvailableInFilter // (Event|Public|BlueprintEvent) // @ game+0xdef49c
	void OnCosmeticChangeSaveEvent__DelegateSignature(); // DelegateFunction FortniteUI.AthenaCustomizationPicker.OnCosmeticChangeSaveEvent__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0xdef49c
	bool HasSelectableTile(); // Function FortniteUI.AthenaCustomizationPicker.HasSelectableTile // (Event|Protected|BlueprintEvent|Const) // @ game+0xdef49c
	void HandleSelectedItemHasChanged(bool ItemChanged, bool AmmoChanged, bool IngredientsChanged); // Function FortniteUI.AthenaCustomizationPicker.HandleSelectedItemHasChanged // (Final|Native|Protected) // @ game+0x9cdcdd8
	void HandleButtonTextSearchClicked(); // Function FortniteUI.AthenaCustomizationPicker.HandleButtonTextSearchClicked // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void HandleArchiveFilterTooltipDismissed(); // Function FortniteUI.AthenaCustomizationPicker.HandleArchiveFilterTooltipDismissed // (Final|Native|Private|BlueprintCallable|Const) // @ game+0x9cdbf7c
	struct FText GetQualifiedFilterDisplayName(enum class EAthenaFilterDisplayType InTopFilterDisplaySetting); // Function FortniteUI.AthenaCustomizationPicker.GetQualifiedFilterDisplayName // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9cdbdf4
	void EndCustomizationCategory(); // Function FortniteUI.AthenaCustomizationPicker.EndCustomizationCategory // (Final|Native|Public|BlueprintCallable) // @ game+0x9cdb694
	void BP_OnUpdateNumArchivedItems(int32_t InNumArchivedItems); // Function FortniteUI.AthenaCustomizationPicker.BP_OnUpdateNumArchivedItems // (Event|Public|BlueprintEvent) // @ game+0xdef49c
	void BeginCustomizationCategory(enum class EAthenaCustomizationCategory category, int32_t SubslotToEdit, bool bInAllowUnownedItems, bool bInOneItemPerSlot); // Function FortniteUI.AthenaCustomizationPicker.BeginCustomizationCategory // (Final|Native|Public|BlueprintCallable) // @ game+0x9cdb460
};

// Class FortniteUI.AthenaCustomizationPickerSortAndFilterBlade
// Size: 0x360 (Inherited: 0x290)
struct UAthenaCustomizationPickerSortAndFilterBlade : UCommonUserWidget {
	struct UWidget* Widget_Sorts; // 0x290(0x08)
	struct UWidget* Widget_Filters; // 0x298(0x08)
	struct UFortDynamicEntryBox* DynamicEntryBox_SortButtons; // 0x2a0(0x08)
	struct UFortDynamicEntryBox* DynamicEntryBox_FilterButtons; // 0x2a8(0x08)
	struct UCommonButtonGroupBase* ButtonGroup_Sorts; // 0x2b0(0x08)
	struct UCommonButtonGroupBase* ButtonGroup_Filters; // 0x2b8(0x08)
	char pad_2C0[0xa0]; // 0x2c0(0xa0)

	bool IsBladeOpen(); // Function FortniteUI.AthenaCustomizationPickerSortAndFilterBlade.IsBladeOpen // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9cdd49c
	void HandleCloseAnimationFinished(); // Function FortniteUI.AthenaCustomizationPickerSortAndFilterBlade.HandleCloseAnimationFinished // (Final|Native|Protected|BlueprintCallable) // @ game+0x9cdc054
	struct UCommonButtonBase* GetSortButtonAtIndex(int32_t DesiredIndex); // Function FortniteUI.AthenaCustomizationPickerSortAndFilterBlade.GetSortButtonAtIndex // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9cdbeb0
	int32_t GetNumSorts(); // Function FortniteUI.AthenaCustomizationPickerSortAndFilterBlade.GetNumSorts // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9cdbdd4
	int32_t GetNumFilters(); // Function FortniteUI.AthenaCustomizationPickerSortAndFilterBlade.GetNumFilters // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9cdbdb4
	struct UCommonButtonBase* GetFilterButtonAtIndex(int32_t DesiredIndex); // Function FortniteUI.AthenaCustomizationPickerSortAndFilterBlade.GetFilterButtonAtIndex // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9cdbaf8
	struct TArray<struct UUserWidget*> GetAllSortAndFilterButtons(); // Function FortniteUI.AthenaCustomizationPickerSortAndFilterBlade.GetAllSortAndFilterButtons // (Final|Native|Protected|BlueprintCallable) // @ game+0x9cdb6d0
	void CloseBlade(); // Function FortniteUI.AthenaCustomizationPickerSortAndFilterBlade.CloseBlade // (Final|Native|Public|BlueprintCallable) // @ game+0x9cdb5ac
	void BP_SetSortOrFilterButtonDisplayName(struct UCommonButtonBase* SortOrFilterButton, struct FText& DisplayName); // Function FortniteUI.AthenaCustomizationPickerSortAndFilterBlade.BP_SetSortOrFilterButtonDisplayName // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xdef49c
	void BP_OnSortOrFilterButtonCreated(struct UCommonButtonBase* NewButton); // Function FortniteUI.AthenaCustomizationPickerSortAndFilterBlade.BP_OnSortOrFilterButtonCreated // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void BP_OnBladeOpen(); // Function FortniteUI.AthenaCustomizationPickerSortAndFilterBlade.BP_OnBladeOpen // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void BP_OnBladeClose(); // Function FortniteUI.AthenaCustomizationPickerSortAndFilterBlade.BP_OnBladeClose // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void BP_OnArchiveFilteringSet(bool bEnabled); // Function FortniteUI.AthenaCustomizationPickerSortAndFilterBlade.BP_OnArchiveFilteringSet // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void BP_HighlightSortOrFilterButton(struct UCommonButtonBase* SortOrFilterButton, bool bHighlight); // Function FortniteUI.AthenaCustomizationPickerSortAndFilterBlade.BP_HighlightSortOrFilterButton // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
};

// Class FortniteUI.FortCosmeticItemTileButton
// Size: 0x1450 (Inherited: 0x1430)
struct UFortCosmeticItemTileButton : UCommonButtonLegacy {
	char pad_1430[0x8]; // 0x1430(0x08)
	struct UFortCosmeticItemCard* ItemWidget; // 0x1438(0x08)
	struct TWeakObjectPtr<struct UFortItem> Item; // 0x1440(0x08)
	float ItemCardWidth; // 0x1448(0x04)
	float MobileScalingFactor; // 0x144c(0x04)
};

// Class FortniteUI.AthenaCustomizationPickerTileButton
// Size: 0x1470 (Inherited: 0x1450)
struct UAthenaCustomizationPickerTileButton : UFortCosmeticItemTileButton {
	char pad_1450[0x8]; // 0x1450(0x08)
	struct UFortBangWrapper_NUI* Bang; // 0x1458(0x08)
	struct UImage* Image_Favorite; // 0x1460(0x08)
	struct UImage* Image_ClassIcon; // 0x1468(0x08)

	void OnUpdateExclusiveWarning(bool bShouldWarn); // Function FortniteUI.AthenaCustomizationPickerTileButton.OnUpdateExclusiveWarning // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnEquippedStateChanged(bool bEquipped, bool bOnDifferentSlot); // Function FortniteUI.AthenaCustomizationPickerTileButton.OnEquippedStateChanged // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnChangeOwnedState(bool bOwned); // Function FortniteUI.AthenaCustomizationPickerTileButton.OnChangeOwnedState // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnArchivedStatusUpdated(bool bShowAsArchived, bool bUseAnimations); // Function FortniteUI.AthenaCustomizationPickerTileButton.OnArchivedStatusUpdated // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
};

// Class FortniteUI.AthenaCustomizationScreen
// Size: 0xb68 (Inherited: 0x668)
struct UAthenaCustomizationScreen : UFortItemPreviewScreen {
	bool bCustomizationSelectionBeingProcessed; // 0x668(0x01)
	char pad_669[0x7]; // 0x669(0x07)
	struct FAthenaCustomizationParams CustomizationParams; // 0x670(0x48)
	enum class EAthenaCustomizationCategory InitialCustomizationCategory; // 0x6b8(0x01)
	char pad_6B9[0x7]; // 0x6b9(0x07)
	struct FText CategoryDisplayNames[0x17]; // 0x6c0(0x228)
	struct FText ItemTypeDisplayNames[0x17]; // 0x8e8(0x228)
	char pad_B10[0x18]; // 0xb10(0x18)
	struct UAthenaItemSelectorScreenBase* ItemSelectorScreenClass; // 0xb28(0x08)
	struct UAthenaItemSelectorScreenBase* ItemSelectorScreen; // 0xb30(0x08)
	char pad_B38[0x8]; // 0xb38(0x08)
	struct FDataTableRowHandle OpenNameLoadoutInputAction; // 0xb40(0x10)
	struct UWidgetAnimation* BoundAnim_Intro; // 0xb50(0x08)
	struct UWidgetAnimation* BoundAnim_Outro; // 0xb58(0x08)
	struct UFortCosmeticLoadoutSelector* LoadoutSelector; // 0xb60(0x08)

	void ShowLockerSlot(enum class EAthenaCustomizationCategory CustomizationCategory, int32_t SlotIndex, bool bCanShowEmpty); // Function FortniteUI.AthenaCustomizationScreen.ShowLockerSlot // (Final|Native|Protected|BlueprintCallable) // @ game+0x9cddf84
	void ShiftItemsVariantOption(struct UAthenaCosmeticAccountItem* Item, int32_t VariantChannelIndex); // Function FortniteUI.AthenaCustomizationScreen.ShiftItemsVariantOption // (Final|Native|Protected|BlueprintCallable) // @ game+0x74387fc
	void SetCustomizationSelectionBeingProcessed(bool bIsBeingProcessed); // Function FortniteUI.AthenaCustomizationScreen.SetCustomizationSelectionBeingProcessed // (Final|Native|Protected|BlueprintCallable) // @ game+0x9cddc64
	void OnLoadoutChanged(); // Function FortniteUI.AthenaCustomizationScreen.OnLoadoutChanged // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	struct FText GetItemTypeDisplayNames(enum class EAthenaCustomizationCategory InCategory); // Function FortniteUI.AthenaCustomizationScreen.GetItemTypeDisplayNames // (Final|Native|Protected|BlueprintCallable) // @ game+0x9cdbbf4
	struct UFortItem* GetFavoriteItemForCategory(enum class EAthenaCustomizationCategory CustomizationType, int32_t SubslotIndex); // Function FortniteUI.AthenaCustomizationScreen.GetFavoriteItemForCategory // (Final|Native|Protected|BlueprintCallable) // @ game+0x9cdb970
	struct FText GetCategoryDisplayName(enum class EAthenaCustomizationCategory InCategory); // Function FortniteUI.AthenaCustomizationScreen.GetCategoryDisplayName // (Final|Native|Protected|BlueprintCallable) // @ game+0x9cdb790
};

// Class FortniteUI.AthenaCustomizationScreenBase
// Size: 0xde8 (Inherited: 0x668)
struct UAthenaCustomizationScreenBase : UFortItemPreviewScreen {
	bool bCustomizationSelectionBeingProcessed; // 0x668(0x01)
	char pad_669[0x7]; // 0x669(0x07)
	struct FAthenaCustomizationParams CustomizationParams; // 0x670(0x48)
	enum class EAthenaCustomizationCategory FirstCustomizationCategory; // 0x6b8(0x01)
	char pad_6B9[0x197]; // 0x6b9(0x197)
	struct FText CategoryDisplayNames[0x17]; // 0x850(0x228)
	struct FText ItemTypeDisplayNames[0x17]; // 0xa78(0x228)
	char pad_CA0[0x30]; // 0xca0(0x30)
	struct UAthenaItemSelectorScreenBase* ItemSelectorScreenClass; // 0xcd0(0x08)
	struct UFortActivatablePanel* LoadoutSelectorScreenClass; // 0xcd8(0x08)
	struct UFortBannerSelectModal* BannerSelectModalClass; // 0xce0(0x08)
	struct UFortNameLoadoutPopup* NameLoadoutPopupClass; // 0xce8(0x08)
	char pad_CF0[0x8]; // 0xcf0(0x08)
	struct UAthenaCustomizationSlotSelectorButton* LastHoveredSlot; // 0xcf8(0x08)
	char pad_D00[0x8]; // 0xd00(0x08)
	struct FDataTableRowHandle OpenNameLoadoutInputAction; // 0xd08(0x10)
	struct TArray<enum class EAthenaCustomizationCategory> BuiltInEmoteCategoryPriorities; // 0xd18(0x10)
	bool bDisplayBuiltInEmotesInEmoteRow; // 0xd28(0x01)
	char pad_D29[0x7]; // 0xd29(0x07)
	struct UWidgetAnimation* BoundAnim_Intro; // 0xd30(0x08)
	struct UWidgetAnimation* BoundAnim_Outro; // 0xd38(0x08)
	struct UWidget* Container_Loadouts_GodTileArea; // 0xd40(0x08)
	struct UCommonButtonLegacy* Button_Loadouts; // 0xd48(0x08)
	struct UCommonButtonLegacy* Button_SavePreset; // 0xd50(0x08)
	struct UCommonButtonLegacy* Button_RandomPresets; // 0xd58(0x08)
	struct UFortCosmeticLoadoutSelector* Loadout_Selector; // 0xd60(0x08)
	struct UFortCosmeticLoadoutCard* LoadoutCard_AppliedAnimation; // 0xd68(0x08)
	struct UPanelWidget* Panel_GearSlotRow; // 0xd70(0x08)
	struct UAthenaCustomizationSlotSelectorButton* Slot_Pickaxe; // 0xd78(0x08)
	struct UAthenaCustomizationSlotSelectorButton* Slot_Glider; // 0xd80(0x08)
	struct UAthenaCustomizationSlotSelectorButton* Slot_Contrail; // 0xd88(0x08)
	struct UAthenaCustomizationSlotSelectorButton* Slot_LoadingScreen; // 0xd90(0x08)
	struct UPanelWidget* Panel_EmoteSlotRow; // 0xd98(0x08)
	struct UPanelWidget* Panel_WrapSlotRow; // 0xda0(0x08)
	struct UPanelWidget* Panel_AccountSlotRow; // 0xda8(0x08)
	struct UFortBannerSlotButton* Banner_Button; // 0xdb0(0x08)
	struct UAthenaLockerItemInfo* ItemInfo_Display; // 0xdb8(0x08)
	struct UCommonButtonBase* Button_ClearAllBangs; // 0xdc0(0x08)
	struct UCommonButtonBase* Button_BackToGame; // 0xdc8(0x08)
	char pad_DD0[0x18]; // 0xdd0(0x18)

	void ShowLockerSlot(enum class EAthenaCustomizationCategory CustomizationCategory, int32_t SlotIndex, bool bCanShowEmpty); // Function FortniteUI.AthenaCustomizationScreenBase.ShowLockerSlot // (Final|Native|Protected|BlueprintCallable) // @ game+0x9cde07c
	bool ShouldDisplayNextRandomPresetName(); // Function FortniteUI.AthenaCustomizationScreenBase.ShouldDisplayNextRandomPresetName // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x9cddf68
	void ShiftItemsVariantOption(struct UAthenaCosmeticAccountItem* Item, int32_t VariantChannelIndex); // Function FortniteUI.AthenaCustomizationScreenBase.ShiftItemsVariantOption // (Final|Native|Public|BlueprintCallable) // @ game+0x74387fc
	void SetCustomizationSelectionBeingProcessed(bool bIsBeingProcessed); // Function FortniteUI.AthenaCustomizationScreenBase.SetCustomizationSelectionBeingProcessed // (Final|Native|Protected|BlueprintCallable) // @ game+0x9cddc64
	void OnRefreshForNewLoadout(struct FString LoadoutName, bool bIsShuffleTile); // Function FortniteUI.AthenaCustomizationScreenBase.OnRefreshForNewLoadout // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnPlayerToggledRandomPresets(bool bNowEnabled); // Function FortniteUI.AthenaCustomizationScreenBase.OnPlayerToggledRandomPresets // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnIntroAppliedPreset(); // Function FortniteUI.AthenaCustomizationScreenBase.OnIntroAppliedPreset // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnBeginSavingLoadouts(); // Function FortniteUI.AthenaCustomizationScreenBase.OnBeginSavingLoadouts // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnBeginPickingLoadouts(); // Function FortniteUI.AthenaCustomizationScreenBase.OnBeginPickingLoadouts // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnBeginPickingCustomizationSlot(struct UAthenaCustomizationSlotSelectorButton* SlotButton); // Function FortniteUI.AthenaCustomizationScreenBase.OnBeginPickingCustomizationSlot // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void HandleInventoryUpdated(struct TSet<struct FString>& ItemChangeFlags, int64_t ProfileRevision); // Function FortniteUI.AthenaCustomizationScreenBase.HandleInventoryUpdated // (Final|Native|Private|HasOutParms) // @ game+0x9cdc25c
	struct FText GetItemTypeDisplayNames(enum class EAthenaCustomizationCategory InCategory); // Function FortniteUI.AthenaCustomizationScreenBase.GetItemTypeDisplayNames // (Final|Native|Public|BlueprintCallable) // @ game+0x9cdbcd0
	struct UFortItem* GetFavoriteItemForCategory(enum class EAthenaCustomizationCategory CustomizationType, int32_t SubslotIndex); // Function FortniteUI.AthenaCustomizationScreenBase.GetFavoriteItemForCategory // (Final|Native|Public|BlueprintCallable) // @ game+0x9cdba34
	struct FText GetCategoryDisplayName(enum class EAthenaCustomizationCategory InCategory); // Function FortniteUI.AthenaCustomizationScreenBase.GetCategoryDisplayName // (Final|Native|Public|BlueprintCallable) // @ game+0x9cdb874
};

// Class FortniteUI.AthenaCustomizationSlotSelectorButton
// Size: 0x1500 (Inherited: 0x1430)
struct UAthenaCustomizationSlotSelectorButton : UCommonButtonLegacy {
	struct FText CategoryDisplayName; // 0x1430(0x18)
	struct FText CategoryDescription; // 0x1448(0x18)
	enum class EAthenaCustomizationCategory CustomizationType; // 0x1460(0x01)
	char pad_1461[0x3]; // 0x1461(0x03)
	int32_t SubslotIndex; // 0x1464(0x04)
	enum class EFortBangType BangType; // 0x1468(0x01)
	bool bAllowUnownedItems; // 0x1469(0x01)
	bool bOneItemPerSlot; // 0x146a(0x01)
	char pad_146B[0x5]; // 0x146b(0x05)
	struct UMaterialInstance* OverrideSlotImage; // 0x1470(0x08)
	struct UFortCosmeticItemCard* ItemWidget; // 0x1478(0x08)
	struct FGameplayTag RequiredSlotGameplayTag; // 0x1480(0x04)
	char pad_1484[0x4]; // 0x1484(0x04)
	struct TSoftObjectPtr<UTexture2D> DefaultEmptyTexture; // 0x1488(0x28)
	float CardWidth; // 0x14b0(0x04)
	char pad_14B4[0x2c]; // 0x14b4(0x2c)
	struct UFortItem* LocalCampaignHeroPartItem; // 0x14e0(0x08)
	struct UImage* Image_Favorite; // 0x14e8(0x08)
	struct UImage* Image_ClassIcon; // 0x14f0(0x08)
	struct UFortBangWrapper_NUI* Bang_Wrapper; // 0x14f8(0x08)

	void SetCustomizationType(enum class EAthenaCustomizationCategory NewType, int32_t InSubslotIndex, struct FGameplayTag& RequiredSlotTag); // Function FortniteUI.AthenaCustomizationSlotSelectorButton.SetCustomizationType // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x9cddce4
	void SetCardDefaultImageAndWidth(struct TSoftObjectPtr<UTexture2D>& InDefaultImage, float InWidth); // Function FortniteUI.AthenaCustomizationSlotSelectorButton.SetCardDefaultImageAndWidth // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x9cddb68
	void OnUpdateExclusiveWarning(bool bShouldWarn); // Function FortniteUI.AthenaCustomizationSlotSelectorButton.OnUpdateExclusiveWarning // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnCustomizationSlotActiveStateChanged(bool bInAttachableCosmeticAvailable, bool bInActive); // Function FortniteUI.AthenaCustomizationSlotSelectorButton.OnCustomizationSlotActiveStateChanged // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnCardImageAndWidthChanged(struct TSoftObjectPtr<UTexture2D>& Image, float Width); // Function FortniteUI.AthenaCustomizationSlotSelectorButton.OnCardImageAndWidthChanged // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xdef49c
	void OnArchivedStatusUpdated(bool bArchived); // Function FortniteUI.AthenaCustomizationSlotSelectorButton.OnArchivedStatusUpdated // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	bool IsSlotFilled(); // Function FortniteUI.AthenaCustomizationSlotSelectorButton.IsSlotFilled // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x1a49838
	void HandleDifferentHeroLoadoutActivated(struct UFortMcpProfileCampaign* Profile); // Function FortniteUI.AthenaCustomizationSlotSelectorButton.HandleDifferentHeroLoadoutActivated // (Final|Native|Private) // @ game+0x9cdc128
	void GetCustomizationSlotActiveState(bool& bOutAttachableCosmeticAvailable, bool& bOutActive); // Function FortniteUI.AthenaCustomizationSlotSelectorButton.GetCustomizationSlotActiveState // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x2401a7c
	struct UFortItem* GetCampaignHeroPartItem(); // Function FortniteUI.AthenaCustomizationSlotSelectorButton.GetCampaignHeroPartItem // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9cdb778
};

// Class FortniteUI.AthenaDiscoverabilityBase
// Size: 0x328 (Inherited: 0x2d0)
struct UAthenaDiscoverabilityBase : UFortHUDElementWidget {
	char pad_2D0[0x48]; // 0x2d0(0x48)
	struct FFortPrioritizedWidgetData PrioritizationData; // 0x318(0x02)
	char pad_31A[0x6]; // 0x31a(0x06)
	struct UFortControllerComponent_MapDiscoverability* AssociatedComponent; // 0x320(0x08)

	void OnStompFailed(); // Function FortniteUI.AthenaDiscoverabilityBase.OnStompFailed // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnStompedByOtherWidget(); // Function FortniteUI.AthenaDiscoverabilityBase.OnStompedByOtherWidget // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void K2_OnBecomeInactive(); // Function FortniteUI.AthenaDiscoverabilityBase.K2_OnBecomeInactive // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void K2_OnBecomeActive(); // Function FortniteUI.AthenaDiscoverabilityBase.K2_OnBecomeActive // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void CommonArrivalEvent(struct FGameplayTag& NewTag); // Function FortniteUI.AthenaDiscoverabilityBase.CommonArrivalEvent // (Native|Protected|HasOutParms) // @ game+0x9cdb604
};

// Class FortniteUI.AthenaDiscoveredAreaOverlay
// Size: 0x328 (Inherited: 0x328)
struct UAthenaDiscoveredAreaOverlay : UAthenaDiscoverabilityBase {

	void OnNewDiscovery(struct FText& LocalizedLocationName, struct TSoftObjectPtr<USoundCue>& DiscoveredSoundCue, bool bIsNamedLocation); // Function FortniteUI.AthenaDiscoveredAreaOverlay.OnNewDiscovery // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xdef49c
};

// Class FortniteUI.AthenaEliminationIndicator
// Size: 0x5c8 (Inherited: 0x5c0)
struct UAthenaEliminationIndicator : UAthenaMarkedActorIndicator {
	char pad_5C0[0x8]; // 0x5c0(0x08)
};

// Class FortniteUI.AthenaEliminationOverlayBase
// Size: 0x268 (Inherited: 0x268)
struct UAthenaEliminationOverlayBase : UUserWidget {
};

// Class FortniteUI.AthenaEquippedItemBase
// Size: 0x398 (Inherited: 0x318)
struct UAthenaEquippedItemBase : UBacchusHUDElement {
	enum class EEquippedWeaponDisplay CurrentMode; // 0x318(0x01)
	char pad_319[0xb]; // 0x319(0x0b)
	int32_t AmountConsideredInfinite; // 0x324(0x04)
	struct UCommonVisibilitySwitcher* Switcher_Content; // 0x328(0x08)
	struct UPanelWidget* Panel_ResourceContent; // 0x330(0x08)
	struct UPanelWidget* Panel_AmmoContent; // 0x338(0x08)
	struct UPanelWidget* Panel_UtilityContent; // 0x340(0x08)
	struct UImage* Image_AmmoIcon; // 0x348(0x08)
	struct UImage* Image_ResourceIcon; // 0x350(0x08)
	struct UImage* Image_UtilityIcon; // 0x358(0x08)
	struct UCommonTextBlock* Text_MagazineAmmoCount; // 0x360(0x08)
	struct UCommonTextBlock* Text_SurplusAmmoCount; // 0x368(0x08)
	struct UCommonTextBlock* Text_ResourceCount; // 0x370(0x08)
	struct UCommonTextBlock* Text_UtilityAmmoCount; // 0x378(0x08)
	struct UCommonTextBlock* Text_OutOfAmmo; // 0x380(0x08)
	struct UScaleBox* RootScaleBox; // 0x388(0x08)
	enum class ESlateVisibility WeaponEquipVisibility; // 0x390(0x01)
	char pad_391[0x7]; // 0x391(0x07)

	void HandleWorldItemsChanged(); // Function FortniteUI.AthenaEquippedItemBase.HandleWorldItemsChanged // (Final|Native|Protected) // @ game+0x9cdd314
	void HandleWeaponTargetingChanged(bool bIsTargeting); // Function FortniteUI.AthenaEquippedItemBase.HandleWeaponTargetingChanged // (Final|Native|Protected) // @ game+0x9cdd294
	void HandleWeaponReloadStarted(float ReloadTime, enum class EFortWeaponReloadType ReloadType); // Function FortniteUI.AthenaEquippedItemBase.HandleWeaponReloadStarted // (Final|Native|Protected) // @ game+0x9cdd1cc
	void HandleWeaponReloadCancelled(); // Function FortniteUI.AthenaEquippedItemBase.HandleWeaponReloadCancelled // (Final|Native|Protected) // @ game+0x9cdd1b8
	void HandleWeaponOverheatValueChanged(float CurrentValue, float MaxValue, enum class EFortWeaponOverheatState State, bool bIsInCooldown); // Function FortniteUI.AthenaEquippedItemBase.HandleWeaponOverheatValueChanged // (Final|Native|Protected) // @ game+0x9cdd078
	void HandleWeaponEquipped(struct AFortWeapon* NewWeapon, struct AFortWeapon* PrevWeapon); // Function FortniteUI.AthenaEquippedItemBase.HandleWeaponEquipped // (Final|Native|Protected) // @ game+0x9cdcfb4
	void HandleViewTargetChanged(); // Function FortniteUI.AthenaEquippedItemBase.HandleViewTargetChanged // (Final|Native|Protected) // @ game+0x9cdcfa0
	void HandleSecondaryFireReleased(struct AFortWeapon* Weapon); // Function FortniteUI.AthenaEquippedItemBase.HandleSecondaryFireReleased // (Final|Native|Protected) // @ game+0x9cdcd58
	void HandleSecondaryFirePressed(struct AFortWeapon* Weapon); // Function FortniteUI.AthenaEquippedItemBase.HandleSecondaryFirePressed // (Final|Native|Protected) // @ game+0x9cdccd8
	void HandleLocalAmmoChanged(int32_t LocalCount, int32_t LocalRemaining); // Function FortniteUI.AthenaEquippedItemBase.HandleLocalAmmoChanged // (Final|Native|Protected) // @ game+0x9cdc394
	void HandleBuildingMaterialChanged(); // Function FortniteUI.AthenaEquippedItemBase.HandleBuildingMaterialChanged // (Final|Native|Protected) // @ game+0x9cdc02c
	void BP_HandleWeaponTargetingChanged(bool bIsTargeting); // Function FortniteUI.AthenaEquippedItemBase.BP_HandleWeaponTargetingChanged // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void BP_HandleWeaponReloadStarted(float ReloadTime, enum class EFortWeaponReloadType ReloadType); // Function FortniteUI.AthenaEquippedItemBase.BP_HandleWeaponReloadStarted // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void BP_HandleWeaponReloadCancelled(struct AFortWeapon* Weapon); // Function FortniteUI.AthenaEquippedItemBase.BP_HandleWeaponReloadCancelled // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void BP_HandleWeaponOverheatValueChanged(float CurrentValue, float MaxValue, enum class EFortWeaponOverheatState State, bool bIsInCooldown); // Function FortniteUI.AthenaEquippedItemBase.BP_HandleWeaponOverheatValueChanged // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void BP_HandleWeaponModeChanged(enum class EEquippedWeaponDisplay Mode); // Function FortniteUI.AthenaEquippedItemBase.BP_HandleWeaponModeChanged // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void BP_HandleWeaponEquipped(struct AFortWeapon* NewWeapon, struct AFortWeapon* PrevWeapon); // Function FortniteUI.AthenaEquippedItemBase.BP_HandleWeaponEquipped // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void BP_HandleSecondaryFireReleased(); // Function FortniteUI.AthenaEquippedItemBase.BP_HandleSecondaryFireReleased // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void BP_HandleSecondaryFirePressed(); // Function FortniteUI.AthenaEquippedItemBase.BP_HandleSecondaryFirePressed // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void BP_HandleResourceTypeChanged(struct UFortResourceItemDefinition* Item, int32_t ResourceCount); // Function FortniteUI.AthenaEquippedItemBase.BP_HandleResourceTypeChanged // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void BP_HandleResourceCountChanged(int32_t ResourceCount); // Function FortniteUI.AthenaEquippedItemBase.BP_HandleResourceCountChanged // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void BP_HandleHideReserveAmmoChanged(bool bHideReserveAmmo); // Function FortniteUI.AthenaEquippedItemBase.BP_HandleHideReserveAmmoChanged // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void BP_HandleHasBulletsPerClipChanged(bool bHasBulletsPerClip); // Function FortniteUI.AthenaEquippedItemBase.BP_HandleHasBulletsPerClipChanged // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void BP_HandleHasAmmoChanged(bool bHasAmmo); // Function FortniteUI.AthenaEquippedItemBase.BP_HandleHasAmmoChanged // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void BP_HandleAmmoCountChanged(int32_t MagazineAmmoCount, int32_t SurplusAmmoCount, int32_t TotalRemaining); // Function FortniteUI.AthenaEquippedItemBase.BP_HandleAmmoCountChanged // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
};

// Class FortniteUI.AthenaEventGamesBase
// Size: 0x518 (Inherited: 0x518)
struct UAthenaEventGamesBase : UFortActivatablePanel {
};

// Class FortniteUI.AthenaGamePhaseWidgetBase
// Size: 0x2f0 (Inherited: 0x2d0)
struct UAthenaGamePhaseWidgetBase : UFortHUDElementWidget {
	struct UTextBlock* Text_RemainingTime; // 0x2d0(0x08)
	struct UMaterialInterface* StormComingFontMaterial; // 0x2d8(0x08)
	float StormComingWarningTime; // 0x2e0(0x04)
	char pad_2E4[0xc]; // 0x2e4(0x0c)

	void OnGamePhaseStepChanged(enum class EAthenaGamePhaseStep GamePhaseStep); // Function FortniteUI.AthenaGamePhaseWidgetBase.OnGamePhaseStepChanged // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void HandleGamePhaseStepChanged(struct TScriptInterface<IFortSafeZoneInterface>& InSafeZoneInterface, enum class EAthenaGamePhaseStep GamePhaseStep); // Function FortniteUI.AthenaGamePhaseWidgetBase.HandleGamePhaseStepChanged // (Final|Native|Private|HasOutParms) // @ game+0xd8cd68
	void HandleCountdownUpdate(int32_t TimeRemaining); // Function FortniteUI.AthenaGamePhaseWidgetBase.HandleCountdownUpdate // (Final|Native|Private) // @ game+0x9cdc0a8
};

// Class FortniteUI.AthenaGenericHUDTimerWidgetBase
// Size: 0x2f0 (Inherited: 0x2d0)
struct UAthenaGenericHUDTimerWidgetBase : UFortHUDElementWidget {
	char pad_2D0[0x10]; // 0x2d0(0x10)
	struct UTextBlock* TimeText; // 0x2e0(0x08)
	char pad_2E8[0x8]; // 0x2e8(0x08)

	void HandleGamePhaseChanged(enum class EAthenaGamePhase GamePhase); // Function FortniteUI.AthenaGenericHUDTimerWidgetBase.HandleGamePhaseChanged // (Final|Native|Protected) // @ game+0x9cdc1a8
};

// Class FortniteUI.AthenaGlobalCurrencyWidget
// Size: 0x298 (Inherited: 0x290)
struct UAthenaGlobalCurrencyWidget : UCommonUserWidget {
	struct UCommonNumericTextBlock* CurrencyTotalText; // 0x290(0x08)

	void HandleOnItemCountChanged(struct UFortItemDefinition* Definition, int32_t Delta); // Function FortniteUI.AthenaGlobalCurrencyWidget.HandleOnItemCountChanged // (Final|Native|Protected) // @ game+0x9cdc700
};

// Class FortniteUI.AthenaHUDBase
// Size: 0x5a8 (Inherited: 0x3c0)
struct UAthenaHUDBase : UFortUIStateWidgetBase {
	char pad_3C0[0x30]; // 0x3c0(0x30)
	struct TArray<struct UUserWidget*> MinigameWidgets; // 0x3f0(0x10)
	struct TArray<struct UFortWeaponReticleExtensionData*> WeaponReticleExtensionDatas; // 0x400(0x10)
	struct UUserWidget* KairosHUDLayerClass; // 0x410(0x08)
	struct TArray<struct FMutatorAddedWidgets> MutatorAddedWidgets; // 0x418(0x10)
	char pad_428[0x60]; // 0x428(0x60)
	struct UFortWeaponReticleExtensionWidgetBase* CurrentCustomReticleExtension; // 0x488(0x08)
	struct TArray<struct UFortWeaponReticleExtensionWidgetBase*> RecentReticleExtensions; // 0x490(0x10)
	struct UAthenaMapScreenContainer* MapScreenContainer; // 0x4a0(0x08)
	struct UAthenaHUDMenu* AthenaHUDMenu; // 0x4a8(0x08)
	struct UCommonActivatableWidget* TitleBar; // 0x4b0(0x08)
	struct TSet<enum class EUIExtensionSlot> RelevantExtensionSlots; // 0x4b8(0x50)
	struct TArray<struct FUIExtension> TournamentUIExtensions; // 0x508(0x10)
	struct TArray<struct FUIExtension> ArenaTournamentUIExtensions; // 0x518(0x10)
	struct UDynamicUIScene* PreloadMenuScene; // 0x528(0x08)
	struct TSoftClassPtr<UObject> NewEmotePicker; // 0x530(0x28)
	struct TSoftClassPtr<UObject> SquadComsPickerClass; // 0x558(0x28)
	struct TSoftClassPtr<UObject> WeaponWheelClass; // 0x580(0x28)

	void SetZoneCompleted(bool bValue); // Function FortniteUI.AthenaHUDBase.SetZoneCompleted // (Final|Native|Protected|BlueprintCallable) // @ game+0x9cddee8
	void ReleaseMenu(); // Function FortniteUI.AthenaHUDBase.ReleaseMenu // (Final|Native|Protected|BlueprintCallable|Const) // @ game+0x9cdd9fc
	void PreloadMenu(); // Function FortniteUI.AthenaHUDBase.PreloadMenu // (Final|Native|Protected|BlueprintCallable|Const) // @ game+0x9cdd9e8
	void PlaylistExtensionWidgetCreatedNotSupported(enum class EUIExtensionSlot ExtensionSlot, struct UUserWidget* Widget); // Function FortniteUI.AthenaHUDBase.PlaylistExtensionWidgetCreatedNotSupported // (Final|Native|Private|BlueprintCallable|Const) // @ game+0x9cdd900
	void OnHUDScaleChanged(float HUDScale); // Function FortniteUI.AthenaHUDBase.OnHUDScaleChanged // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnExtensionWidgetRemoved(enum class EUIExtensionSlot ExtensionSlot, struct UUserWidget* Widget); // Function FortniteUI.AthenaHUDBase.OnExtensionWidgetRemoved // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnExtensionWidgetCreated(enum class EUIExtensionSlot ExtensionSlot, struct UUserWidget* Widget); // Function FortniteUI.AthenaHUDBase.OnExtensionWidgetCreated // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void HandleWeaponEquipped(struct AFortWeapon* NewWeapon, struct AFortWeapon* PrevWeapon); // Function FortniteUI.AthenaHUDBase.HandleWeaponEquipped // (Final|Native|Private) // @ game+0x200f478
	void HandleUpdateMinigameUIExtensions(struct AFortMinigame* Minigame); // Function FortniteUI.AthenaHUDBase.HandleUpdateMinigameUIExtensions // (Final|Native|Protected) // @ game+0x9cdcf20
	void HandlePickerOpenRequest(enum class EFortPickerMode Mode, int32_t InitialOption, bool bIgnoreFirstAccept); // Function FortniteUI.AthenaHUDBase.HandlePickerOpenRequest // (Final|Native|Protected) // @ game+0x9cdcaa0
	void HandleOnMutatorRemoved(struct AFortGameplayMutator* NewMutator); // Function FortniteUI.AthenaHUDBase.HandleOnMutatorRemoved // (Final|Native|Protected) // @ game+0x9cdc8f8
	void HandleOnMutatorAdded(struct AFortGameplayMutator* NewMutator); // Function FortniteUI.AthenaHUDBase.HandleOnMutatorAdded // (Final|Native|Protected) // @ game+0x9cdc878
	void HandleNewPanelFromMutator(struct UUserWidget* PanelClass); // Function FortniteUI.AthenaHUDBase.HandleNewPanelFromMutator // (Final|Native|Protected) // @ game+0x9cdc680
	void HandleMinigamePlayModeChanged(struct AFortMinigame* Minigame, bool bIsInPlayMode); // Function FortniteUI.AthenaHUDBase.HandleMinigamePlayModeChanged // (Final|Native|Protected) // @ game+0x9cdc5b8
	void HandleMinigameHideHUD(bool bLoading); // Function FortniteUI.AthenaHUDBase.HandleMinigameHideHUD // (Final|Native|Protected) // @ game+0x9cdc538
	void HandleLocalPlayerDied(struct FFortPlayerDeathReport& DeathReport); // Function FortniteUI.AthenaHUDBase.HandleLocalPlayerDied // (Final|Native|Private|HasOutParms) // @ game+0x9cdc458
	void HandleGamePhaseChanged(enum class EAthenaGamePhase NewPhase); // Function FortniteUI.AthenaHUDBase.HandleGamePhaseChanged // (Final|Native|Private) // @ game+0x2be6218
	void HandleCursorModeChanging(bool bCursorModeEnabled, struct FName ActionName); // Function FortniteUI.AthenaHUDBase.HandleCursorModeChanging // (Final|Native|Protected) // @ game+0x26d0d24
	void HandleCursorModeChanged(bool bCursorModeEnabled, struct FName ActionName, struct UUserWidget* CustomWidget); // Function FortniteUI.AthenaHUDBase.HandleCursorModeChanged // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	bool GetZoneCompleted(); // Function FortniteUI.AthenaHUDBase.GetZoneCompleted // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x85b72a8
	void BindVolumeEvents(); // Function FortniteUI.AthenaHUDBase.BindVolumeEvents // (Native|Protected) // @ game+0x75c4260
};

// Class FortniteUI.AthenaHUDGamePhaseChangingBase
// Size: 0x320 (Inherited: 0x2d0)
struct UAthenaHUDGamePhaseChangingBase : UFortHUDElementWidget {
	char pad_2D0[0x40]; // 0x2d0(0x40)
	struct FFortPrioritizedWidgetData PrioritizationData; // 0x310(0x02)
	char pad_312[0xe]; // 0x312(0x0e)

	void HandleGamePhaseStepChanged(struct TScriptInterface<IFortSafeZoneInterface>& SafeZoneInterface, enum class EAthenaGamePhaseStep GamePhaseStep); // Function FortniteUI.AthenaHUDGamePhaseChangingBase.HandleGamePhaseStepChanged // (Final|Native|Private|HasOutParms) // @ game+0xd8caac
	void BP_UpdateMessaging(enum class EAthenaGamePhaseStep Step, struct FText& message, struct FText& TimeText); // Function FortniteUI.AthenaHUDGamePhaseChangingBase.BP_UpdateMessaging // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xdef49c
	void BP_HandleGamePhaseStepChanged(enum class EAthenaGamePhaseStep Step); // Function FortniteUI.AthenaHUDGamePhaseChangingBase.BP_HandleGamePhaseStepChanged // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
};

// Class FortniteUI.AthenaHUDPlayerActionAlertBase
// Size: 0x2f0 (Inherited: 0x2d0)
struct UAthenaHUDPlayerActionAlertBase : UFortHUDElementWidget {
	struct FGameplayTag HideStormAlertTag; // 0x2d0(0x04)
	char pad_2D4[0x1c]; // 0x2d4(0x1c)

	void RequestNextAlert(); // Function FortniteUI.AthenaHUDPlayerActionAlertBase.RequestNextAlert // (Final|Native|Protected|BlueprintCallable) // @ game+0x219b538
	void BP_ShowAlert(enum class EAthenaPlayerActionAlert Alert, struct FText& DetailText); // Function FortniteUI.AthenaHUDPlayerActionAlertBase.BP_ShowAlert // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xdef49c
	void BP_OnAlertsCleared(); // Function FortniteUI.AthenaHUDPlayerActionAlertBase.BP_OnAlertsCleared // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
};

// Class FortniteUI.AthenaIndicatorLayerBase
// Size: 0x3a0 (Inherited: 0x2d0)
struct UAthenaIndicatorLayerBase : UFortHUDElementWidget {
	struct UFortActorCanvas* GeneralIndicators; // 0x2d0(0x08)
	struct UFortActorCanvas* NameIndicators; // 0x2d8(0x08)
	struct UAthenaPlayerIndicatorBase* PlayerIndicatorClass; // 0x2e0(0x08)
	int32_t PlayerIndicatorPoolSize; // 0x2e8(0x04)
	char pad_2EC[0x4]; // 0x2ec(0x04)
	struct FUserWidgetPool PlayerIndicatorWidgetPool; // 0x2f0(0x88)
	struct UAthenaPlayerViewModel* PlayerVM; // 0x378(0x08)
	struct USlateVectorArtData* TeamIndicatorMesh; // 0x380(0x08)
	bool bWasTargeting; // 0x388(0x01)
	char pad_389[0x17]; // 0x389(0x17)

	void OnTargetingChanged(bool bTargeting); // Function FortniteUI.AthenaIndicatorLayerBase.OnTargetingChanged // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void HandleIndicatorModeChanged(bool bIndicatorsEnabled); // Function FortniteUI.AthenaIndicatorLayerBase.HandleIndicatorModeChanged // (Final|Native|Protected) // @ game+0x9cba25c
};

// Class FortniteUI.AthenaInventoryEquipButtonBase
// Size: 0x1460 (Inherited: 0x1430)
struct UAthenaInventoryEquipButtonBase : UCommonButtonLegacy {
	struct UFortMultiSizeItemCard* ItemWidget; // 0x1430(0x08)
	struct UWidget* EmptyImage; // 0x1438(0x08)
	int32_t SlotIndex; // 0x1440(0x04)
	char pad_1444[0x4]; // 0x1444(0x04)
	struct TArray<struct FVector2D> ButtonSizeBySlotUsage; // 0x1448(0x10)
	char pad_1458[0x8]; // 0x1458(0x08)
};

// Class FortniteUI.AthenaInventoryItemTileButton
// Size: 0x1450 (Inherited: 0x1430)
struct UAthenaInventoryItemTileButton : UCommonButtonLegacy {
	char pad_1430[0x8]; // 0x1430(0x08)
	struct UAthenaItemIcon* ItemIcon; // 0x1438(0x08)
	char pad_1440[0x10]; // 0x1440(0x10)

	void OnItemChanged(struct UFortItem* Item); // Function FortniteUI.AthenaInventoryItemTileButton.OnItemChanged // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	struct UFortItem* GetItemToRepresent(); // Function FortniteUI.AthenaInventoryItemTileButton.GetItemToRepresent // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x9cdbb88
};

// Class FortniteUI.AthenaItemSelectorScreenBase
// Size: 0x950 (Inherited: 0x668)
struct UAthenaItemSelectorScreenBase : UFortItemPreviewScreen {
	char pad_668[0x10]; // 0x668(0x10)
	struct UCommonButtonLegacy* TabButtonType; // 0x678(0x08)
	struct TMap<enum class EAthenaCustomizationCategory, struct FFortTabButtonLabelInfo> ItemCategoryButtonLabelInfo; // 0x680(0x50)
	struct FFortTabButtonLabelInfo VariantButtonLabelInfo; // 0x6d0(0xe0)
	struct UCommonButtonLegacy* Button_ConfirmSelection; // 0x7b0(0x08)
	struct UCommonButtonLegacy* Button_EditStyle; // 0x7b8(0x08)
	struct UCommonButtonLegacy* Button_ConfirmStyle; // 0x7c0(0x08)
	struct UCommonButtonBase* Button_CommitArchiveChange; // 0x7c8(0x08)
	struct UCommonButtonBase* Button_ApplyToAll; // 0x7d0(0x08)
	struct UCommonButtonBase* Button_CloseSortAndFilterBlade; // 0x7d8(0x08)
	struct UCommonButtonBase* Button_Back; // 0x7e0(0x08)
	struct UCommonButtonBase* Button_Favorite; // 0x7e8(0x08)
	struct UCommonButtonBase* Button_Unfavorite; // 0x7f0(0x08)
	struct UWidget* Widget_ArchiveModeButtonContainer; // 0x7f8(0x08)
	struct UFortHoldableButton* Button_ArchiveMode; // 0x800(0x08)
	struct UFortHoldableButton* Button_UnarchiveMode; // 0x808(0x08)
	struct UFortHoldableButton* Button_ViewInBattlePass; // 0x810(0x08)
	struct UWidget* Widget_ShowArchivedItemsButtonContainer; // 0x818(0x08)
	struct UCommonButtonBase* Button_ShowArchivedItems; // 0x820(0x08)
	struct UCommonButtonBase* Button_HideArchivedItems; // 0x828(0x08)
	struct UCommonButtonBase* Button_CloseMobile; // 0x830(0x08)
	struct UAthenaCustomizationPicker* Picker_ItemSelector; // 0x838(0x08)
	struct UAthenaCustomizationPickerSortAndFilterBlade* Blade_SortAndFilter; // 0x840(0x08)
	struct UVerticalBox* ItemInfo; // 0x848(0x08)
	struct UFortItemBaseWidget* Item_HeaderInfo; // 0x850(0x08)
	bool bVariantZoomUsesSnap; // 0x858(0x01)
	char pad_859[0x7]; // 0x859(0x07)
	struct UFortItem* CurrentPreviewItem; // 0x860(0x08)
	struct UAthenaCosmeticItemDefinition* CurrentPreviewItemDef; // 0x868(0x08)
	struct TArray<struct FMcpVariantChannelInfo> CurrentPreviewVariantChannels; // 0x870(0x10)
	struct TArray<struct FMcpVariantChannelInfo> CachedVariantChannels; // 0x880(0x10)
	char pad_890[0x1]; // 0x890(0x01)
	enum class ELockerScreenState LockerState; // 0x891(0x01)
	char pad_892[0x6]; // 0x892(0x06)
	struct UFortVariantPicker* Picker_VariantSelector; // 0x898(0x08)
	struct UAthenaCosmeticUnlockingInfo* UnlockingInfo; // 0x8a0(0x08)
	char pad_8A8[0x41]; // 0x8a8(0x41)
	enum class EAthenaCustomizationCategory CustomizeCategory; // 0x8e9(0x01)
	char pad_8EA[0x6]; // 0x8ea(0x06)
	struct TSoftClassPtr<UObject> LockerConfirmationModalClass; // 0x8f0(0x28)
	struct FName ArchiveMaterialParameterName; // 0x918(0x04)
	float ArchiveMaterialParameterEquippingValue; // 0x91c(0x04)
	float ArchiveMaterialParameterArchivingValue; // 0x920(0x04)
	char pad_924[0x4]; // 0x924(0x04)
	struct UUserWidget* Tooltip_LockerArchivingCleanup; // 0x928(0x08)
	struct UUserWidget* Tooltip_ArchiveMode; // 0x930(0x08)
	struct UUserWidget* Tooltip_ArchivedItems; // 0x938(0x08)
	int32_t SubslotIndex; // 0x940(0x04)
	char pad_944[0xc]; // 0x944(0x0c)

	void StartItemCustomization(struct FAthenaCustomizationParams& Params); // Function FortniteUI.AthenaItemSelectorScreenBase.StartItemCustomization // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x9cde17c
	void SaveAndExit_ApplyToAllSlots(); // Function FortniteUI.AthenaItemSelectorScreenBase.SaveAndExit_ApplyToAllSlots // (Final|Native|Public|BlueprintCallable) // @ game+0x9cdda90
	void SaveAndExit(bool bApplyToAllSlots); // Function FortniteUI.AthenaItemSelectorScreenBase.SaveAndExit // (Final|Native|Protected) // @ game+0x9cdda10
	void OnUpdateLockerArchivingCleanupTooltipText(struct FText& Text); // Function FortniteUI.AthenaItemSelectorScreenBase.OnUpdateLockerArchivingCleanupTooltipText // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xdef49c
	void OnUpdateExclusiveItemCallout(bool bShouldShow, struct FText& CalloutText); // Function FortniteUI.AthenaItemSelectorScreenBase.OnUpdateExclusiveItemCallout // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0xdef49c
	void OnUpdateArchiveModeTooltipText(struct FText& Text); // Function FortniteUI.AthenaItemSelectorScreenBase.OnUpdateArchiveModeTooltipText // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xdef49c
	void OnUpdateArchivedItemsTooltipText(struct FText& Text); // Function FortniteUI.AthenaItemSelectorScreenBase.OnUpdateArchivedItemsTooltipText // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xdef49c
	void OnTabSelectionChanged(bool bShowingVariants); // Function FortniteUI.AthenaItemSelectorScreenBase.OnTabSelectionChanged // (Event|Public|BlueprintEvent) // @ game+0xdef49c
	void OnShowLockerArchivingCleanupTooltip(bool bShowTooltip); // Function FortniteUI.AthenaItemSelectorScreenBase.OnShowLockerArchivingCleanupTooltip // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnShowArchiveModeTooltip(bool bShowTooltip); // Function FortniteUI.AthenaItemSelectorScreenBase.OnShowArchiveModeTooltip // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnShowArchivedItemsTooltip(bool bShowTooltip); // Function FortniteUI.AthenaItemSelectorScreenBase.OnShowArchivedItemsTooltip // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnLockerScreenStateChanged(); // Function FortniteUI.AthenaItemSelectorScreenBase.OnLockerScreenStateChanged // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnItemSelectionCommited(struct UFortItem* SelectedItem); // Function FortniteUI.AthenaItemSelectorScreenBase.OnItemSelectionCommited // (Final|Native|Protected) // @ game+0x9cdd86c
	void OnItemSelectedChanged(struct UFortItem* SelectedItem); // Function FortniteUI.AthenaItemSelectorScreenBase.OnItemSelectedChanged // (Final|Native|Protected) // @ game+0x9cdd7ec
	void OnHideItemInfoHeader(bool bShouldHide); // Function FortniteUI.AthenaItemSelectorScreenBase.OnHideItemInfoHeader // (Event|Public|BlueprintEvent) // @ game+0xdef49c
	void OnFinishedItemSetup(struct FText& CategoryDisplayName, struct FText& ItemDisplayTypeName, enum class EAthenaCustomizationCategory SelectedCategory, struct UMaterialInstance* OverrideSlotImage); // Function FortniteUI.AthenaItemSelectorScreenBase.OnFinishedItemSetup // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0xdef49c
	void OnFinishedItemSave(); // Function FortniteUI.AthenaItemSelectorScreenBase.OnFinishedItemSave // (Event|Public|BlueprintEvent) // @ game+0xdef49c
	void OnCurrentItemChanged(struct UFortItem* SelectedItem); // Function FortniteUI.AthenaItemSelectorScreenBase.OnCurrentItemChanged // (Event|Public|BlueprintEvent) // @ game+0xdef49c
	bool IsItemOwned(struct UFortItem* Item); // Function FortniteUI.AthenaItemSelectorScreenBase.IsItemOwned // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x9cdd4b8
	void IsAlternateActionHovered(bool bAlternateActionHovered); // Function FortniteUI.AthenaItemSelectorScreenBase.IsAlternateActionHovered // (Final|Native|Protected|BlueprintCallable) // @ game+0x9cdd404
	void HandleShowArchivedItemsTooltipDismissed(); // Function FortniteUI.AthenaItemSelectorScreenBase.HandleShowArchivedItemsTooltipDismissed // (Final|Native|Private|BlueprintCallable|Const) // @ game+0x9cdcee4
	void HandleSearchTextChanged(struct FText& NewText); // Function FortniteUI.AthenaItemSelectorScreenBase.HandleSearchTextChanged // (Final|Native|Protected|HasOutParms|BlueprintCallable) // @ game+0x9cdcc14
	void HandleScreenAnalytics(bool bItemChanged); // Function FortniteUI.AthenaItemSelectorScreenBase.HandleScreenAnalytics // (Final|Native|Protected|BlueprintCallable) // @ game+0x9cdcb98
	void HandlePickerMarkedItemsChanged(int32_t MarkedCount); // Function FortniteUI.AthenaItemSelectorScreenBase.HandlePickerMarkedItemsChanged // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void HandleLockerArchivingCleanupTooltipDismissed(); // Function FortniteUI.AthenaItemSelectorScreenBase.HandleLockerArchivingCleanupTooltipDismissed // (Final|Native|Private|BlueprintCallable|Const) // @ game+0x9cdc4fc
	void HandleCommitArchiveChangeClicked(); // Function FortniteUI.AthenaItemSelectorScreenBase.HandleCommitArchiveChangeClicked // (Final|Native|Protected) // @ game+0x9cdc094
	void HandleArchiveModeTooltipDismissed(); // Function FortniteUI.AthenaItemSelectorScreenBase.HandleArchiveModeTooltipDismissed // (Final|Native|Private|BlueprintCallable|Const) // @ game+0x9cdbfb8
	void HandleAboutToClose(); // Function FortniteUI.AthenaItemSelectorScreenBase.HandleAboutToClose // (Final|Native|Protected|BlueprintCallable) // @ game+0x9cdbf40
	struct UFortItem* GetCurrentItem(); // Function FortniteUI.AthenaItemSelectorScreenBase.GetCurrentItem // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9cdb958
	void ExitEditStyle(); // Function FortniteUI.AthenaItemSelectorScreenBase.ExitEditStyle // (Final|Native|Protected|BlueprintCallable) // @ game+0x9cdb6bc
	void EnterEditStyle(); // Function FortniteUI.AthenaItemSelectorScreenBase.EnterEditStyle // (Final|Native|Protected) // @ game+0x9cdb6a8
	void BP_HandleBack(); // Function FortniteUI.AthenaItemSelectorScreenBase.BP_HandleBack // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
};

// Class FortniteUI.AthenaLeaderboardScreenBase
// Size: 0x750 (Inherited: 0x518)
struct UAthenaLeaderboardScreenBase : UFortActivatablePanel {
	struct UFortTabListWidgetBase* LeaderboardTabList; // 0x518(0x08)
	struct UCommonRotator* MatchRotator; // 0x520(0x08)
	struct UCommonRotator* LeaderboardTypeRotator; // 0x528(0x08)
	struct UCommonTextBlock* RefreshTimeText; // 0x530(0x08)
	struct UCommonTextBlock* NoDataMessageText; // 0x538(0x08)
	struct UCommonBorder* BorderLocalUserFocus; // 0x540(0x08)
	struct UWidget* Widget_ProfileStats; // 0x548(0x08)
	struct UFortProfileStatsRow* AthenaStats_Wins; // 0x550(0x08)
	struct UFortProfileStatsRow* AthenaStats_SecondTierFinishes; // 0x558(0x08)
	struct UFortProfileStatsRow* AthenaStats_ThirdTierFinishes; // 0x560(0x08)
	struct UFortProfileStatsRow* AthenaStats_Eliminations; // 0x568(0x08)
	struct UFortProfileStatsRow* AthenaStats_MatchesPlayer; // 0x570(0x08)
	struct UCommonButtonBase* Button_ChangeFlag; // 0x578(0x08)
	struct UFortFlagImage* Image_YourFlag; // 0x580(0x08)
	struct FName LTMPlaylistDefaultName; // 0x588(0x04)
	char pad_58C[0x4]; // 0x58c(0x04)
	struct UFortFlagSelectionModal* FortFlagSelectionModalClass; // 0x590(0x08)
	struct TMap<struct FName, struct UFortProfileStatsRow*> ActiveProfileRows; // 0x598(0x50)
	char pad_5E8[0x90]; // 0x5e8(0x90)
	struct UDataTable* PlaylistsData; // 0x678(0x08)
	struct TMap<struct FName, struct UCommonButtonBase*> ActiveTabButtons; // 0x680(0x50)
	struct TArray<struct UFortLeaderboardRowProxyInstance*> RowProxies; // 0x6d0(0x10)
	struct UFortLeaderboardRowProxyInstance* LocalUserRowProxy; // 0x6e0(0x08)
	struct FLeaderboardFilter CurrentLeaderboardFilter; // 0x6e8(0x18)
	char pad_700[0x50]; // 0x700(0x50)

	void OnUpdateTabButtonText(struct UCommonButtonBase* Button, struct FAthenaPlaylistLeaderboardData& PlaylistTabData); // Function FortniteUI.AthenaLeaderboardScreenBase.OnUpdateTabButtonText // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xdef49c
	void OnUpdateListHeader(struct FAthenaPlaylistLeaderboardData& PlaylistTabData); // Function FortniteUI.AthenaLeaderboardScreenBase.OnUpdateListHeader // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xdef49c
	void OnUpdateLeaderboardListUI(bool bWasSuccessful, struct UFortLeaderboardRowProxyInstance* LocalUserRow, struct FText& QueryErrorStr); // Function FortniteUI.AthenaLeaderboardScreenBase.OnUpdateLeaderboardListUI // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xdef49c
	void OnQueryStarted(); // Function FortniteUI.AthenaLeaderboardScreenBase.OnQueryStarted // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnQueryFinished(); // Function FortniteUI.AthenaLeaderboardScreenBase.OnQueryFinished // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnPlaylistChanged(struct FName NewPlaylistName, enum class ECommonInputType NewInputType); // Function FortniteUI.AthenaLeaderboardScreenBase.OnPlaylistChanged // (Final|Native|Protected|BlueprintCallable) // @ game+0x9d056b0
	void OnMatchTypeChanged(int32_t MatchTypeIndex); // Function FortniteUI.AthenaLeaderboardScreenBase.OnMatchTypeChanged // (Final|Native|Protected|BlueprintCallable) // @ game+0x9d055bc
	void OnFriendsFilterChanged(int32_t FriendsFilterIndex); // Function FortniteUI.AthenaLeaderboardScreenBase.OnFriendsFilterChanged // (Final|Native|Protected|BlueprintCallable) // @ game+0x9d05480
	void OnActiveLeaderboardTabChanged(int32_t ActiveWidgetIndex); // Function FortniteUI.AthenaLeaderboardScreenBase.OnActiveLeaderboardTabChanged // (Final|Native|Protected|BlueprintCallable) // @ game+0x9d053ec
	bool CanShowFriendsOnlyLeaderboard(); // Function FortniteUI.AthenaLeaderboardScreenBase.CanShowFriendsOnlyLeaderboard // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x248ecd4
};

// Class FortniteUI.AthenaLevelBarBase
// Size: 0x370 (Inherited: 0x370)
struct UAthenaLevelBarBase : UFortActorIndicatorWidget {
};

// Class FortniteUI.AthenaLoadoutEntryWidget
// Size: 0x2a0 (Inherited: 0x290)
struct UAthenaLoadoutEntryWidget : UCommonUserWidget {
	struct UFortAthenaInventoryLoadout* SelectedLoadout; // 0x290(0x08)
	char pad_298[0x8]; // 0x298(0x08)

	void SetLoadout(struct UFortAthenaInventoryLoadout* NewLoadout); // Function FortniteUI.AthenaLoadoutEntryWidget.SetLoadout // (Native|Event|Public|BlueprintEvent) // @ game+0x67ab4e8
	void OnLoadoutPicked(); // Function FortniteUI.AthenaLoadoutEntryWidget.OnLoadoutPicked // (Final|Native|Public|BlueprintCallable) // @ game+0x9d055a8
};

// Class FortniteUI.AthenaLoadoutWidget
// Size: 0x538 (Inherited: 0x518)
struct UAthenaLoadoutWidget : UFortActivatablePanel {
	struct TArray<struct UAthenaLoadoutEntryWidget*> EntryWidgets; // 0x518(0x10)
	struct UAthenaLoadoutEntryWidget* EntryWidgetClass; // 0x528(0x08)
	char pad_530[0x8]; // 0x530(0x08)

	void OnLoadoutChosen(struct UFortAthenaInventoryLoadout* SelectedLoadout); // Function FortniteUI.AthenaLoadoutWidget.OnLoadoutChosen // (Native|Event|Public|BlueprintEvent) // @ game+0x6993338
	void AddEntryWidget(struct UAthenaLoadoutEntryWidget* NewWidget); // Function FortniteUI.AthenaLoadoutWidget.AddEntryWidget // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
};

// Class FortniteUI.FortLobbyWidget
// Size: 0x580 (Inherited: 0x518)
struct UFortLobbyWidget : UFortActivatablePanel {
	char pad_518[0x10]; // 0x518(0x10)
	struct AAthenaSquadPedestalGroup* SquadPedestalGroup; // 0x528(0x08)
	struct TArray<struct AFortTeamMemberPedestal*> VisualOrderedPedestals; // 0x530(0x10)
	char pad_540[0x20]; // 0x540(0x20)
	struct UFortRadialPicker* Radial_EmotePicker; // 0x560(0x08)
	struct UFortLobbyPlayerPanel* PlayerPanel_PlayerOptions; // 0x568(0x08)
	struct FDataTableRowHandle EmoteInputAction; // 0x570(0x10)

	void OnPlayerPanelHidden(); // Function FortniteUI.FortLobbyWidget.OnPlayerPanelHidden // (Event|Public|BlueprintEvent) // @ game+0xdef49c
	void OnPlayerClicked(); // Function FortniteUI.FortLobbyWidget.OnPlayerClicked // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0xdef49c
	void HandleEmoteClicked(bool& bPassThrough); // Function FortniteUI.FortLobbyWidget.HandleEmoteClicked // (Native|Protected|HasOutParms) // @ game+0xa015b74
	void DynamicHandleLoadingScreenVisibilityChanged(bool IsVisible); // Function FortniteUI.FortLobbyWidget.DynamicHandleLoadingScreenVisibilityChanged // (Final|Native|Protected) // @ game+0x231381c
};

// Class FortniteUI.AthenaLobbyBase
// Size: 0x778 (Inherited: 0x580)
struct UAthenaLobbyBase : UFortLobbyWidget {
	char pad_580[0xd8]; // 0x580(0xd8)
	struct UContentWidget* Content_MatchmakingWidget; // 0x658(0x08)
	struct UEmergencyNoticeBase* Notice_Emergency; // 0x660(0x08)
	struct UFortAthenaMOTDTeaserWidget* FortAthenaMOTDTeaserWidget_Main; // 0x668(0x08)
	struct UCommonBorder* LobbyDetails_Default; // 0x670(0x08)
	struct UFortTournamentLobbyPanel* LobbyDetails_Tournament; // 0x678(0x08)
	struct UFortDivisionLobbyPanel* LobbyDetails_ShowdownDivision; // 0x680(0x08)
	struct UCommonWidgetSwitcherLegacy* Switcher_LobbyDetailsMode; // 0x688(0x08)
	struct UCommonButtonBase* Button_GenericLink; // 0x690(0x08)
	struct UCommonButtonBase* Button_ShadowPlayHighlights; // 0x698(0x08)
	struct UVerticalBox* VerticalBox_LobbyDetails; // 0x6a0(0x08)
	struct UOverlay* Overlay_DynamicExtensions; // 0x6a8(0x08)
	struct TSoftClassPtr<UObject> NewEmotePicker; // 0x6b0(0x28)
	struct UCatalogMessaging* CatalogMessaging; // 0x6d8(0x08)
	struct FDataTableRowHandle SquadFormationInputAction; // 0x6e0(0x10)
	struct UFortSquadSelectionMenu* SquadFormationClass; // 0x6f0(0x08)
	struct UFortAthenaMatchmakingWidgetLegacy* DefaultMatchmakingWidgetClass; // 0x6f8(0x08)
	struct UFortAthenaMatchmakingWidgetLegacy* MatchmakingWidget; // 0x700(0x08)
	struct UFortGlobalSeasonResourceWidget* SeasonalResources; // 0x708(0x08)
	char pad_710[0x68]; // 0x710(0x68)

	void UpdateGenericLinkText(struct FText& NewText); // Function FortniteUI.AthenaLobbyBase.UpdateGenericLinkText // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xdef49c
	void OnPlaylistChanged(enum class EFortLobbyType LobbyType, struct UFortPlaylistAthena* PlaylistData); // Function FortniteUI.AthenaLobbyBase.OnPlaylistChanged // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnMatchmakingWidgetChanged(); // Function FortniteUI.AthenaLobbyBase.OnMatchmakingWidgetChanged // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnLobbyChanged(enum class EFortLobbyType LobbyType); // Function FortniteUI.AthenaLobbyBase.OnLobbyChanged // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void HandlePickerOpenRequest(enum class EFortPickerMode Mode, int32_t InitialOption, bool bIgnoreFirstAccept); // Function FortniteUI.AthenaLobbyBase.HandlePickerOpenRequest // (Final|Native|Private) // @ game+0x9d04d38
	void HandleHideLobbySeasonResources(bool bShouldHide); // Function FortniteUI.AthenaLobbyBase.HandleHideLobbySeasonResources // (Final|Native|Private) // @ game+0x271a16c
	void HandleActiveWidgetChanged(struct UWidget* NewActiveWidget, int32_t WidgetIndex); // Function FortniteUI.AthenaLobbyBase.HandleActiveWidgetChanged // (Final|Native|Private) // @ game+0x2b5baf8
	void DisplayStoreUpdated(struct UStoreToastRequest* StoreUpdatedRequest); // Function FortniteUI.AthenaLobbyBase.DisplayStoreUpdated // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void DisplayGlyphQuestUpdated(int32_t NewGlyphs); // Function FortniteUI.AthenaLobbyBase.DisplayGlyphQuestUpdated // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
};

// Class FortniteUI.AthenaLockerItemInfo
// Size: 0x2b0 (Inherited: 0x290)
struct UAthenaLockerItemInfo : UCommonUserWidget {
	struct UCommonTextBlock* Text_ItemType; // 0x290(0x08)
	struct UCommonTextBlock* Text_ItemRarity; // 0x298(0x08)
	struct UCommonTextBlock* Text_ItemName; // 0x2a0(0x08)
	struct UCommonRichTextBlock* RichText_Description; // 0x2a8(0x08)

	void OnUpdateAccessRestrictionWarning(bool bShouldShow, struct FText& WarningText, enum class EAthenaLockerInfoRestrictionWarning WarningType); // Function FortniteUI.AthenaLockerItemInfo.OnUpdateAccessRestrictionWarning // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xdef49c
	void OnNoItemSet(); // Function FortniteUI.AthenaLockerItemInfo.OnNoItemSet // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnItemDefinitionSet(struct UFortItemDefinition* ItemDefinition); // Function FortniteUI.AthenaLockerItemInfo.OnItemDefinitionSet // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
};

// Class FortniteUI.AthenaLootStoreScreenBase
// Size: 0x518 (Inherited: 0x518)
struct UAthenaLootStoreScreenBase : UFortActivatablePanel {
};

// Class FortniteUI.AthenaMapLayer
// Size: 0x170 (Inherited: 0x148)
struct UAthenaMapLayer : UWidget {
	char pad_148[0x18]; // 0x148(0x18)
	struct ULocalPlayer* LocalPlayer; // 0x160(0x08)
	struct UWidget* QuestContent; // 0x168(0x08)

	void SetLocalPlayer(struct ULocalPlayer* LocalPlayer); // Function FortniteUI.AthenaMapLayer.SetLocalPlayer // (Final|Native|Public|BlueprintCallable) // @ game+0x9d05f80
	void FlashPlayerIcon(); // Function FortniteUI.AthenaMapLayer.FlashPlayerIcon // (Final|Native|Public|BlueprintCallable) // @ game+0x9d047d4
	void ClearTouches(); // Function FortniteUI.AthenaMapLayer.ClearTouches // (Final|Native|Public|BlueprintCallable) // @ game+0x9d04514
};

// Class FortniteUI.AthenaMapLayerContainer
// Size: 0x510 (Inherited: 0x4e0)
struct UAthenaMapLayerContainer : UCommonActivatablePanelLegacy {
	struct FVector2D NormalizedMapWidgetPosition; // 0x4e0(0x10)
	struct UAthenaMapLayer* AthenaMapLayer; // 0x4f0(0x08)
	struct UAthenaInGameMapIconsOverlay* AthenaMapIconsOverlay_Main; // 0x4f8(0x08)
	struct UAthenaMapChallengeListView* ListView_NonLocationIconsBelowMap; // 0x500(0x08)
	bool bConsumePointerOnTouchInteraction; // 0x508(0x01)
	char pad_509[0x7]; // 0x509(0x07)

	void HandleNewContextualObjectives(struct TArray<struct UFortQuestItem*>& ContextualQuests); // Function FortniteUI.AthenaMapLayerContainer.HandleNewContextualObjectives // (Final|Native|Protected|HasOutParms) // @ game+0x9d04bd8
};

// Class FortniteUI.AthenaMapScreenContainer
// Size: 0x608 (Inherited: 0x3a8)
struct UAthenaMapScreenContainer : UCommonActivatableWidget {
	char pad_3A8[0xe0]; // 0x3a8(0xe0)
	struct TWeakObjectPtr<struct UCommonUserWidget> DefaultTabWidget; // 0x488(0x08)
	struct TMap<struct FName, struct UAthenaSkewedTabButton*> TabButtons; // 0x490(0x50)
	struct FGameplayTagContainer HideWithMapTags; // 0x4e0(0x20)
	struct TArray<struct TSoftClassPtr<UObject>> DefaultTabs; // 0x500(0x10)
	struct FDataTableRowHandle NextTabInputAction; // 0x510(0x10)
	struct FDataTableRowHandle PreviousTabInputAction; // 0x520(0x10)
	struct UCommonVisibilitySwitcher* VisibilitySwitcher_Content; // 0x530(0x08)
	struct UCommonButtonLegacy* MobileCloseButton; // 0x538(0x08)
	struct UPanelWidget* Panel_PlayerProfile; // 0x540(0x08)
	struct UFortSocialAvatarIcon* SocialAvatarIcon; // 0x548(0x08)
	struct UFortAutoRunNotificationWidget* Widget_AutoRunNotification; // 0x550(0x08)
	struct TArray<struct TScriptInterface<IAthenaMapScreenContainerTabInterface>> ActiveTabs; // 0x558(0x10)
	int32_t CachedQuestTabIndex; // 0x568(0x04)
	char pad_56C[0x4]; // 0x56c(0x04)
	struct UInputComponent* MapPanelInputComp; // 0x570(0x08)
	struct UHorizontalBox* TabButtonsContainer; // 0x578(0x08)
	struct UUserWidget* TabButtonClass; // 0x580(0x08)
	char pad_588[0x80]; // 0x588(0x80)

	void SelectActiveTabWidget(); // Function FortniteUI.AthenaMapScreenContainer.SelectActiveTabWidget // (Final|Native|Protected|BlueprintCallable) // @ game+0x9d05a60
	void OnDamageReceived(); // Function FortniteUI.AthenaMapScreenContainer.OnDamageReceived // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void BP_OnShowTabsSet(bool bShowTabs); // Function FortniteUI.AthenaMapScreenContainer.BP_OnShowTabsSet // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
};

// Class FortniteUI.AthenaMapScreenContainerTabButton
// Size: 0x1450 (Inherited: 0x1430)
struct UAthenaMapScreenContainerTabButton : UCommonButtonLegacy {
	struct UCommonLazyImage* LazyImage_Icon; // 0x1430(0x08)
	struct UCommonTextBlock* Text_Title; // 0x1438(0x08)
	struct FVector2D ImageSize_Mobile; // 0x1440(0x10)
};

// Class FortniteUI.AthenaMapScreenTabBase
// Size: 0x408 (Inherited: 0x3a8)
struct UAthenaMapScreenTabBase : UCommonActivatableWidget {
	char pad_3A8[0x10]; // 0x3a8(0x10)
	struct FAthenaMapScreenContainerTabInfo MapTabInfo; // 0x3b8(0x50)
};

// Class FortniteUI.AthenaMarkerDetails
// Size: 0x2e8 (Inherited: 0x2d0)
struct UAthenaMarkerDetails : UFortHUDElementWidget {
	struct UAthenaMarkerPointer* MarkerPointer; // 0x2d0(0x08)
	struct UFortMarkerDetailsTable* DetailsTable; // 0x2d8(0x08)
	struct UFortWorldMarker* FortWorldMarker; // 0x2e0(0x08)

	void UpdateMarkerData(struct FFortWorldMarkerData& MarkerData); // Function FortniteUI.AthenaMarkerDetails.UpdateMarkerData // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xdef49c
	void UpdateMarkerAction(enum class EFortMarkerActions MarkerAction); // Function FortniteUI.AthenaMarkerDetails.UpdateMarkerAction // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
};

// Class FortniteUI.AthenaMarkerPointer
// Size: 0x170 (Inherited: 0x148)
struct UAthenaMarkerPointer : UWidget {
	struct UMaterialInterface* LineMeshMaterial; // 0x148(0x08)
	struct FVector2D TargetScreenPosition; // 0x150(0x10)
	char pad_160[0x10]; // 0x160(0x10)

	void SetTargetScreenPosition(struct FVector2D InTargetScreenPosition); // Function FortniteUI.AthenaMarkerPointer.SetTargetScreenPosition // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x9d06088
	void SetLineMeshMaterial(struct UMaterialInterface* Material); // Function FortniteUI.AthenaMarkerPointer.SetLineMeshMaterial // (Final|Native|Public|BlueprintCallable) // @ game+0x9d05ef8
};

// Class FortniteUI.AthenaMatchmakingViolator
// Size: 0x2f8 (Inherited: 0x290)
struct UAthenaMatchmakingViolator : UCommonUserWidget {
	struct UCommonTextBlock* Text_MainText; // 0x290(0x08)
	struct UCommonTextBlock* Text_SubText; // 0x298(0x08)
	struct FName FirstTimeUser_DialogName; // 0x2a0(0x04)
	char pad_2A4[0x4]; // 0x2a4(0x04)
	struct FText FirstTimeUser_MainText; // 0x2a8(0x18)
	struct FText FirstTimeUser_SubText; // 0x2c0(0x18)
	char pad_2D8[0x20]; // 0x2d8(0x20)
};

// Class FortniteUI.AthenaMatchReadyDesktopPopup
// Size: 0x280 (Inherited: 0x268)
struct UAthenaMatchReadyDesktopPopup : UUserWidget {
	char pad_268[0x18]; // 0x268(0x18)

	void UserDismissedDialog(bool bBringToFront); // Function FortniteUI.AthenaMatchReadyDesktopPopup.UserDismissedDialog // (Final|Native|Public|BlueprintCallable) // @ game+0x9d067a0
};

// Class FortniteUI.AthenaPlayerHitPointBarBase
// Size: 0x378 (Inherited: 0x268)
struct UAthenaPlayerHitPointBarBase : UUserWidget {
	char pad_268[0xe8]; // 0x268(0xe8)
	struct UAthenaPlayerViewModel* PlayerVM; // 0x350(0x08)
	enum class EHealthBarType BarType; // 0x358(0x01)
	char pad_359[0x3]; // 0x359(0x03)
	float ValueCurrent; // 0x35c(0x04)
	float BeginDeltaInterpDelayMin; // 0x360(0x04)
	float BeginDeltaInterpDelayMax; // 0x364(0x04)
	float ValueLast; // 0x368(0x04)
	float ValueMax; // 0x36c(0x04)
	float LastToCurrentUpdateRate; // 0x370(0x04)
	bool bShouldDisplayShieldBar; // 0x374(0x01)
	bool bCanAddExtensionWidgets; // 0x375(0x01)
	enum class EUIExtensionSlot ExtensionSlotToUse; // 0x376(0x01)
	char pad_377[0x1]; // 0x377(0x01)

	void SetProgressBarFillColors(struct FLinearColor ColorA, struct FLinearColor ColorB); // Function FortniteUI.AthenaPlayerHitPointBarBase.SetProgressBarFillColors // (Event|Protected|HasDefaults|BlueprintEvent) // @ game+0xdef49c
	void OnValueChangedWithReason(float Value, enum class EFortHitPointModificationReason Reason); // Function FortniteUI.AthenaPlayerHitPointBarBase.OnValueChangedWithReason // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnMaxValueChanged(float Value); // Function FortniteUI.AthenaPlayerHitPointBarBase.OnMaxValueChanged // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnExtensionWidgetAdded(enum class EUIExtensionSlot ExtensionSlot, struct UUserWidget* ExtensionWidget); // Function FortniteUI.AthenaPlayerHitPointBarBase.OnExtensionWidgetAdded // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnDeltaChanged(); // Function FortniteUI.AthenaPlayerHitPointBarBase.OnDeltaChanged // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnDBNOStateChanged(bool IsDBNO); // Function FortniteUI.AthenaPlayerHitPointBarBase.OnDBNOStateChanged // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	float GetLastValuePercentage(); // Function FortniteUI.AthenaPlayerHitPointBarBase.GetLastValuePercentage // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d0498c
	float GetCurrentValuePercentage(); // Function FortniteUI.AthenaPlayerHitPointBarBase.GetCurrentValuePercentage // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d04930
};

// Class FortniteUI.AthenaPlayerHitPointInfo
// Size: 0x2d8 (Inherited: 0x2d0)
struct UAthenaPlayerHitPointInfo : UFortHUDElementWidget {
	bool bUseLargeFormat; // 0x2d0(0x01)
	char pad_2D1[0x7]; // 0x2d1(0x07)

	void HandleTetherChanged(bool bTethered); // Function FortniteUI.AthenaPlayerHitPointInfo.HandleTetherChanged // (Final|Native|Private) // @ game+0x9d05294
	void HandleExitVehicle(); // Function FortniteUI.AthenaPlayerHitPointInfo.HandleExitVehicle // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void HandleEnterVehicle(); // Function FortniteUI.AthenaPlayerHitPointInfo.HandleEnterVehicle // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
};

// Class FortniteUI.AthenaPlayerIndicatorBase
// Size: 0x4b8 (Inherited: 0x370)
struct UAthenaPlayerIndicatorBase : UFortActorIndicatorWidget {
	char pad_370[0xd8]; // 0x370(0xd8)
	struct FVector2D MinMaxSizeDistance; // 0x448(0x10)
	struct FVector2D MinMaxScale; // 0x458(0x10)
	float FarAwayScaleMultiplier; // 0x468(0x04)
	char pad_46C[0x4]; // 0x46c(0x04)
	struct FVector RelativeLocationWhenDBNO; // 0x470(0x18)
	struct FVector RelativeLocationWhenNotDBNO; // 0x488(0x18)
	struct FVector2D UnscaledScreenSpaceRelativeOffset; // 0x4a0(0x10)
	char pad_4B0[0x8]; // 0x4b0(0x08)

	void OnExtensionWidgetCreated(struct UUserWidget* Widget, enum class EUIExtensionSlot SlotType); // Function FortniteUI.AthenaPlayerIndicatorBase.OnExtensionWidgetCreated // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void HandleCurrentPawnChanged(); // Function FortniteUI.AthenaPlayerIndicatorBase.HandleCurrentPawnChanged // (Final|Native|Private) // @ game+0x238f844
	void BP_UpdateWorldNameVisibility(bool bDisplayWorldName); // Function FortniteUI.AthenaPlayerIndicatorBase.BP_UpdateWorldNameVisibility // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void BP_OnHandleTeamMemberStateChanged(enum class ETeamMemberState TeamMemberState); // Function FortniteUI.AthenaPlayerIndicatorBase.BP_OnHandleTeamMemberStateChanged // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void BP_OnHandleTalkingStateChanged(bool bIsTalking); // Function FortniteUI.AthenaPlayerIndicatorBase.BP_OnHandleTalkingStateChanged // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void BP_OnHandlePlayerStateSet(struct AFortPlayerStateAthena* PlayerStateAthena); // Function FortniteUI.AthenaPlayerIndicatorBase.BP_OnHandlePlayerStateSet // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void BP_OnHandlePlayerNameReplicated(struct FString PlayerName); // Function FortniteUI.AthenaPlayerIndicatorBase.BP_OnHandlePlayerNameReplicated // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void BP_OnHandlePinColorChanged(struct FLinearColor& PinColor); // Function FortniteUI.AthenaPlayerIndicatorBase.BP_OnHandlePinColorChanged // (Event|Protected|HasOutParms|HasDefaults|BlueprintEvent) // @ game+0xdef49c
	void BP_OnHandleDBNOStateChanged(bool bIsDBNO); // Function FortniteUI.AthenaPlayerIndicatorBase.BP_OnHandleDBNOStateChanged // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void BP_OnHandleBeingRevivedStateChanged(bool bIsBeingRevived, float MaxReviveTime); // Function FortniteUI.AthenaPlayerIndicatorBase.BP_OnHandleBeingRevivedStateChanged // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
};

// Class FortniteUI.AthenaPlayerIndicatorExtensionInterface
// Size: 0x28 (Inherited: 0x28)
struct UAthenaPlayerIndicatorExtensionInterface : UInterface {
};

// Class FortniteUI.AthenaPlayerInfoBase
// Size: 0x4a0 (Inherited: 0x2d0)
struct UAthenaPlayerInfoBase : UFortHUDElementWidget {
	char pad_2D0[0xd8]; // 0x2d0(0xd8)
	struct TWeakObjectPtr<struct AFortPlayerStateAthena> WeakPSA; // 0x3a8(0x08)
	bool bIsLocalPlayer; // 0x3b0(0x01)
	char pad_3B1[0x3]; // 0x3b1(0x03)
	struct FSlateColor Color_PlayerNameAlive; // 0x3b4(0x14)
	struct FSlateColor Color_PlayerNameDead; // 0x3c8(0x14)
	struct FSlateColor Color_PlayerNameDisconnected; // 0x3dc(0x14)
	struct UOverlay* Overlay_TeamMemberInfo; // 0x3f0(0x08)
	struct UImage* Image_HealthBar; // 0x3f8(0x08)
	struct UImage* Image_ShieldBar; // 0x400(0x08)
	struct UContentWidget* Content_StormCN; // 0x408(0x08)
	struct UImage* Image_StormCN; // 0x410(0x08)
	struct UImage* Image_DBNOBar; // 0x418(0x08)
	struct UImage* Image_PlatformIcon; // 0x420(0x08)
	struct UCommonTextBlock* Text_PlayerName; // 0x428(0x08)
	struct UImage* Image_Marker; // 0x430(0x08)
	struct UAthenaTeamMemberDBNOState* DBNOStateWidget; // 0x438(0x08)
	struct UImage* Image_DeadIndicator; // 0x440(0x08)
	struct UImage* Image_DisconnectedIndicator; // 0x448(0x08)
	struct UImage* Image_ResurrectChip; // 0x450(0x08)
	struct UImage* Image_ResurrectionChipExpirationBar; // 0x458(0x08)
	struct UCommonWidgetSwitcherLegacy* WidgetSwitcher_Avatar; // 0x460(0x08)
	struct UFortSocialAvatarIcon* Icon_AvatarSocial; // 0x468(0x08)
	struct UImage* Image_AvatarOverride; // 0x470(0x08)
	struct UFortVoiceChatStatusIconProxyAnim* SpeakerWidgetAnim; // 0x478(0x08)
	struct UAthenaLevelEffects* LevelEffects; // 0x480(0x08)
	struct UOverlay* Overlay_HealthAndShieldInfo; // 0x488(0x08)
	char pad_490[0x10]; // 0x490(0x10)

	void SetPlayerState(struct AFortPlayerStateAthena* InPlayerState); // Function FortniteUI.AthenaPlayerInfoBase.SetPlayerState // (Final|Native|Public|BlueprintCallable) // @ game+0x9d06008
	void HandlePlaylistLoaded(struct FName PlaylistName, struct FGameplayTagContainer& PlaylistContextTags); // Function FortniteUI.AthenaPlayerInfoBase.HandlePlaylistLoaded // (Final|Native|Protected|HasOutParms) // @ game+0x9d0509c
	void HandlePlayerMutatorDataChanged(); // Function FortniteUI.AthenaPlayerInfoBase.HandlePlayerMutatorDataChanged // (Final|Native|Protected) // @ game+0x9d04fb8
	void HandleGamePhaseChanged(enum class EAthenaGamePhase NewPhase); // Function FortniteUI.AthenaPlayerInfoBase.HandleGamePhaseChanged // (Final|Native|Protected) // @ game+0x9d04ab4
	void BP_HandleTalkingVisualDisplayChanged(bool bTalkingVisualsActive); // Function FortniteUI.AthenaPlayerInfoBase.BP_HandleTalkingVisualDisplayChanged // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void BP_HandleTalkingStateChanged(bool bIsTalking); // Function FortniteUI.AthenaPlayerInfoBase.BP_HandleTalkingStateChanged // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void BP_HandleSeasonLevelUIDisplayChanged(int32_t Level); // Function FortniteUI.AthenaPlayerInfoBase.BP_HandleSeasonLevelUIDisplayChanged // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void BP_HandleResurrectionStateChanged(struct FFortResurrectionUIData& ResurrectionStateData); // Function FortniteUI.AthenaPlayerInfoBase.BP_HandleResurrectionStateChanged // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xdef49c
	void BP_HandlePlaylistLoaded(struct FName PlaylistName, struct FGameplayTagContainer& PlaylistContextTags); // Function FortniteUI.AthenaPlayerInfoBase.BP_HandlePlaylistLoaded // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xdef49c
	void BP_HandlePlaylistExtensionWidgetCreated(struct UUserWidget* Widget, enum class EUIExtensionSlot SlotType); // Function FortniteUI.AthenaPlayerInfoBase.BP_HandlePlaylistExtensionWidgetCreated // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void BP_HandlePlayerNameReplicated(struct FString PlayerName); // Function FortniteUI.AthenaPlayerInfoBase.BP_HandlePlayerNameReplicated // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void BP_HandleMutedStateChanged(bool bIsMuted); // Function FortniteUI.AthenaPlayerInfoBase.BP_HandleMutedStateChanged // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void BP_HandleIsBeingRevivedStateChanged(bool bIsTalking); // Function FortniteUI.AthenaPlayerInfoBase.BP_HandleIsBeingRevivedStateChanged // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void BP_HandleGameModeIconChanged(struct UTexture2D* GameModeIcon); // Function FortniteUI.AthenaPlayerInfoBase.BP_HandleGameModeIconChanged // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void BP_HandleDBNOStateChanged(bool bDBNO); // Function FortniteUI.AthenaPlayerInfoBase.BP_HandleDBNOStateChanged // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
};

// Class FortniteUI.AthenaPlayerKillsBase
// Size: 0x2e8 (Inherited: 0x2d0)
struct UAthenaPlayerKillsBase : UFortHUDElementWidget {
	struct UTextBlock* KillsText; // 0x2d0(0x08)
	struct UObject* KillsSource; // 0x2d8(0x08)
	bool bCustomKillSource; // 0x2e0(0x01)
	char pad_2E1[0x7]; // 0x2e1(0x07)

	void SetKillsSourcePlayerState(struct AFortPlayerStateAthena* InPlayerState); // Function FortniteUI.AthenaPlayerKillsBase.SetKillsSourcePlayerState // (Final|Native|Public|BlueprintCallable) // @ game+0x245ce9c
	void SetKillsSourcePlayerController(struct AFortPlayerControllerAthena* InPlayerController); // Function FortniteUI.AthenaPlayerKillsBase.SetKillsSourcePlayerController // (Final|Native|Public|BlueprintCallable) // @ game+0x9d05e78
};

// Class FortniteUI.FortAccountWidgetBase
// Size: 0x2c8 (Inherited: 0x290)
struct UFortAccountWidgetBase : UCommonUserWidget {
	char pad_290[0x38]; // 0x290(0x38)

	void OnAccountInfoChanged(struct FFortPublicAccountInfo& Result); // Function FortniteUI.FortAccountWidgetBase.OnAccountInfoChanged // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0xdef49c
	void HandleCurrentlyViewedAccountInfoChanged(struct FFortPublicAccountInfo NewInfo); // Function FortniteUI.FortAccountWidgetBase.HandleCurrentlyViewedAccountInfoChanged // (Native|Protected) // @ game+0x11830a0
	struct FAthenaSeasonBannerLevel GetSeasonBannerInfo(int32_t Level); // Function FortniteUI.FortAccountWidgetBase.GetSeasonBannerInfo // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9ff9ad8
	bool GetNextSeasonReward(struct FFortItemQuantityPair& Reward, int32_t& RewardLevel); // Function FortniteUI.FortAccountWidgetBase.GetNextSeasonReward // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x9ff9950
	bool GetNextSeasonChaseReward(struct FFortItemQuantityPair& Reward, int32_t& RewardLevel, int32_t StartingLevel); // Function FortniteUI.FortAccountWidgetBase.GetNextSeasonChaseReward // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x9ff981c
	struct FText GetCurrentSeasonNumberAsText(); // Function FortniteUI.FortAccountWidgetBase.GetCurrentSeasonNumberAsText // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x117cff4
	struct FText GetCurrentChapterAsText(); // Function FortniteUI.FortAccountWidgetBase.GetCurrentChapterAsText // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x117cf04
};

// Class FortniteUI.AthenaPlayerLevelDisplay
// Size: 0x2d8 (Inherited: 0x2c8)
struct UAthenaPlayerLevelDisplay : UFortAccountWidgetBase {
	struct UCommonTextBlock* Text_Level; // 0x2c8(0x08)
	struct UAthenaSeasonItemRewardIcon* RewardIcon; // 0x2d0(0x08)

	void UpdateBPStatus(enum class EBPStatus Status); // Function FortniteUI.AthenaPlayerLevelDisplay.UpdateBPStatus // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnUpdateXpBar(float Progress, bool bIsMaxLevel); // Function FortniteUI.AthenaPlayerLevelDisplay.OnUpdateXpBar // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnUpdateRewardIcon(struct UFortItem* RewardItem, struct TSoftObjectPtr<UTexture2D>& RewardTexture, bool bHasAdditionalStylesToDisplay, int32_t RewardLevel, bool bRequiresBattlePass); // Function FortniteUI.AthenaPlayerLevelDisplay.OnUpdateRewardIcon // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xdef49c
};

// Class FortniteUI.AthenaPlayersLeftBase
// Size: 0x2e8 (Inherited: 0x2d0)
struct UAthenaPlayersLeftBase : UFortHUDElementWidget {
	char pad_2D0[0x18]; // 0x2d0(0x18)

	void SetPlayersLeftText(struct FText& PlayersText); // Function FortniteUI.AthenaPlayersLeftBase.SetPlayersLeftText // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0xdef49c
	void SetHumansLeftText(struct FText& HumansText); // Function FortniteUI.AthenaPlayersLeftBase.SetHumansLeftText // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0xdef49c
	void SetBotsLeftText(struct FText& BotsText); // Function FortniteUI.AthenaPlayersLeftBase.SetBotsLeftText // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0xdef49c
};

// Class FortniteUI.AthenaPlayerTeamKillsBase
// Size: 0x2e0 (Inherited: 0x2d0)
struct UAthenaPlayerTeamKillsBase : UFortHUDElementWidget {
	struct UTextBlock* KillsText; // 0x2d0(0x08)
	struct UAthenaPlayerViewModel* PlayerVM; // 0x2d8(0x08)
};

// Class FortniteUI.AthenaPlayerVitalityBarBase
// Size: 0x270 (Inherited: 0x268)
struct UAthenaPlayerVitalityBarBase : UUserWidget {
	struct UAthenaPlayerViewModel* PlayerVM; // 0x268(0x08)

	void SetDataSource(struct UAthenaPlayerViewModel* PlayerViewModel); // Function FortniteUI.AthenaPlayerVitalityBarBase.SetDataSource // (Final|Native|Public|BlueprintCallable) // @ game+0x9d05d20
};

// Class FortniteUI.AthenaQuestActorIndicator
// Size: 0x388 (Inherited: 0x370)
struct UAthenaQuestActorIndicator : UFortActorIndicatorWidget {
	struct UImage* Image_QuestActorBrush; // 0x370(0x08)
	struct UFortQuestIconComponent* QuestIconComponent; // 0x378(0x08)
	char pad_380[0x8]; // 0x380(0x08)
};

// Class FortniteUI.AthenaQuickbarEditorBase
// Size: 0x2b8 (Inherited: 0x290)
struct UAthenaQuickbarEditorBase : UCommonUserWidget {
	struct UCommonButtonGroupBase* EquipButtonGroup; // 0x290(0x08)
	bool bCheckVisibilityBasedOffInventoryCapacity; // 0x298(0x01)
	enum class EFortQuickBars QuickbarIndex; // 0x299(0x01)
	char pad_29A[0x6]; // 0x29a(0x06)
	struct UAthenaQuickBarSlotButtonBase* QuickBarSlotButtonClass; // 0x2a0(0x08)
	int32_t FirstQuickBarSlotIndex; // 0x2a8(0x04)
	int32_t NumQuickBarSlots; // 0x2ac(0x04)
	char pad_2B0[0x8]; // 0x2b0(0x08)

	void SelectPreviousQuickBarSlot(bool bSetFocus); // Function FortniteUI.AthenaQuickbarEditorBase.SelectPreviousQuickBarSlot // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x9d05b20
	void SelectNextQuickBarSlot(bool bSetFocus); // Function FortniteUI.AthenaQuickbarEditorBase.SelectNextQuickBarSlot // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x9d05a74
	void OnQuickBarSlotButtonCreated(struct UAthenaQuickBarSlotButtonBase* QuickBarSlotButton); // Function FortniteUI.AthenaQuickbarEditorBase.OnQuickBarSlotButtonCreated // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	struct UWidget* GetFirstEquipSlotButton(); // Function FortniteUI.AthenaQuickbarEditorBase.GetFirstEquipSlotButton // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d04960
};

// Class FortniteUI.AthenaRebootCardIndicator
// Size: 0x5d0 (Inherited: 0x5c0)
struct UAthenaRebootCardIndicator : UAthenaMarkedActorIndicator {
	struct UCommonTextBlock* Text_PlayerName; // 0x5c0(0x08)
	struct UImage* Image_PlayerMarker; // 0x5c8(0x08)

	void SetupCountdown(float StartTimeLocalWorld, float EndTimeLocalWorld); // Function FortniteUI.AthenaRebootCardIndicator.SetupCountdown // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void HandleDisplayForSelf(bool bSelf); // Function FortniteUI.AthenaRebootCardIndicator.HandleDisplayForSelf // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
};

// Class FortniteUI.AthenaRebootChipDirective
// Size: 0x2f0 (Inherited: 0x2d0)
struct UAthenaRebootChipDirective : UFortHUDElementWidget {
	struct UAthenaPlayerViewModel* PlayerVM; // 0x2d0(0x08)
	struct TArray<struct AFortPlayerStateAthena*> RebootableAllies; // 0x2d8(0x10)
	char pad_2E8[0x8]; // 0x2e8(0x08)

	void UpdateSquadListDisplay(enum class EAthenaSquadListUpdateType UpdateType, struct AFortPlayerStateAthena* PS); // Function FortniteUI.AthenaRebootChipDirective.UpdateSquadListDisplay // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void HandleLocalPlayerDied(struct FFortPlayerDeathReport& DeathReport); // Function FortniteUI.AthenaRebootChipDirective.HandleLocalPlayerDied // (Final|Native|Protected|HasOutParms) // @ game+0x9d04b30
};

// Class FortniteUI.AthenaRebootVanIndicator
// Size: 0x5d0 (Inherited: 0x5c0)
struct UAthenaRebootVanIndicator : UAthenaMarkedActorIndicator {
	int32_t SpawnMachineIndex; // 0x5c0(0x04)
	enum class ESpawnMachineState SpawnMachineState; // 0x5c4(0x01)
	char pad_5C5[0x3]; // 0x5c5(0x03)
	float SpawnMachineCooldownStartTime; // 0x5c8(0x04)
	float SpawnMachineCooldownEndTime; // 0x5cc(0x04)

	void OnSpawnMachineStateChanged(); // Function FortniteUI.AthenaRebootVanIndicator.OnSpawnMachineStateChanged // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
};

// Class FortniteUI.AthenaRespawnBase
// Size: 0x2e8 (Inherited: 0x2d0)
struct UAthenaRespawnBase : UFortHUDElementWidget {
	enum class ERespawnUIState RespawnState; // 0x2d0(0x01)
	char pad_2D1[0x17]; // 0x2d1(0x17)

	void UpdateAllUI(); // Function FortniteUI.AthenaRespawnBase.UpdateAllUI // (Final|Native|Protected) // @ game+0x9d061fc
	void OnUpdateRespawnState(bool bEnabled); // Function FortniteUI.AthenaRespawnBase.OnUpdateRespawnState // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnUpdateLives(int32_t Lives); // Function FortniteUI.AthenaRespawnBase.OnUpdateLives // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnGamePhaseChanged(enum class EAthenaGamePhase GamePhase); // Function FortniteUI.AthenaRespawnBase.OnGamePhaseChanged // (Final|Native|Protected) // @ game+0x9d05504
};

// Class FortniteUI.AthenaScorePopWidgetBase
// Size: 0x2d0 (Inherited: 0x2d0)
struct UAthenaScorePopWidgetBase : UFortHUDElementWidget {

	void OnNewScoreEarned(int32_t NewScoreValue, struct FText& NewScoreTypeText, int32_t BigScoreThreshold); // Function FortniteUI.AthenaScorePopWidgetBase.OnNewScoreEarned // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xdef49c
	void HandleNewScoreEarned(int32_t NewPoints, enum class EAthenaScoringEvent ScoreType); // Function FortniteUI.AthenaScorePopWidgetBase.HandleNewScoreEarned // (Final|Native|Protected) // @ game+0x9d04c74
};

// Class FortniteUI.AthenaScrollBox
// Size: 0xbe0 (Inherited: 0xbc0)
struct UAthenaScrollBox : UScrollBox {
	char pad_BC0[0x18]; // 0xbc0(0x18)
	bool bEnableFixedPageOffset; // 0xbd8(0x01)
	bool bEnableClickThrough; // 0xbd9(0x01)
	char pad_BDA[0x6]; // 0xbda(0x06)
};

// Class FortniteUI.AthenaSeasonStatusWidget
// Size: 0x290 (Inherited: 0x290)
struct UAthenaSeasonStatusWidget : UCommonUserWidget {
};

// Class FortniteUI.AthenaSkewedTabButton
// Size: 0x1460 (Inherited: 0x1430)
struct UAthenaSkewedTabButton : UCommonButtonLegacy {
	struct UCommonLazyImage* LazyImage_Icon; // 0x1430(0x08)
	struct UCommonTextBlock* Text_Title; // 0x1438(0x08)
	struct UWidget* Widget_Bang; // 0x1440(0x08)
	struct FVector2D ImageSize_Mobile; // 0x1448(0x10)
	bool bUseMobileSize; // 0x1458(0x01)
	char pad_1459[0x7]; // 0x1459(0x07)
};

// Class FortniteUI.AthenaSkydivingInformation
// Size: 0x2f8 (Inherited: 0x2d0)
struct UAthenaSkydivingInformation : UFortHUDElementWidget {
	char pad_2D0[0x28]; // 0x2d0(0x28)

	void OnStartSkydive(); // Function FortniteUI.AthenaSkydivingInformation.OnStartSkydive // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnNewVerticalSpeed(float NewVerticalSpeed); // Function FortniteUI.AthenaSkydivingInformation.OnNewVerticalSpeed // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnNewRating(float NewRating); // Function FortniteUI.AthenaSkydivingInformation.OnNewRating // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnNewNormalizedPlayerAltitude(float NormalizedPlayerAltitude); // Function FortniteUI.AthenaSkydivingInformation.OnNewNormalizedPlayerAltitude // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnNewNormalizedOpeningAltitude(float NormalizedOpeningAltitude); // Function FortniteUI.AthenaSkydivingInformation.OnNewNormalizedOpeningAltitude // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnNewNormalizedGroundAltitude(float NormalizedGroundAltitude); // Function FortniteUI.AthenaSkydivingInformation.OnNewNormalizedGroundAltitude // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnNewHorizontalSpeed(float NewHorizontalSpeed); // Function FortniteUI.AthenaSkydivingInformation.OnNewHorizontalSpeed // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnNewGroundAltitude(float NewGroundAltitude); // Function FortniteUI.AthenaSkydivingInformation.OnNewGroundAltitude // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnNewDuration(float NewDuration); // Function FortniteUI.AthenaSkydivingInformation.OnNewDuration // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnNewCurrentAltitude(float NewCurrentAltitude); // Function FortniteUI.AthenaSkydivingInformation.OnNewCurrentAltitude // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnNewAltitude(float NewAltitude); // Function FortniteUI.AthenaSkydivingInformation.OnNewAltitude // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnExitSkydive(); // Function FortniteUI.AthenaSkydivingInformation.OnExitSkydive // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnEnterGlider(); // Function FortniteUI.AthenaSkydivingInformation.OnEnterGlider // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
};

// Class FortniteUI.AthenaSocialScreen
// Size: 0x4e8 (Inherited: 0x4e0)
struct UAthenaSocialScreen : UCommonActivatablePanelLegacy {
	struct UCommonButtonBase* Button_ViewCareer; // 0x4e0(0x08)

	void ShowCareerScreen(); // Function FortniteUI.AthenaSocialScreen.ShowCareerScreen // (Final|Native|Private|BlueprintCallable) // @ game+0x9d061e8
};

// Class FortniteUI.AthenaSquadIndicator
// Size: 0x748 (Inherited: 0x5c0)
struct UAthenaSquadIndicator : UAthenaMarkedActorIndicator {
	char pad_5C0[0x1c]; // 0x5c0(0x1c)
	float IndicatorWorldOffsetProperty; // 0x5dc(0x04)
	float IndicatorItemOffset; // 0x5e0(0x04)
	float IndicatorSpecialServerOffset; // 0x5e4(0x04)
	struct FVector2D SmallIndicatorScale; // 0x5e8(0x10)
	float WorldOffsetInterpValue; // 0x5f8(0x04)
	struct FName MIDParam_LocationColor; // 0x5fc(0x04)
	struct FName MIDParam_ItemIcon; // 0x600(0x04)
	struct FName MIDParam_ItemRarityColor; // 0x604(0x04)
	struct FName MIDParam_SquadCommsPingIcon; // 0x608(0x04)
	struct FName MIDParam_NPCCommandPingIconCrop; // 0x60c(0x04)
	struct UTexture2D* LoadingPlaceholder; // 0x610(0x08)
	struct FMarkerLargeIndicatorType LocationMarker; // 0x618(0x18)
	struct FMarkerLargeIndicatorType ItemMarker; // 0x630(0x18)
	struct FMarkerLargeIndicatorType DangerMarker; // 0x648(0x18)
	struct FMarkerLargeIndicatorType SpecialLocalMarker; // 0x660(0x18)
	struct FMarkerLargeIndicatorType SpecialServerMarker; // 0x678(0x18)
	struct FMarkerLargeIndicatorType SquadCommsMarker; // 0x690(0x18)
	struct UMaterialInterface* DefaultIconMaterial; // 0x6a8(0x08)
	struct UMaterialInterface* SquadCommsPingMaterial; // 0x6b0(0x08)
	char pad_6B8[0x28]; // 0x6b8(0x28)
	struct UImage* Image_SmallIndicator; // 0x6e0(0x08)
	struct UImage* Image_LocationFlare; // 0x6e8(0x08)
	struct UImage* Image_LargeIndicator; // 0x6f0(0x08)
	struct UWidgetAnimation* Anim_LocationPlaced; // 0x6f8(0x08)
	struct UWidgetAnimation* Anim_DangerPlaced; // 0x700(0x08)
	struct UWidgetAnimation* Anim_ItemPlaced; // 0x708(0x08)
	struct UWidgetAnimation* Anim_Hovered; // 0x710(0x08)
	struct UImage* Image_TrajectoryLargeIndicator; // 0x718(0x08)
	struct UImage* Image_TrajectorySmallIndicator; // 0x720(0x08)
	char pad_728[0x20]; // 0x728(0x20)

	void DangerTestStart(); // Function FortniteUI.AthenaSquadIndicator.DangerTestStart // (Final|Native|Protected) // @ game+0x9d0473c
	void DangerTestFinish(); // Function FortniteUI.AthenaSquadIndicator.DangerTestFinish // (Final|Native|Protected) // @ game+0x9d04728
};

// Class FortniteUI.AthenaSquadListBase
// Size: 0x488 (Inherited: 0x2d0)
struct UAthenaSquadListBase : UFortHUDElementWidget {
	char pad_2D0[0xd8]; // 0x2d0(0xd8)
	enum class ESlateVisibility LocalPlayerVisibility; // 0x3a8(0x01)
	char pad_3A9[0xf]; // 0x3a9(0x0f)
	struct UAthenaPlayerInfoBase* LocalPlayerInfo; // 0x3b8(0x08)
	struct UDynamicEntryBox* EntryBox_SquadList; // 0x3c0(0x08)
	struct UAthenaPlayerViewModel* CachedPlayerVM; // 0x3c8(0x08)
	struct TSet<enum class EUIExtensionSlot> RelevantExtensionSlots; // 0x3d0(0x50)
	char pad_420[0x18]; // 0x420(0x18)
	struct TSet<struct UUserWidget*> ActiveExtensionWidgets; // 0x438(0x50)

	void UpdateSquadFromMinigameOptionChange(); // Function FortniteUI.AthenaSquadListBase.UpdateSquadFromMinigameOptionChange // (Final|Native|Private) // @ game+0x9d06778
	void UpdateIsTeamMiniGameOnMinigameVolumeChanged(struct AFortVolume* Volume); // Function FortniteUI.AthenaSquadListBase.UpdateIsTeamMiniGameOnMinigameVolumeChanged // (Final|Native|Private) // @ game+0x9d062d4
	void UpdateIsTeamMiniGameOnGameStateChanged(struct AFortMinigame* Minigame, enum class EFortMinigameState MinigameState); // Function FortniteUI.AthenaSquadListBase.UpdateIsTeamMiniGameOnGameStateChanged // (Final|Native|Private) // @ game+0x9d06210
	void OnExtensionWidgetRemoved(struct UUserWidget* Widget); // Function FortniteUI.AthenaSquadListBase.OnExtensionWidgetRemoved // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnExtensionWidgetAdded(enum class EUIExtensionSlot SlotType, struct UUserWidget* Widget); // Function FortniteUI.AthenaSquadListBase.OnExtensionWidgetAdded // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void HandleSquadMemberDisconnected(struct AFortPlayerStateAthena* Player); // Function FortniteUI.AthenaSquadListBase.HandleSquadMemberDisconnected // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void HandlePlayerUniqueIdReplicated(struct FUniqueNetIdRepl& UniqueId); // Function FortniteUI.AthenaSquadListBase.HandlePlayerUniqueIdReplicated // (Final|Native|Private|HasOutParms) // @ game+0x9d04fcc
	void HandlePlayerExitVolume(struct APlayerState* Client, struct AFortVolume* Volume); // Function FortniteUI.AthenaSquadListBase.HandlePlayerExitVolume // (Final|Native|Private) // @ game+0x9d04ef4
	void HandlePlayerEnterVolume(struct APlayerState* Client, struct AFortVolume* Volume); // Function FortniteUI.AthenaSquadListBase.HandlePlayerEnterVolume // (Final|Native|Private) // @ game+0x9d04e30
	void HandleGameMemberChanged(char InSquadId, char InTeamIndex, struct AFortPlayerStateAthena* ChangedPS); // Function FortniteUI.AthenaSquadListBase.HandleGameMemberChanged // (Final|Native|Private) // @ game+0x9d049bc
};

// Class FortniteUI.AthenaStatsScreenBase
// Size: 0x6c8 (Inherited: 0x518)
struct UAthenaStatsScreenBase : UFortActivatablePanel {
	struct UCommonTabListWidgetBase* StatsTabList; // 0x518(0x08)
	struct UFortProfileStatsMainTile* WinsTile; // 0x520(0x08)
	struct UFortProfileStatsMainTile* SecondTierTile; // 0x528(0x08)
	struct UFortProfileStatsMainTile* ThirdTierTile; // 0x530(0x08)
	struct UFortProfileStatsRow* KillsRow; // 0x538(0x08)
	struct UFortProfileStatsRow* MatchesPlayedRow; // 0x540(0x08)
	struct UCommonTextBlock* LastUpdatedTime; // 0x548(0x08)
	struct UCommonTextBlock* PlayerName; // 0x550(0x08)
	struct UWidget* SeasonContainer; // 0x558(0x08)
	struct UWidget* AccountContainer; // 0x560(0x08)
	struct UWidget* MainStatsContainer; // 0x568(0x08)
	struct UCommonButtonBase* PlatformButton; // 0x570(0x08)
	struct UImage* Image_PlatformIcon; // 0x578(0x08)
	struct UCommonTextBlock* LTM_Disclaimer; // 0x580(0x08)
	struct UCommonButtonBase* Button_ChangeFlag; // 0x588(0x08)
	struct UFortFlagImage* Image_YourFlag; // 0x590(0x08)
	struct UFortFlagImage* Image_OtherUserFlag; // 0x598(0x08)
	struct UWidgetSwitcher* Switcher_FlagDisplay; // 0x5a0(0x08)
	bool bWasLastQuerySuccessful; // 0x5a8(0x01)
	char pad_5A9[0x7]; // 0x5a9(0x07)
	struct UDataTable* PlaylistsData; // 0x5b0(0x08)
	struct FName LTMPlaylistDefaultName; // 0x5b8(0x04)
	char pad_5BC[0x4]; // 0x5bc(0x04)
	struct UFortFlagSelectionModal* FortFlagSelectionModalClass; // 0x5c0(0x08)
	struct FText PlatformButtonDisplayText; // 0x5c8(0x18)
	char pad_5E0[0xd0]; // 0x5e0(0xd0)
	struct USocialUser* QueriedSocialUser; // 0x6b0(0x08)
	char pad_6B8[0x10]; // 0x6b8(0x10)

	void SetPlatformButtonText(struct FText& PlatformButtonText); // Function FortniteUI.AthenaStatsScreenBase.SetPlatformButtonText // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0xdef49c
	void SetDisplayName(struct FText InDisplayName); // Function FortniteUI.AthenaStatsScreenBase.SetDisplayName // (Final|Native|Public|BlueprintCallable) // @ game+0x9d05da0
	void SetAccountIdToQueryFromString(struct FString InAccountId); // Function FortniteUI.AthenaStatsScreenBase.SetAccountIdToQueryFromString // (Final|Native|Public|BlueprintCallable) // @ game+0x9d05bcc
	void OnTabSelected(struct FName TabName); // Function FortniteUI.AthenaStatsScreenBase.OnTabSelected // (Final|Native|Public|BlueprintCallable) // @ game+0x9d05870
	void OnQueryStarted(); // Function FortniteUI.AthenaStatsScreenBase.OnQueryStarted // (Event|Public|BlueprintEvent) // @ game+0xdef49c
	void OnQueryFinished(bool bWasSuccessful, bool bHasStatsToDisplay); // Function FortniteUI.AthenaStatsScreenBase.OnQueryFinished // (Event|Public|BlueprintEvent) // @ game+0xdef49c
	void DisplayQueriedUserPlatformProfile(); // Function FortniteUI.AthenaStatsScreenBase.DisplayQueriedUserPlatformProfile // (Final|Native|Public|BlueprintCallable) // @ game+0x9d04750
};

// Class FortniteUI.AthenaStormSurgeWarningBase
// Size: 0x318 (Inherited: 0x2d0)
struct UAthenaStormSurgeWarningBase : UFortHUDElementWidget {
	char pad_2D0[0x40]; // 0x2d0(0x40)
	struct FFortPrioritizedWidgetData PrioritizationData; // 0x310(0x02)
	char pad_312[0x6]; // 0x312(0x06)

	void OnStormCapStateChanged(enum class EAthenaStormCapState StormCapState); // Function FortniteUI.AthenaStormSurgeWarningBase.OnStormCapStateChanged // (Final|Native|Protected) // @ game+0x9d05774
	void OnStopDisplaying(); // Function FortniteUI.AthenaStormSurgeWarningBase.OnStopDisplaying // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnStartDisplaying(struct FText& TitleText, struct FText& SubTitleText, bool bDisplaySubtitle, bool bPlayDamageActiveSound); // Function FortniteUI.AthenaStormSurgeWarningBase.OnStartDisplaying // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xdef49c
};

// Class FortniteUI.AthenaStormSurgeWidgetBase
// Size: 0x2e8 (Inherited: 0x2d0)
struct UAthenaStormSurgeWidgetBase : UFortHUDElementWidget {
	char pad_2D0[0x18]; // 0x2d0(0x18)

	void UpdateUI(); // Function FortniteUI.AthenaStormSurgeWidgetBase.UpdateUI // (Final|Native|Protected|BlueprintCallable) // @ game+0x292df2c
	void OnUpdateThresholdDisplay(struct FText& ThresholdText, enum class EStormSurgeThresholdType ThresholdType); // Function FortniteUI.AthenaStormSurgeWidgetBase.OnUpdateThresholdDisplay // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xdef49c
	void OnStormCapStateChanged(enum class EAthenaStormCapState StormCapState); // Function FortniteUI.AthenaStormSurgeWidgetBase.OnStormCapStateChanged // (Final|Native|Protected) // @ game+0x9d057f4
	void OnStopDisplaying(); // Function FortniteUI.AthenaStormSurgeWidgetBase.OnStopDisplaying // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnStartDisplaying(struct FText& TitleText); // Function FortniteUI.AthenaStormSurgeWidgetBase.OnStartDisplaying // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xdef49c
};

// Class FortniteUI.AthenaTeamAliveCountBase
// Size: 0x2e8 (Inherited: 0x2d0)
struct UAthenaTeamAliveCountBase : UFortHUDElementWidget {
	char pad_2D0[0x18]; // 0x2d0(0x18)

	void SetTeamSlotData(int32_t TeamIdx, struct FAthenaTeamCountSlotData& TeamSlotData); // Function FortniteUI.AthenaTeamAliveCountBase.SetTeamSlotData // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0xdef49c
};

// Class FortniteUI.AthenaTeamScoreWidgetBase
// Size: 0x2f8 (Inherited: 0x2d0)
struct UAthenaTeamScoreWidgetBase : UFortHUDElementWidget {
	struct AFortPlayerStateAthena* CurrPlayerState; // 0x2d0(0x08)
	int32_t GoalScore; // 0x2d8(0x04)
	int32_t PreviousScore; // 0x2dc(0x04)
	int32_t PreviousScorePlacement; // 0x2e0(0x04)
	int32_t PreviousDeltaScore; // 0x2e4(0x04)
	bool bPreviousIsWinner; // 0x2e8(0x01)
	bool bPreviousHasScore; // 0x2e9(0x01)
	char pad_2EA[0xe]; // 0x2ea(0x0e)

	void OnScoreChanged(int32_t Score); // Function FortniteUI.AthenaTeamScoreWidgetBase.OnScoreChanged // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnPlacementChanged(int32_t Placement); // Function FortniteUI.AthenaTeamScoreWidgetBase.OnPlacementChanged // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnLeaderboardChanged(int32_t ScoreDelta, bool bIsWinner, bool bHasScore); // Function FortniteUI.AthenaTeamScoreWidgetBase.OnLeaderboardChanged // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void HandleUpdate(); // Function FortniteUI.AthenaTeamScoreWidgetBase.HandleUpdate // (Final|Native|Protected) // @ game+0x9d05314
	void HandleSpectatingChanged(struct AFortPlayerStateZone* SpectatingTarget); // Function FortniteUI.AthenaTeamScoreWidgetBase.HandleSpectatingChanged // (Final|Native|Protected) // @ game+0x9d05214
	void HandleScoreChanged(int32_t Score); // Function FortniteUI.AthenaTeamScoreWidgetBase.HandleScoreChanged // (Final|Native|Protected) // @ game+0x9d05198
};

// Class FortniteUI.AthenaTimeWidgetBase
// Size: 0x2f8 (Inherited: 0x2d0)
struct UAthenaTimeWidgetBase : UFortHUDElementWidget {
	struct FTimerHandle UpdateTimerHandle; // 0x2d0(0x08)
	struct FText CachedDisplayText; // 0x2d8(0x18)
	struct FName CachedDisplayTextStyle; // 0x2f0(0x04)
	bool bIsDisplaying; // 0x2f4(0x01)
	char pad_2F5[0x3]; // 0x2f5(0x03)

	void UpdateTimeText(); // Function FortniteUI.AthenaTimeWidgetBase.UpdateTimeText // (Final|Native|Protected) // @ game+0x9d0678c
	void UpdateDisplay(struct FText& DisplayText, struct FName& DisplayTextStyle); // Function FortniteUI.AthenaTimeWidgetBase.UpdateDisplay // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xdef49c
	void OnTimerWidgetActorUpdated(struct AActor* TimerWidgetActor); // Function FortniteUI.AthenaTimeWidgetBase.OnTimerWidgetActorUpdated // (Final|Native|Protected) // @ game+0x9d058f0
	void OnStopTimeDisplay(); // Function FortniteUI.AthenaTimeWidgetBase.OnStopTimeDisplay // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnStartTimeDisplay(); // Function FortniteUI.AthenaTimeWidgetBase.OnStartTimeDisplay // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnMinigameStarted(); // Function FortniteUI.AthenaTimeWidgetBase.OnMinigameStarted // (Native|Event|Protected|BlueprintEvent) // @ game+0x8240210
	void OnMinigameEnded(); // Function FortniteUI.AthenaTimeWidgetBase.OnMinigameEnded // (Native|Event|Protected|BlueprintEvent) // @ game+0x9d05698
	void OnGamePhaseStepChanged(struct TScriptInterface<IFortSafeZoneInterface>& SafeZoneInterface, enum class EAthenaGamePhaseStep GamePhaseStep); // Function FortniteUI.AthenaTimeWidgetBase.OnGamePhaseStepChanged // (Final|Native|Protected|HasOutParms) // @ game+0xd8c798
	void OnGamePhaseChanged(enum class EAthenaGamePhase GamePhase); // Function FortniteUI.AthenaTimeWidgetBase.OnGamePhaseChanged // (Final|Native|Protected) // @ game+0x2a6e810
	bool IsTextStyleValid(struct FName& DisplayTextStyle); // Function FortniteUI.AthenaTimeWidgetBase.IsTextStyleValid // (Native|Event|Protected|HasOutParms|BlueprintEvent) // @ game+0x9d05328
	void ClientEnteredVolume(struct APlayerState* PlayerState, struct AFortVolume* FortVolume); // Function FortniteUI.AthenaTimeWidgetBase.ClientEnteredVolume // (Final|Native|Protected) // @ game+0x9d04574
};

// Class FortniteUI.AthenaTravelLogFormatting
// Size: 0x28 (Inherited: 0x28)
struct UAthenaTravelLogFormatting : UBlueprintFunctionLibrary {

	bool ShouldDisplayText(struct FAthenaTravelLogEntry& Entry); // Function FortniteUI.AthenaTravelLogFormatting.ShouldDisplayText // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x9d06110
	bool IsTravelLogTextDisplayEnabled(); // Function FortniteUI.AthenaTravelLogFormatting.IsTravelLogTextDisplayEnabled // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9d053c8
	struct FText FormatTravelLogEntry(struct UObject* WorldContextObject, struct FAthenaTravelLogEntry& Entry); // Function FortniteUI.AthenaTravelLogFormatting.FormatTravelLogEntry // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x9d047fc
};

// Class FortniteUI.AthenaTrickFeedBase
// Size: 0x2f8 (Inherited: 0x2d0)
struct UAthenaTrickFeedBase : UFortHUDElementWidget {
	char pad_2D0[0x28]; // 0x2d0(0x28)

	void UpdateTrickStats(struct FText& StatsText); // Function FortniteUI.AthenaTrickFeedBase.UpdateTrickStats // (Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xdef49c
	void UpdateScore(struct UFortVehicleTrickSet* TrickSet, int32_t TotalScore); // Function FortniteUI.AthenaTrickFeedBase.UpdateScore // (Event|Protected|BlueprintCallable|BlueprintEvent) // @ game+0xdef49c
	void UpdateMultiplier(int32_t Multiplier); // Function FortniteUI.AthenaTrickFeedBase.UpdateMultiplier // (Event|Protected|BlueprintCallable|BlueprintEvent) // @ game+0xdef49c
	void TrickSequenceStarted(); // Function FortniteUI.AthenaTrickFeedBase.TrickSequenceStarted // (Event|Protected|BlueprintCallable|BlueprintEvent) // @ game+0xdef49c
	void TrickSequenceFailed(); // Function FortniteUI.AthenaTrickFeedBase.TrickSequenceFailed // (Event|Protected|BlueprintCallable|BlueprintEvent) // @ game+0xdef49c
	void TrickSequenceComplete(); // Function FortniteUI.AthenaTrickFeedBase.TrickSequenceComplete // (Event|Protected|BlueprintCallable|BlueprintEvent) // @ game+0xdef49c
	void TrickSequenceCanceled(); // Function FortniteUI.AthenaTrickFeedBase.TrickSequenceCanceled // (Event|Protected|BlueprintCallable|BlueprintEvent) // @ game+0xdef49c
	void RequestNextSequence(); // Function FortniteUI.AthenaTrickFeedBase.RequestNextSequence // (Final|Native|Protected|BlueprintCallable) // @ game+0x9d05a4c
	void AddTrick(struct FText& TrickName); // Function FortniteUI.AthenaTrickFeedBase.AddTrick // (Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xdef49c
};

// Class FortniteUI.AthenaViewStreamingReplayModalBase
// Size: 0x520 (Inherited: 0x518)
struct UAthenaViewStreamingReplayModalBase : UFortActivatablePanel {
	struct UEditableText* EditableText_SessionSearch; // 0x518(0x08)

	void PlayStreamingDSSReplay(struct FString GameSessionId); // Function FortniteUI.AthenaViewStreamingReplayModalBase.PlayStreamingDSSReplay // (Final|Native|Protected|BlueprintCallable|Const) // @ game+0x9d3d5c8
	bool IsValidGameSessionId(struct FString GameSessionId); // Function FortniteUI.AthenaViewStreamingReplayModalBase.IsValidGameSessionId // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d3d04c
};

// Class FortniteUI.AthenaVisitedAreaDisplay
// Size: 0x330 (Inherited: 0x328)
struct UAthenaVisitedAreaDisplay : UAthenaDiscoverabilityBase {
	struct UCommonTextBlock* CommonTextBlock_AvailableChallenges; // 0x328(0x08)

	void OnNewVisited(struct FText& LocalizedLocationName, bool bIsNamedLocation); // Function FortniteUI.AthenaVisitedAreaDisplay.OnNewVisited // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xdef49c
	void HandleNewContextualObjectives(struct TArray<struct UFortQuestItem*>& ContextualQuests); // Function FortniteUI.AthenaVisitedAreaDisplay.HandleNewContextualObjectives // (Final|Native|Protected|HasOutParms) // @ game+0x9d3bf60
	void HandleContextualObjectivesInvalidated(); // Function FortniteUI.AthenaVisitedAreaDisplay.HandleContextualObjectivesInvalidated // (Final|Native|Protected) // @ game+0x9d3b894
};

// Class FortniteUI.AthenaWatchers
// Size: 0x2e0 (Inherited: 0x2d0)
struct UAthenaWatchers : UFortHUDElementWidget {
	struct UTextBlock* Text_Watchers; // 0x2d0(0x08)
	char pad_2D8[0x8]; // 0x2d8(0x08)

	void SpectatorsEnded(); // Function FortniteUI.AthenaWatchers.SpectatorsEnded // (Event|Public|BlueprintEvent) // @ game+0xdef49c
	void SpectatorsBegan(bool bBigGroup); // Function FortniteUI.AthenaWatchers.SpectatorsBegan // (Event|Public|BlueprintEvent) // @ game+0xdef49c
	void SpectatorsAdded(bool bBigGroup); // Function FortniteUI.AthenaWatchers.SpectatorsAdded // (Event|Public|BlueprintEvent) // @ game+0xdef49c
	void SpectatorRemoved(); // Function FortniteUI.AthenaWatchers.SpectatorRemoved // (Event|Public|BlueprintEvent) // @ game+0xdef49c
	void SpectatorCountChanged_BP(int32_t NewCount); // Function FortniteUI.AthenaWatchers.SpectatorCountChanged_BP // (Event|Public|BlueprintEvent) // @ game+0xdef49c
	void HandleSpectatorCountChanged(int32_t NewSpectatorCount); // Function FortniteUI.AthenaWatchers.HandleSpectatorCountChanged // (Final|Native|Protected) // @ game+0x9d3cb9c
};

// Class FortniteUI.AthenaWidgetLibrary
// Size: 0x28 (Inherited: 0x28)
struct UAthenaWidgetLibrary : UBlueprintFunctionLibrary {

	bool IsPlayingReplay(struct UObject* WorldContextObject); // Function FortniteUI.AthenaWidgetLibrary.IsPlayingReplay // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9d3cf9c
	struct APlayerState* GetRelevantPlayerState(struct APlayerController* PlayerController); // Function FortniteUI.AthenaWidgetLibrary.GetRelevantPlayerState // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9d3b640
};

// Class FortniteUI.AthenaWinConditionMsgBase
// Size: 0x348 (Inherited: 0x2d0)
struct UAthenaWinConditionMsgBase : UFortHUDElementWidget {
	char pad_2D0[0x70]; // 0x2d0(0x70)
	struct FFortPrioritizedWidgetData PrioritizedWidgetData; // 0x340(0x02)
	char pad_342[0x6]; // 0x342(0x06)

	void OnShowHUDMessage(struct FHUDMessageData MessageData); // Function FortniteUI.AthenaWinConditionMsgBase.OnShowHUDMessage // (Final|Native|Protected) // @ game+0x9d3d4a8
	void HandleSpatialLoadingStateChanged(enum class ESpatialLoadingState NewState, struct AFortVolume* Volume); // Function FortniteUI.AthenaWinConditionMsgBase.HandleSpatialLoadingStateChanged // (Final|Native|Protected) // @ game+0x9d3c938
	void HandlePlaylistInitialized(); // Function FortniteUI.AthenaWinConditionMsgBase.HandlePlaylistInitialized // (Final|Native|Protected) // @ game+0x9d3c6b4
	void HandleMinigameEnded(); // Function FortniteUI.AthenaWinConditionMsgBase.HandleMinigameEnded // (Final|Native|Protected) // @ game+0x9d3befc
	void HandleGameStateInitialized(struct AFortGameState* GameState); // Function FortniteUI.AthenaWinConditionMsgBase.HandleGameStateInitialized // (Final|Native|Protected) // @ game+0x9d3be7c
	void HandleExitVolume(struct APlayerState* ClientState, struct AFortVolume* Volume); // Function FortniteUI.AthenaWinConditionMsgBase.HandleExitVolume // (Final|Native|Protected) // @ game+0x9d3bb68
	void HandleEnteredVolume(struct APlayerState* ClientState, struct AFortVolume* Volume); // Function FortniteUI.AthenaWinConditionMsgBase.HandleEnteredVolume // (Final|Native|Protected) // @ game+0x9d3b934
	struct FSlateColor GetTextFillColor(struct FRichTextStyleRow& Row); // Function FortniteUI.AthenaWinConditionMsgBase.GetTextFillColor // (Final|Native|Protected|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d3b754
	void BP_OnShowHUDMessage(struct FHUDMessageData MessageData); // Function FortniteUI.AthenaWinConditionMsgBase.BP_OnShowHUDMessage // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void BP_OnMinigameEnded(); // Function FortniteUI.AthenaWinConditionMsgBase.BP_OnMinigameEnded // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void BP_OnGameStateInitialized(struct AFortGameState* GameState); // Function FortniteUI.AthenaWinConditionMsgBase.BP_OnGameStateInitialized // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void BindVolumeManagerEvents(); // Function FortniteUI.AthenaWinConditionMsgBase.BindVolumeManagerEvents // (Final|Native|Protected) // @ game+0x9d3b360
};

// Class FortniteUI.AthenaWinnerDialogCN
// Size: 0x290 (Inherited: 0x290)
struct UAthenaWinnerDialogCN : UCommonUserWidget {

	void OnWinnerLeavingGame(); // Function FortniteUI.AthenaWinnerDialogCN.OnWinnerLeavingGame // (Final|Native|Public|BlueprintCallable) // @ game+0x9d3d598
	void OnWinConditionWasMet(); // Function FortniteUI.AthenaWinnerDialogCN.OnWinConditionWasMet // (Final|Native|Public) // @ game+0x9d3d550
	void OnOpenMessage(); // Function FortniteUI.AthenaWinnerDialogCN.OnOpenMessage // (Event|Public|BlueprintEvent) // @ game+0xdef49c
};

// Class FortniteUI.AthenaZebulonDroneWidgetBase
// Size: 0x2d0 (Inherited: 0x2d0)
struct UAthenaZebulonDroneWidgetBase : UFortHUDElementWidget {

	void OnGameStateSet(struct AFortGameState* InGameState); // Function FortniteUI.AthenaZebulonDroneWidgetBase.OnGameStateSet // (Final|Native|Protected) // @ game+0x9d3d310
	void OnGamePhaseStepChanged(enum class EAthenaGamePhaseStep GamePhaseStep); // Function FortniteUI.AthenaZebulonDroneWidgetBase.OnGamePhaseStepChanged // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void HandleGamePhaseStepChanged(struct TScriptInterface<IFortSafeZoneInterface>& SafeZoneInterface, enum class EAthenaGamePhaseStep GamePhaseStep); // Function FortniteUI.AthenaZebulonDroneWidgetBase.HandleGamePhaseStepChanged // (Final|Native|Protected|HasOutParms) // @ game+0x9d3bd9c
};

// Class FortniteUI.AthenaChallengeCountdownDisplay
// Size: 0x388 (Inherited: 0x268)
struct UAthenaChallengeCountdownDisplay : UUserWidget {
	char pad_268[0x10]; // 0x268(0x10)
	struct FDateTime UnlockTime; // 0x278(0x08)
	enum class ECountdownDisplay DisplayType; // 0x280(0x01)
	char pad_281[0x7]; // 0x281(0x07)
	struct FTimerDisplayData DisplayData[0x4]; // 0x288(0xe0)
	char pad_368[0x18]; // 0x368(0x18)
	struct UCommonTextBlock* Text_TimeRemaining; // 0x380(0x08)

	void OnChallengeSet(struct FTimerDisplayData& DisplayStyle); // Function FortniteUI.AthenaChallengeCountdownDisplay.OnChallengeSet // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0xdef49c
};

// Class FortniteUI.AthenaChallengeDateTimeTextBlock
// Size: 0x3a0 (Inherited: 0x3a0)
struct UAthenaChallengeDateTimeTextBlock : UCommonDateTimeTextBlock {
};

// Class FortniteUI.AthenaChallengeDetailBase
// Size: 0x2a0 (Inherited: 0x290)
struct UAthenaChallengeDetailBase : UCommonUserWidget {
	struct UFortItemBaseWidget* ItemInfo_PreviewedItem; // 0x290(0x08)
	struct USizeBox* SB_MainContent; // 0x298(0x08)
};

// Class FortniteUI.AthenaChallengeDisplayData
// Size: 0x1c8 (Inherited: 0x30)
struct UAthenaChallengeDisplayData : UDataAsset {
	int32_t SoonDisplayMinuteThreshold; // 0x30(0x04)
	struct FLinearColor PartyAssistFontColor; // 0x34(0x10)
	struct FLinearColor DifficultChallengeFontColor; // 0x44(0x10)
	char pad_54[0x4]; // 0x54(0x04)
	struct UTexture2D* PartyAssistIcon; // 0x58(0x08)
	struct UTexture2D* ExternalPartyAssistIcon; // 0x60(0x08)
	struct FFortChallengeSetStyle DefaultChallengeStyle; // 0x68(0xa0)
	struct FFortChallengeSetStyle DailyChallengeStyle; // 0x108(0xa0)
	struct TArray<struct FGameplayTagContainer> PunchCardSortOrder; // 0x1a8(0x10)
	struct TArray<struct FFortChallengePunchCardStyles> ChallengePunchCardStyles; // 0x1b8(0x10)
};

// Class FortniteUI.AthenaChallengeDisplayLibrary
// Size: 0x28 (Inherited: 0x28)
struct UAthenaChallengeDisplayLibrary : UBlueprintFunctionLibrary {

	struct FLinearColor GetChallengeStyleLightAccentColor(struct FFortChallengeSetStyle& DisplayStyle); // Function FortniteUI.AthenaChallengeDisplayLibrary.GetChallengeStyleLightAccentColor // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x9d3b498
	void ApplyChallengeSetStyleColorsToMaterial(struct FFortChallengeSetStyle& DisplayStyle, struct UMaterialInstanceDynamic* StyleMaterial); // Function FortniteUI.AthenaChallengeDisplayLibrary.ApplyChallengeSetStyleColorsToMaterial // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9d3b260
	void ApplyChallengeSetStyleColorsToImageMaterial(struct FFortChallengeSetStyle& DisplayStyle, struct UImage* ImageWidget); // Function FortniteUI.AthenaChallengeDisplayLibrary.ApplyChallengeSetStyleColorsToImageMaterial // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9d3b160
};

// Class FortniteUI.ImageGridObject
// Size: 0x40 (Inherited: 0x28)
struct UImageGridObject : UObject {
	int32_t GridLocation; // 0x28(0x04)
	char pad_2C[0x4]; // 0x2c(0x04)
	struct UFortChallengeBundleItemDefinition* BundleData; // 0x30(0x08)
	struct UFortQuestItem* QuestItem; // 0x38(0x08)
};

// Class FortniteUI.AthenaChallengeImageGridEntry
// Size: 0x1480 (Inherited: 0x1430)
struct UAthenaChallengeImageGridEntry : UCommonButtonLegacy {
	char pad_1430[0x18]; // 0x1430(0x18)
	struct UCommonLazyImage* Image_Brush; // 0x1448(0x08)
	bool bSelected; // 0x1450(0x01)
	char pad_1451[0x3]; // 0x1451(0x03)
	int32_t GridLocation; // 0x1454(0x04)
	int32_t Column; // 0x1458(0x04)
	int32_t Row; // 0x145c(0x04)
	char pad_1460[0x20]; // 0x1460(0x20)

	void TransitionFromOwnedToCompletedState(); // Function FortniteUI.AthenaChallengeImageGridEntry.TransitionFromOwnedToCompletedState // (Event|Public|BlueprintEvent) // @ game+0xdef49c
	void TransitionFromLockedToOwnedState(); // Function FortniteUI.AthenaChallengeImageGridEntry.TransitionFromLockedToOwnedState // (Event|Public|BlueprintEvent) // @ game+0xdef49c
	void SetupLockedToOwnState(); // Function FortniteUI.AthenaChallengeImageGridEntry.SetupLockedToOwnState // (Event|Public|BlueprintEvent) // @ game+0xdef49c
	void OnChallengeSet(bool bIsComplete, bool bIsLocked); // Function FortniteUI.AthenaChallengeImageGridEntry.OnChallengeSet // (Event|Public|BlueprintEvent) // @ game+0xdef49c
};

// Class FortniteUI.AthenaChallengeInviteFriendPrompt
// Size: 0x270 (Inherited: 0x268)
struct UAthenaChallengeInviteFriendPrompt : UUserWidget {
	struct URichTextBlock* RichText_InviteFriendMessage; // 0x268(0x08)
};

// Class FortniteUI.AthenaChallengeRewardDisplayEntry
// Size: 0x278 (Inherited: 0x268)
struct UAthenaChallengeRewardDisplayEntry : UUserWidget {
	struct UFortLazyImage* LazyImage_RewardIcon; // 0x268(0x08)
	struct UCommonTextBlock* Text_RewardQuantity; // 0x270(0x08)
};

// Class FortniteUI.AthenaChallengeRewardDisplay
// Size: 0x278 (Inherited: 0x268)
struct UAthenaChallengeRewardDisplay : UUserWidget {
	struct UDynamicEntryBox* EntryBox_Rewards; // 0x268(0x08)
	struct UImage* Image_CompletionIcon; // 0x270(0x08)
};

// Class FortniteUI.AthenaChallengeListEntryBase
// Size: 0x2a8 (Inherited: 0x290)
struct UAthenaChallengeListEntryBase : UCommonUserWidget {
	char pad_290[0x18]; // 0x290(0x18)

	void StartHighlight(); // Function FortniteUI.AthenaChallengeListEntryBase.StartHighlight // (Event|Public|BlueprintEvent) // @ game+0xdef49c
	void EndHighlight(); // Function FortniteUI.AthenaChallengeListEntryBase.EndHighlight // (Event|Public|BlueprintEvent) // @ game+0xdef49c
	void BP_OnChallengeInfoSet(bool bDisabled); // Function FortniteUI.AthenaChallengeListEntryBase.BP_OnChallengeInfoSet // (Event|Public|BlueprintEvent) // @ game+0xdef49c
};

// Class FortniteUI.AthenaChallengeTreeEntry_ChallengeSet
// Size: 0x2d0 (Inherited: 0x2a8)
struct UAthenaChallengeTreeEntry_ChallengeSet : UAthenaChallengeListEntryBase {
	char pad_2A8[0x10]; // 0x2a8(0x10)
	struct UCommonTextBlock* Text_ChallengeSetName; // 0x2b8(0x08)
	struct UCommonTextBlock* Text_ChallengeSetContext; // 0x2c0(0x08)
	struct UCommonTextBlock* Text_PercentComplete; // 0x2c8(0x08)

	void OnChallengeSetEstablished(struct FFortChallengeSetStyle& DisplayStyle); // Function FortniteUI.AthenaChallengeTreeEntry_ChallengeSet.OnChallengeSetEstablished // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xdef49c
};

// Class FortniteUI.AthenaChallengeListEntry_Challenge
// Size: 0x2d0 (Inherited: 0x2a8)
struct UAthenaChallengeListEntry_Challenge : UAthenaChallengeListEntryBase {
	char pad_2A8[0x10]; // 0x2a8(0x10)
	bool bHideProgressBar; // 0x2b8(0x01)
	char pad_2B9[0x7]; // 0x2b9(0x07)
	struct UCommonRichTextBlock* RichText_ChallengeDesc; // 0x2c0(0x08)
	struct UAthenaChallengeProgressBar* ChallengeProgress_ObjectivesCompleted; // 0x2c8(0x08)

	void OnPartyAssistEnabledChanged(bool bIsPartyAssistEnabled); // Function FortniteUI.AthenaChallengeListEntry_Challenge.OnPartyAssistEnabledChanged // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnChallengeInfoSet(bool bIsComplete, bool bIsLocked, bool bIsGroupChallenge, bool bCompact, bool HideRewards); // Function FortniteUI.AthenaChallengeListEntry_Challenge.OnChallengeInfoSet // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	int32_t GetChallengeWeight(); // Function FortniteUI.AthenaChallengeListEntry_Challenge.GetChallengeWeight // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d3b5cc
	void BP_HandleIsTrackedChallengeChanged(bool bIsTrackedChallenge); // Function FortniteUI.AthenaChallengeListEntry_Challenge.BP_HandleIsTrackedChallengeChanged // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
};

// Class FortniteUI.AthenaChallengeListEntry_DetailedChallenge
// Size: 0x338 (Inherited: 0x2d0)
struct UAthenaChallengeListEntry_DetailedChallenge : UAthenaChallengeListEntry_Challenge {
	char pad_2D0[0x10]; // 0x2d0(0x10)
	bool bHasAnyOptionsAvailable; // 0x2e0(0x01)
	bool bIsDisplayingChallengeActions; // 0x2e1(0x01)
	char pad_2E2[0x6]; // 0x2e2(0x06)
	struct FDataTableRowHandle BackAction; // 0x2e8(0x10)
	struct FDataTableRowHandle CloseChallengeOptionsAction; // 0x2f8(0x10)
	struct UWidgetAnimation* BoundAnim_ShowChallengeOptions; // 0x308(0x08)
	struct UButton* SimpleButton_TopClickArea; // 0x310(0x08)
	struct UAthenaChallengeRewardDisplay* Reward_QuestReward; // 0x318(0x08)
	struct UCommonButtonLegacy* Button_PartyAssist; // 0x320(0x08)
	struct UCommonButtonLegacy* Button_ReplaceChallenge; // 0x328(0x08)
	struct UCommonRichTextBlock* RichText_ActionInfo; // 0x330(0x08)

	void HandleUpperAreaClicked(); // Function FortniteUI.AthenaChallengeListEntry_DetailedChallenge.HandleUpperAreaClicked // (Final|Native|Private) // @ game+0x9d3cf30
	void HandleCloseChallengeOptionsInputAction(bool& bPassThrough); // Function FortniteUI.AthenaChallengeListEntry_DetailedChallenge.HandleCloseChallengeOptionsInputAction // (Final|Native|Private|HasOutParms) // @ game+0x9d3b814
};

// Class FortniteUI.AthenaChallengeListEntry_Header
// Size: 0x2b0 (Inherited: 0x2a8)
struct UAthenaChallengeListEntry_Header : UAthenaChallengeListEntryBase {
	struct UCommonTextBlock* Text_SectionTitle; // 0x2a8(0x08)

	void OnSectionTypeSet(enum class EChallengeListSection SectionType); // Function FortniteUI.AthenaChallengeListEntry_Header.OnSectionTypeSet // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
};

// Class FortniteUI.AthenaChallengeListEntry_CompletionReward
// Size: 0x2c0 (Inherited: 0x2a8)
struct UAthenaChallengeListEntry_CompletionReward : UAthenaChallengeListEntryBase {
	struct UAthenaChallengeRewardDisplay* Reward_CompletionReward; // 0x2a8(0x08)
	struct UCommonRichTextBlock* RichText_Description; // 0x2b0(0x08)
	struct UAthenaChallengeProgressBar* ChallengeProgress_ObjectivesCompleted; // 0x2b8(0x08)

	void OnRewardInfoSet(bool bIsCompleted, struct FFortChallengeSetStyle& DisplayStyle); // Function FortniteUI.AthenaChallengeListEntry_CompletionReward.OnRewardInfoSet // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xdef49c
};

// Class FortniteUI.AthenaChallengeListEntry_StoreOffer
// Size: 0x2f0 (Inherited: 0x2a8)
struct UAthenaChallengeListEntry_StoreOffer : UAthenaChallengeListEntryBase {
	struct TSoftClassPtr<UObject> OfferDetailsWidgetClass; // 0x2a8(0x28)
	struct UFortStoreFrontOfferInfo* OfferInfo; // 0x2d0(0x08)
	struct UButton* SimpleButton_ClickArea; // 0x2d8(0x08)
	struct UCommonRichTextBlock* RichText_Description; // 0x2e0(0x08)
	struct UFortLazyImage* LazyImage_SpecialOffer; // 0x2e8(0x08)

	void OnOfferSet(); // Function FortniteUI.AthenaChallengeListEntry_StoreOffer.OnOfferSet // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void HandleClicked(); // Function FortniteUI.AthenaChallengeListEntry_StoreOffer.HandleClicked // (Final|Native|Protected) // @ game+0x9d3b800
};

// Class FortniteUI.AthenaChallengeListEntry_Custom
// Size: 0x2b0 (Inherited: 0x2a8)
struct UAthenaChallengeListEntry_Custom : UAthenaChallengeListEntryBase {
	struct URichTextBlock* RichTextBlock_DisplayText; // 0x2a8(0x08)
};

// Class FortniteUI.AthenaChallengeListEntry_PartyUp
// Size: 0x2a8 (Inherited: 0x2a8)
struct UAthenaChallengeListEntry_PartyUp : UAthenaChallengeListEntryBase {

	void HandleTransientQuestStarted(struct UFortQuestItem* QuestItem, struct UFortQuestItemDefinition_Athena* PreceedingQuestDefAthena); // Function FortniteUI.AthenaChallengeListEntry_PartyUp.HandleTransientQuestStarted // (Final|Native|Private) // @ game+0x9d3cdb0
	void HandleTransientQuestRemoved(struct UFortQuestItem* QuestItem); // Function FortniteUI.AthenaChallengeListEntry_PartyUp.HandleTransientQuestRemoved // (Final|Native|Private) // @ game+0x9d3ccb0
};

// Class FortniteUI.AthenaChallengeListEntry_AllQuestsComplete
// Size: 0x2a8 (Inherited: 0x2a8)
struct UAthenaChallengeListEntry_AllQuestsComplete : UAthenaChallengeListEntryBase {
};

// Class FortniteUI.AthenaChallengeListEntry_GoalCard
// Size: 0x2b0 (Inherited: 0x2a8)
struct UAthenaChallengeListEntry_GoalCard : UAthenaChallengeListEntryBase {
	struct UAthenaGoalsPageQuestCard* GoalCard; // 0x2a8(0x08)

	void OnChallengeDataSet(bool bDisabled); // Function FortniteUI.AthenaChallengeListEntry_GoalCard.OnChallengeDataSet // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
};

// Class FortniteUI.AthenaChallengeListEntry_LockedQuest
// Size: 0x340 (Inherited: 0x2a8)
struct UAthenaChallengeListEntry_LockedQuest : UAthenaChallengeListEntryBase {
	struct UAthenaChallengeDateTimeTextBlock* DateTimeText_TimeUntilQuestUnlocks; // 0x2a8(0x08)
	struct URichTextBlock* RichTextBlock_ChallengesUntilUnlocked; // 0x2b0(0x08)
	struct URichTextBlock* RichTextBlock_TimeUntilUnlocked; // 0x2b8(0x08)
	struct FLockedQuestData LockedQuestData; // 0x2c0(0x48)
	struct FText DisplayNameFallback; // 0x308(0x18)
	struct FText DisplayTextOverride; // 0x320(0x18)
	char pad_338[0x8]; // 0x338(0x08)

	void OnInitDisplayText(enum class ELockedWidgetUnlockType& InUnlockType); // Function FortniteUI.AthenaChallengeListEntry_LockedQuest.OnInitDisplayText // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xdef49c
	struct FTimespan GetStartingUnlockTime(); // Function FortniteUI.AthenaChallengeListEntry_LockedQuest.GetStartingUnlockTime // (Final|Native|Protected|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d3b73c
};

// Class FortniteUI.AthenaChallengeListEntry_NpcQuest
// Size: 0x4b0 (Inherited: 0x2a8)
struct UAthenaChallengeListEntry_NpcQuest : UAthenaChallengeListEntryBase {
	struct URichTextBlock* RichText_ChallengeDesc; // 0x2a8(0x08)
	struct URichTextBlock* RichText_ObjectivesCompletedSelected; // 0x2b0(0x08)
	struct URichTextBlock* RichText_ObjectivesCompletedUnselected; // 0x2b8(0x08)
	struct UFortLazyImage* LazyImage_SourceIcon; // 0x2c0(0x08)
	struct URichTextBlock* RichText_SourceName; // 0x2c8(0x08)
	struct URichTextBlock* RichText_FlavorText; // 0x2d0(0x08)
	struct UAthenaChallengeDateTimeTextBlock* DateTimeText_TimeRemaining; // 0x2d8(0x08)
	struct UCommonButtonBase* Button_RemoveQuest; // 0x2e0(0x08)
	struct UFortHoldableButton* Button_ReplaceQuest; // 0x2e8(0x08)
	struct USizeBox* SizeBox_CornerUL; // 0x2f0(0x08)
	struct UFortLazyImage* LazyImage_IconUL; // 0x2f8(0x08)
	struct UAthenaChallengeRewards* UserWidget_Rewards; // 0x300(0x08)
	struct UCommonTextBlock* Text_QuestID; // 0x308(0x08)
	struct UCommonTextBlock* Text_ReplaceQuest; // 0x310(0x08)
	struct USizeBox* SizeBox_ReplaceQuest; // 0x318(0x08)
	struct USizeBox* SizeBox_StyleSize; // 0x320(0x08)
	struct UFortLazyImage* LazyImage_ReplaceQuestIndicator; // 0x328(0x08)
	struct UCommonActionWidget* ActionWidget_ReplaceQuest; // 0x330(0x08)
	struct USizeBox* SizeBox_PlayerLeftMatch; // 0x338(0x08)
	struct FText TextConfirmRemoveQuestTitle; // 0x340(0x18)
	struct FText TextConfirmRemoveQuestDescription; // 0x358(0x18)
	struct FText TextReplaceQuestGamepad; // 0x370(0x18)
	struct FText TextReplaceQuestMouse; // 0x388(0x18)
	struct FText TextReplaceQuestTouch; // 0x3a0(0x18)
	struct FText TextExpiredQuest; // 0x3b8(0x18)
	struct FText TextExpiredQuestFrontEnd; // 0x3d0(0x18)
	struct TSoftObjectPtr<UObject> DefaultPortraitDisplayAsset; // 0x3e8(0x28)
	struct TSoftObjectPtr<UObject> PinnedQuestIcon; // 0x410(0x28)
	struct TSoftObjectPtr<UObject> SharedQuestIcon; // 0x438(0x28)
	char pad_460[0x18]; // 0x460(0x18)
	struct UHorizontalBox* HorizontalBox_DefaultWidgetsRoot; // 0x478(0x08)
	enum class EChallengeListEntryType EntryType; // 0x480(0x01)
	char pad_481[0x2f]; // 0x481(0x2f)

	void UpdateIconUL(); // Function FortniteUI.AthenaChallengeListEntry_NpcQuest.UpdateIconUL // (Final|Native|Private) // @ game+0x9d3e094
	void OnSetState(bool bIsCompleted, bool bIsLocked, bool bIsPartyAssisted, bool bIsGroupChallenge); // Function FortniteUI.AthenaChallengeListEntry_NpcQuest.OnSetState // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void OnReplaceQuestConfirmed__DelegateSignature(); // DelegateFunction FortniteUI.AthenaChallengeListEntry_NpcQuest.OnReplaceQuestConfirmed__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0xdef49c
	bool IsSelected(); // Function FortniteUI.AthenaChallengeListEntry_NpcQuest.IsSelected // (Final|Native|Private|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d3d034
	bool IsChallengeRefreshingDaily(); // Function FortniteUI.AthenaChallengeListEntry_NpcQuest.IsChallengeRefreshingDaily // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d3cf60
	void HandleQuestSeen(struct UFortAccountItem* AccountItem); // Function FortniteUI.AthenaChallengeListEntry_NpcQuest.HandleQuestSeen // (Final|Native|Private) // @ game+0x9d3c6c8
	void HandleObjectiveUpdate(struct UFortQuestItem* QuestItem, struct FName Objective, int32_t AchievedCount, int32_t GoalCount); // Function FortniteUI.AthenaChallengeListEntry_NpcQuest.HandleObjectiveUpdate // (Final|Native|Private) // @ game+0x9d3c010
	bool GetIsCompleted(); // Function FortniteUI.AthenaChallengeListEntry_NpcQuest.GetIsCompleted // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x7d1ad18
	void BP_OnTimerSet(enum class EAthenaChallengeTimerState TimerState); // Function FortniteUI.AthenaChallengeListEntry_NpcQuest.BP_OnTimerSet // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void BP_OnSelectedForQuestReplacing(bool bSelected); // Function FortniteUI.AthenaChallengeListEntry_NpcQuest.BP_OnSelectedForQuestReplacing // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void BP_OnRaritySet(enum class EFortRarity Rarity); // Function FortniteUI.AthenaChallengeListEntry_NpcQuest.BP_OnRaritySet // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void BP_OnChallengeSeenChanged(bool bChallengeSeen); // Function FortniteUI.AthenaChallengeListEntry_NpcQuest.BP_OnChallengeSeenChanged // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void BP_FormatForChallengeOwnerLeftGame(bool bHasOwnerLeftGame); // Function FortniteUI.AthenaChallengeListEntry_NpcQuest.BP_FormatForChallengeOwnerLeftGame // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
};

// Class FortniteUI.AthenaChallengeListViewBase
// Size: 0x368 (Inherited: 0x260)
struct UAthenaChallengeListViewBase : UListViewBase {
	char pad_260[0xd8]; // 0x260(0xd8)
	struct UAthenaQuestEntryVisualData* VisualData; // 0x338(0x08)
	char pad_340[0x20]; // 0x340(0x20)
	float EntrySpacing; // 0x360(0x04)
	char pad_364[0x4]; // 0x364(0x04)
};

// Class FortniteUI.AthenaChallengeNpcQuestCounter
// Size: 0x2d8 (Inherited: 0x268)
struct UAthenaChallengeNpcQuestCounter : UUserWidget {
	struct FGameplayTagContainer ExcludedTabs; // 0x268(0x20)
	struct FText Text_PartyTab; // 0x288(0x18)
	struct FText Text_PersonalTab; // 0x2a0(0x18)
	char pad_2B8[0x8]; // 0x2b8(0x08)
	struct URichTextBlock* RichText_HeaderDesc; // 0x2c0(0x08)
	struct URichTextBlock* RichText_MaxQuests; // 0x2c8(0x08)
	struct URichTextBlock* RichText_NumActiveQuests; // 0x2d0(0x08)

	void UpdateVisibility(struct FGameplayTag& CurrentTabTag); // Function FortniteUI.AthenaChallengeNpcQuestCounter.UpdateVisibility // (Final|Native|Public|HasOutParms) // @ game+0x9d3e0a8
	void HandleTransientQuestStarted(struct UFortQuestItem* QuestItem, struct UFortQuestItemDefinition_Athena* PreceedingQuestDefAthena); // Function FortniteUI.AthenaChallengeNpcQuestCounter.HandleTransientQuestStarted // (Final|Native|Private) // @ game+0x9d3ce6c
	void HandleTransientQuestRemoved(struct UFortQuestItem* QuestItem); // Function FortniteUI.AthenaChallengeNpcQuestCounter.HandleTransientQuestRemoved // (Final|Native|Private) // @ game+0x9d3cd2c
	void HandleQuestUpdate(struct UFortQuestObjectiveInfo* QuestObjective, bool bDisplayStatusUpdate, bool bDisplayAnnouncementUpdate); // Function FortniteUI.AthenaChallengeNpcQuestCounter.HandleQuestUpdate // (Final|Native|Private) // @ game+0x9d3c76c
};

// Class FortniteUI.AthenaChallengeNpcQuestListView
// Size: 0x3c0 (Inherited: 0x368)
struct UAthenaChallengeNpcQuestListView : UAthenaChallengeListViewBase {
	char pad_368[0x48]; // 0x368(0x48)
	struct UAthenaChallengeListEntry_Header* SectionHeaderEntryClass; // 0x3b0(0x08)
	struct UAthenaChallengeListEntry_Header* DisabledHeaderEntryClass; // 0x3b8(0x08)
};

// Class FortniteUI.AthenaChallengeProgressBar
// Size: 0x280 (Inherited: 0x268)
struct UAthenaChallengeProgressBar : UUserWidget {
	bool bHideProgressBar; // 0x268(0x01)
	char pad_269[0x7]; // 0x269(0x07)
	struct UProgressBar* ProgressBar_StepsCompleted; // 0x270(0x08)
	struct UCommonRichTextBlock* RichText_Progress; // 0x278(0x08)

	void SetPercentValueForMaterialNumber(int32_t PercentValue); // Function FortniteUI.AthenaChallengeProgressBar.SetPercentValueForMaterialNumber // (Event|Public|BlueprintEvent) // @ game+0xdef49c
};

// Class FortniteUI.AthenaChallengePunchCard
// Size: 0x2f8 (Inherited: 0x290)
struct UAthenaChallengePunchCard : UCommonUserWidget {
	int32_t MaxPunchesAllowed; // 0x290(0x04)
	char pad_294[0x4]; // 0x294(0x04)
	struct UDynamicEntryBox* Box_PunchSlots; // 0x298(0x08)
	struct UCommonTextBlock* Text_Title; // 0x2a0(0x08)
	struct UCommonTextBlock* Text_Description; // 0x2a8(0x08)
	char pad_2B0[0x30]; // 0x2b0(0x30)
	bool bInitializedWidgetPool; // 0x2e0(0x01)
	bool bBundleIsKnown; // 0x2e1(0x01)
	bool bBangShown; // 0x2e2(0x01)
	char pad_2E3[0x1]; // 0x2e3(0x01)
	struct TWeakObjectPtr<struct UFortChallengeBundleItemDefinition> WeakBundleDef; // 0x2e4(0x08)
	char pad_2EC[0x4]; // 0x2ec(0x04)
	struct FDateTime MostRecentPunch; // 0x2f0(0x08)

	void UpdateChallengePunchCard(struct UFortChallengeBundleItem* Bundle, struct UFortQuestItem* CopmpletedQuest); // Function FortniteUI.AthenaChallengePunchCard.UpdateChallengePunchCard // (Final|Native|Public) // @ game+0x9d3dfd0
	void UnfocusPunchCard(); // Function FortniteUI.AthenaChallengePunchCard.UnfocusPunchCard // (Event|Public|BlueprintEvent) // @ game+0xdef49c
	void TryToClearBangState(); // Function FortniteUI.AthenaChallengePunchCard.TryToClearBangState // (Final|Native|Public|BlueprintCallable) // @ game+0x9d3dfa8
	void ShowWidget(); // Function FortniteUI.AthenaChallengePunchCard.ShowWidget // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void SetUpEncodedName(struct FString Name, int32_t Count); // Function FortniteUI.AthenaChallengePunchCard.SetUpEncodedName // (Event|Public|BlueprintEvent) // @ game+0xdef49c
	void SetUnkownState(bool bKnown); // Function FortniteUI.AthenaChallengePunchCard.SetUnkownState // (Event|Public|BlueprintEvent) // @ game+0xdef49c
	void SetStyle(struct FFortChallengePunchCardStyles& PunchStyle); // Function FortniteUI.AthenaChallengePunchCard.SetStyle // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0xdef49c
	void SetProgressCount(int32_t AchivedCount, int32_t GoalCount); // Function FortniteUI.AthenaChallengePunchCard.SetProgressCount // (Event|Public|BlueprintEvent) // @ game+0xdef49c
	void SetBangState(bool bShowBang); // Function FortniteUI.AthenaChallengePunchCard.SetBangState // (Event|Public|BlueprintEvent) // @ game+0xdef49c
	void HideProgressCount(bool bBundleCompleted); // Function FortniteUI.AthenaChallengePunchCard.HideProgressCount // (Event|Public|BlueprintEvent) // @ game+0xdef49c
	void FocusPunchCard(); // Function FortniteUI.AthenaChallengePunchCard.FocusPunchCard // (Event|Public|BlueprintEvent) // @ game+0xdef49c
	void FinishedPunchingCard(bool bPlayOutro); // Function FortniteUI.AthenaChallengePunchCard.FinishedPunchingCard // (Event|Public|BlueprintEvent) // @ game+0xdef49c
};

// Class FortniteUI.AthenaChallengePunchCardEntry
// Size: 0x2d0 (Inherited: 0x290)
struct UAthenaChallengePunchCardEntry : UCommonUserWidget {
	struct FName IconParamName; // 0x290(0x04)
	int32_t SlotIndex; // 0x294(0x04)
	bool bIsBeingPlaced; // 0x298(0x01)
	char pad_299[0x1f]; // 0x299(0x1f)
	struct UCommonTextBlock* Text_RewardQuantity; // 0x2b8(0x08)
	struct UCommonRichTextBlock* Text_UnlockDate; // 0x2c0(0x08)
	struct UFortLazyImage* LazyImage_Stamp; // 0x2c8(0x08)

	void SetToDefaultSlot(); // Function FortniteUI.AthenaChallengePunchCardEntry.SetToDefaultSlot // (Event|Public|BlueprintEvent) // @ game+0xdef49c
	void SetStyle(struct FFortChallengePunchCardStyles& PunchStyle); // Function FortniteUI.AthenaChallengePunchCardEntry.SetStyle // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0xdef49c
	void SetIsNonsequentialSlot(); // Function FortniteUI.AthenaChallengePunchCardEntry.SetIsNonsequentialSlot // (Event|Public|BlueprintEvent) // @ game+0xdef49c
	void SetIsLastSlot(); // Function FortniteUI.AthenaChallengePunchCardEntry.SetIsLastSlot // (Event|Public|BlueprintEvent) // @ game+0xdef49c
	void SetIsFirstSlot(); // Function FortniteUI.AthenaChallengePunchCardEntry.SetIsFirstSlot // (Event|Public|BlueprintEvent) // @ game+0xdef49c
	void OnPlacedEntry(); // Function FortniteUI.AthenaChallengePunchCardEntry.OnPlacedEntry // (Event|Public|BlueprintEvent) // @ game+0xdef49c
	void OnFinishedPlacingEntry(); // Function FortniteUI.AthenaChallengePunchCardEntry.OnFinishedPlacingEntry // (Final|Native|Public|BlueprintCallable) // @ game+0x9d3d2f4
};

// Class FortniteUI.AthenaChallengeRecapEntry
// Size: 0x2f0 (Inherited: 0x290)
struct UAthenaChallengeRecapEntry : UCommonUserWidget {
	char pad_290[0x48]; // 0x290(0x48)
	struct UCommonTextBlock* Text_QuestObjective; // 0x2d8(0x08)
	struct UCommonTextBlock* Text_CompletionCount; // 0x2e0(0x08)
	struct UWidgetSwitcher* Switcher_Progression; // 0x2e8(0x08)

	void UpdateProgressBar(float StartingPercent, float EndingPercent); // Function FortniteUI.AthenaChallengeRecapEntry.UpdateProgressBar // (Event|Public|BlueprintEvent) // @ game+0xdef49c
	void StartOutroAnim(); // Function FortniteUI.AthenaChallengeRecapEntry.StartOutroAnim // (Event|Public|BlueprintEvent) // @ game+0xdef49c
	void StartIntroAnim(); // Function FortniteUI.AthenaChallengeRecapEntry.StartIntroAnim // (Event|Public|BlueprintEvent) // @ game+0xdef49c
	void OutroFinished(); // Function FortniteUI.AthenaChallengeRecapEntry.OutroFinished // (Final|Native|Public|BlueprintCallable) // @ game+0x9d3d5ac
	void IntroFinished(); // Function FortniteUI.AthenaChallengeRecapEntry.IntroFinished // (Final|Native|Public|BlueprintCallable) // @ game+0x9d3cf44
};

// Class FortniteUI.AthenaChallengeRewards
// Size: 0x2a8 (Inherited: 0x268)
struct UAthenaChallengeRewards : UUserWidget {
	struct UFortLazyImage* LazyImage_RewardIcon; // 0x268(0x08)
	struct UCommonTextBlock* Text_RewardCount; // 0x270(0x08)
	struct UImage* Image_RewardBacking; // 0x278(0x08)
	struct UFortDynamicEntryBox* DynamicBox_MultiMarkers; // 0x280(0x08)
	char pad_288[0x20]; // 0x288(0x20)
};

// Class FortniteUI.AthenaChallengeRewardsMultiMarker
// Size: 0x268 (Inherited: 0x268)
struct UAthenaChallengeRewardsMultiMarker : UUserWidget {

	void BP_OnSetMarkerActive(bool bIsActive); // Function FortniteUI.AthenaChallengeRewardsMultiMarker.BP_OnSetMarkerActive // (Event|Public|BlueprintEvent) // @ game+0xdef49c
};

// Class FortniteUI.AthenaChallengeRewardTrackEntry
// Size: 0x2f8 (Inherited: 0x290)
struct UAthenaChallengeRewardTrackEntry : UCommonUserWidget {
	struct FName MissionRewardParamName; // 0x290(0x04)
	char pad_294[0x4]; // 0x294(0x04)
	struct TSoftObjectPtr<UFortItemDefinition> RewardToRepresent; // 0x298(0x28)
	int32_t BundleRewardIndex; // 0x2c0(0x04)
	char pad_2C4[0x4]; // 0x2c4(0x04)
	struct UImage* Image_ConnectorLeft; // 0x2c8(0x08)
	struct UImage* Image_ConnectorRight; // 0x2d0(0x08)
	struct UAthenaChallengeRewardDisplayEntry* MissionReward; // 0x2d8(0x08)
	char pad_2E0[0x18]; // 0x2e0(0x18)

	void StyleChange(bool bViewingPrestige); // Function FortniteUI.AthenaChallengeRewardTrackEntry.StyleChange // (Event|Public|BlueprintEvent) // @ game+0xdef49c
	void SetToDefaultState(); // Function FortniteUI.AthenaChallengeRewardTrackEntry.SetToDefaultState // (Event|Public|BlueprintEvent) // @ game+0xdef49c
	void SetLastNodeInTrack(bool bIsLast); // Function FortniteUI.AthenaChallengeRewardTrackEntry.SetLastNodeInTrack // (Event|Public|BlueprintEvent) // @ game+0xdef49c
	void SetAsCurrentPreviewItem(); // Function FortniteUI.AthenaChallengeRewardTrackEntry.SetAsCurrentPreviewItem // (Event|Public|BlueprintEvent) // @ game+0xdef49c
	void NextRewardToEarn(bool bNext); // Function FortniteUI.AthenaChallengeRewardTrackEntry.NextRewardToEarn // (Event|Public|BlueprintEvent) // @ game+0xdef49c
	void CompletedNextNode(bool bAnimate); // Function FortniteUI.AthenaChallengeRewardTrackEntry.CompletedNextNode // (Event|Public|BlueprintEvent) // @ game+0xdef49c
	void CompletedCurrentNode(bool bAnimate, bool LastReward); // Function FortniteUI.AthenaChallengeRewardTrackEntry.CompletedCurrentNode // (Event|Public|BlueprintEvent) // @ game+0xdef49c
	void ClearPreviewSelection(); // Function FortniteUI.AthenaChallengeRewardTrackEntry.ClearPreviewSelection // (Event|Public|BlueprintEvent) // @ game+0xdef49c
};

// Class FortniteUI.AthenaChallengeSetListView
// Size: 0x3c0 (Inherited: 0x368)
struct UAthenaChallengeSetListView : UAthenaChallengeListViewBase {
	struct FAthenaChallengeListVisualOptions ListVisualOptions; // 0x368(0x0c)
	bool bHideHeaders; // 0x374(0x01)
	bool bHideCompletionRewards; // 0x375(0x01)
	bool bHideQuestRewards; // 0x376(0x01)
	bool bUseCompactActionInfo; // 0x377(0x01)
	bool bAllowFocus; // 0x378(0x01)
	char pad_379[0x2f]; // 0x379(0x2f)
	struct UAthenaChallengeListEntry_Header* SectionHeaderEntryClass; // 0x3a8(0x08)
	struct UAthenaChallengeListEntry_CompletionReward* CompletionRewardEntryClass; // 0x3b0(0x08)
	struct UAthenaChallengeListEntry_StoreOffer* SpecialOfferEntryClass; // 0x3b8(0x08)
};

// Class FortniteUI.AthenaChallengeTreeView
// Size: 0x3e8 (Inherited: 0x368)
struct UAthenaChallengeTreeView : UAthenaChallengeListViewBase {
	char pad_368[0x70]; // 0x368(0x70)
	struct UAthenaChallengeTreeEntry_ChallengeSet* SetHeaderEntryClass; // 0x3d8(0x08)
	bool bReturnFocusToSelection; // 0x3e0(0x01)
	char pad_3E1[0x7]; // 0x3e1(0x07)

	void HandleQuestsUpdated(); // Function FortniteUI.AthenaChallengeTreeView.HandleQuestsUpdated // (Final|Native|Private) // @ game+0x9d3c85c
};

// Class FortniteUI.AthenaGroupChallengeTag
// Size: 0x270 (Inherited: 0x268)
struct UAthenaGroupChallengeTag : UUserWidget {
	struct UWidgetAnimation* Anim_Flash; // 0x268(0x08)

	void HandleOnToggleFullScreenMap(bool bIsMapVisible); // Function FortniteUI.AthenaGroupChallengeTag.HandleOnToggleFullScreenMap // (Final|Native|Private) // @ game+0x9d3c634
};

// Class FortniteUI.AthenaMiniChallengeEntry
// Size: 0x2f8 (Inherited: 0x290)
struct UAthenaMiniChallengeEntry : UCommonUserWidget {
	struct UFortLazyImage* QuestIcon; // 0x290(0x08)
	struct UFortQuestItemDefinition* QuestDef; // 0x298(0x08)
	struct UFortQuestItemDefinition* PendingQuestDef; // 0x2a0(0x08)
	int32_t DisplayGoal; // 0x2a8(0x04)
	int32_t DisplayAchivedCount; // 0x2ac(0x04)
	int32_t PendingGoalCount; // 0x2b0(0x04)
	int32_t PendingLastKnown; // 0x2b4(0x04)
	int32_t PendingAchivedCount; // 0x2b8(0x04)
	int32_t PendingXpValue; // 0x2bc(0x04)
	bool bPendingUpdate; // 0x2c0(0x01)
	bool bIsFirstTimeBoosted; // 0x2c1(0x01)
	char pad_2C2[0x2]; // 0x2c2(0x02)
	struct FName ParamName; // 0x2c4(0x04)
	char pad_2C8[0x30]; // 0x2c8(0x30)

	void UpdateQuestDescription(struct FText& Description); // Function FortniteUI.AthenaMiniChallengeEntry.UpdateQuestDescription // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0xdef49c
	void UpdateProgressBar(int32_t LastKnownCount, int32_t AchivedCount, int32_t GoalCount); // Function FortniteUI.AthenaMiniChallengeEntry.UpdateProgressBar // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void TriggerNewQuestGranted(); // Function FortniteUI.AthenaMiniChallengeEntry.TriggerNewQuestGranted // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void SetXpValue(int32_t XpRewardValue); // Function FortniteUI.AthenaMiniChallengeEntry.SetXpValue // (Event|Public|BlueprintEvent) // @ game+0xdef49c
	void RefeshWithNewQuest(); // Function FortniteUI.AthenaMiniChallengeEntry.RefeshWithNewQuest // (Event|Public|BlueprintEvent) // @ game+0xdef49c
	void QuestCompletedFinishFill(); // Function FortniteUI.AthenaMiniChallengeEntry.QuestCompletedFinishFill // (Event|Public|BlueprintEvent) // @ game+0xdef49c
	void FinishedQuestUpdate(); // Function FortniteUI.AthenaMiniChallengeEntry.FinishedQuestUpdate // (Final|Native|Public|BlueprintCallable) // @ game+0x9d3b454
};

// Class FortniteUI.AthenaMiniChallenges
// Size: 0x3d8 (Inherited: 0x3a8)
struct UAthenaMiniChallenges : UCommonActivatableWidget {
	struct UDynamicEntryBox* EntryBox_MiniChallenges; // 0x3a8(0x08)
	bool bPlacedAtEndOfMatch; // 0x3b0(0x01)
	char pad_3B1[0x1f]; // 0x3b1(0x1f)
	int32_t UpdatingWidgets; // 0x3d0(0x04)
	char pad_3D4[0x4]; // 0x3d4(0x04)

	void InspectModeEnabled(bool bEnabled); // Function FortniteUI.AthenaMiniChallenges.InspectModeEnabled // (Event|Public|BlueprintEvent) // @ game+0xdef49c
	void ClearQuestDescriptions(); // Function FortniteUI.AthenaMiniChallenges.ClearQuestDescriptions // (Event|Public|BlueprintEvent) // @ game+0xdef49c
	void AddQuestDetails(struct FText& QuestDescription, int32_t AchivedCount, int32_t GoalCount); // Function FortniteUI.AthenaMiniChallenges.AddQuestDetails // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0xdef49c
};

// Class FortniteUI.AthenaQuestEntryVisualData
// Size: 0x80 (Inherited: 0x30)
struct UAthenaQuestEntryVisualData : UDataAsset {
	struct TMap<enum class EChallengeListEntryType, struct UAthenaChallengeListEntryBase*> EntryWidgetForClass; // 0x30(0x50)
};

// Class FortniteUI.EndOfMatchQuestCategoryWidget
// Size: 0x2e0 (Inherited: 0x290)
