// ScriptStruct Fortnite_Base_Head_Export_Skeleton_AnimBP.Fortnite_Base_Head_Export_Skeleton_AnimBP_C.AnimBlueprintGeneratedMutableData
// Size: 0x06 (Inherited: 0x01)
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData {
	bool __BoolProperty; // 0x01(0x01)
	bool ; // 0x02(0x01)
	char ; // 0x03(0x01)
	char ; // 0x04(0x01)
	bool ; // 0x05(0x01)
};

// ScriptStruct Fortnite_Base_Head_Export_Skeleton_AnimBP.Fortnite_Base_Head_Export_Skeleton_AnimBP_C.AnimBlueprintGeneratedConstantData
// Size: 0x160 (Inherited: 0x01)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData {
	char pad_1[0x3]; // 0x01(0x03)
	struct FName ; // 0x04(0x04)
	struct UAnimSequenceBase* ; // 0x08(0x08)
	struct TArray<float> ; // 0x10(0x10)
	struct TArray<float> ; // 0x20(0x10)
	struct TArray<int32_t> ; // 0x30(0x10)
	struct UBlendProfile* ; // 0x40(0x08)
	struct UCurveFloat* ; // 0x48(0x08)
	enum class EAlphaBlendOption ; // 0x50(0x01)
	enum class EBlendListTransitionType ; // 0x51(0x01)
	char pad_52[0x6]; // 0x52(0x06)
	struct TArray<float> ; // 0x58(0x10)
	bool ; // 0x68(0x01)
	char pad_69[0x3]; // 0x69(0x03)
	float ; // 0x6c(0x04)
	struct FInputScaleBiasClampConstants ; // 0x70(0x2c)
	float ; // 0x9c(0x04)
	struct UAnimSequenceBase* ; // 0xa0(0x08)
	bool ; // 0xa8(0x01)
	enum class EAnimSyncMethod ; // 0xa9(0x01)
	enum class EAnimGroupRole ; // 0xaa(0x01)
	char pad_AB[0x1]; // 0xab(0x01)
	struct FName ; // 0xac(0x04)
	struct FAnimNodeFunctionRef ; // 0xb0(0x18)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0xc8(0x80)
	struct FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0x148(0x18)
};

