// AnimBlueprintGeneratedClass Fortnite_Player_LowerBodyJog_AnimBP.Fortnite_Player_LowerBodyJog_AnimBP_C
// Size: 0x4878 (Inherited: 0xb50)
struct UFortnite_Player_LowerBodyJog_AnimBP_C : UFortWalkAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0xb50(0x08)
	struct FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0xb58(0x250)
	struct FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0xda8(0x08)
	struct FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0xdb0(0x08)
	struct FAnimNode_Root ; // 0xdb8(0x20)
	struct FAnimNode_LinkedInputPose ; // 0xdd8(0xc0)
	struct FAnimNode_Root ; // 0xe98(0x20)
	struct FAnimNode_LinkedInputPose ; // 0xeb8(0xc0)
	struct FAnimNode_Root ; // 0xf78(0x20)
	struct FAnimNode_Root ; // 0xf98(0x20)
	struct FAnimNode_Root ; // 0xfb8(0x20)
	struct FAnimNode_Root ; // 0xfd8(0x20)
	struct FAnimNode_Root ; // 0xff8(0x20)
	struct FAnimNode_Root ; // 0x1018(0x20)
	struct FAnimNode_Root ; // 0x1038(0x20)
	struct FAnimNode_Root ; // 0x1058(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x1078(0xc0)
	struct FAnimNode_Root ; // 0x1138(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x1158(0xc0)
	struct FAnimNode_Root ; // 0x1218(0x20)
	struct FAnimNode_Root ; // 0x1238(0x20)
	struct FAnimNode_Root ; // 0x1258(0x20)
	struct FAnimNode_Root ; // 0x1278(0x20)
	struct FAnimNode_Root ; // 0x1298(0x20)
	struct FAnimNode_Root ; // 0x12b8(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x12d8(0xc0)
	struct FAnimNode_Root ; // 0x1398(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x13b8(0xc0)
	struct FAnimNode_LinkedInputPose ; // 0x1478(0xc0)
	struct FAnimNode_Root ; // 0x1538(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x1558(0xc0)
	struct FAnimNode_Root ; // 0x1618(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x1638(0xc0)
	struct FAnimNode_Root ; // 0x16f8(0x20)
	struct FAnimNode_BlendSpacePlayer ; // 0x1718(0x68)
	struct FAnimNode_Root ; // 0x1780(0x20)
	struct FAnimNode_BlendListByBool ; // 0x17a0(0x48)
	struct FAnimNode_RotateRootBone ; // 0x17e8(0xa8)
	struct FAnimNode_BlendSpacePlayer ; // 0x1890(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x18f8(0x68)
	struct FAnimNode_Root ; // 0x1960(0x20)
	struct FAnimNode_BlendSpacePlayer ; // 0x1980(0x68)
	struct FAnimNode_RotateRootBone ; // 0x19e8(0xa8)
	struct FFortAnimNode_SpeedWarping ; // 0x1a90(0x200)
	struct FAnimNode_ConvertLocalToComponentSpace ; // 0x1c90(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace ; // 0x1cb0(0x20)
	struct FAnimNode_BlendListByBool ; // 0x1cd0(0x48)
	struct FAnimNode_BlendSpacePlayer ; // 0x1d18(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x1d80(0x68)
	struct FAnimNode_BlendListByBool ; // 0x1de8(0x48)
	struct FAnimNode_BlendSpacePlayer ; // 0x1e30(0x68)
	struct FAnimNode_BlendListByBool ; // 0x1e98(0x48)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x1ee0(0x20)
	struct FAnimNode_TransitionResult ; // 0x1f00(0x28)
	struct FAnimNode_TransitionResult ; // 0x1f28(0x28)
	struct FAnimNode_TransitionResult ; // 0x1f50(0x28)
	struct FAnimNode_TransitionResult ; // 0x1f78(0x28)
	struct FAnimNode_TransitionResult ; // 0x1fa0(0x28)
	struct FAnimNode_TransitionResult ; // 0x1fc8(0x28)
	struct FAnimNode_TransitionResult ; // 0x1ff0(0x28)
	struct FAnimNode_TransitionResult ; // 0x2018(0x28)
	struct FAnimNode_TransitionResult ; // 0x2040(0x28)
	struct FAnimNode_TransitionResult ; // 0x2068(0x28)
	struct FAnimNode_TransitionResult ; // 0x2090(0x28)
	struct FAnimNode_TransitionResult ; // 0x20b8(0x28)
	struct FAnimNode_TransitionResult ; // 0x20e0(0x28)
	struct FAnimNode_TransitionResult ; // 0x2108(0x28)
	struct FAnimNode_TransitionResult ; // 0x2130(0x28)
	struct FAnimNode_TransitionResult ; // 0x2158(0x28)
	struct FAnimNode_TransitionResult ; // 0x2180(0x28)
	struct FAnimNode_TransitionResult ; // 0x21a8(0x28)
	struct FAnimNode_TransitionResult ; // 0x21d0(0x28)
	struct FAnimNode_TransitionResult ; // 0x21f8(0x28)
	struct FAnimNode_TransitionResult ; // 0x2220(0x28)
	struct FAnimNode_TransitionResult ; // 0x2248(0x28)
	struct FAnimNode_TransitionResult ; // 0x2270(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2298(0x28)
	struct FAnimNode_BlendListByEnum ; // 0x22c0(0x48)
	struct FAnimNode_RotateRootBone ; // 0x2308(0xa8)
	struct FAnimNode_SequencePlayer ; // 0x23b0(0x40)
	struct FAnimNode_SequencePlayer ; // 0x23f0(0x40)
	struct FAnimNode_SequencePlayer ; // 0x2430(0x40)
	struct FAnimNode_SequencePlayer ; // 0x2470(0x40)
	struct FAnimNode_StateResult ; // 0x24b0(0x20)
	struct FAnimNode_BlendListByEnum ; // 0x24d0(0x48)
	struct FAnimNode_ConvertComponentToLocalSpace ; // 0x2518(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace ; // 0x2538(0x20)
	struct FFortAnimNode_SpeedWarping ; // 0x2558(0x200)
	struct FAnimNode_SequencePlayer ; // 0x2758(0x40)
	struct FAnimNode_RotateRootBone ; // 0x2798(0xa8)
	struct FAnimNode_RotateRootBone ; // 0x2840(0xa8)
	struct FAnimNode_RotateRootBone ; // 0x28e8(0xa8)
	struct FAnimNode_RotateRootBone ; // 0x2990(0xa8)
	struct FAnimNode_SequencePlayer ; // 0x2a38(0x40)
	struct FAnimNode_SequencePlayer ; // 0x2a78(0x40)
	struct FAnimNode_SequencePlayer ; // 0x2ab8(0x40)
	struct FAnimNode_StateResult ; // 0x2af8(0x20)
	struct FAnimNode_BlendListByEnum ; // 0x2b18(0x48)
	struct FAnimNode_RotateRootBone ; // 0x2b60(0xa8)
	struct FAnimNode_SequencePlayer ; // 0x2c08(0x40)
	struct FAnimNode_SequencePlayer ; // 0x2c48(0x40)
	struct FAnimNode_SequencePlayer ; // 0x2c88(0x40)
	struct FAnimNode_SequencePlayer ; // 0x2cc8(0x40)
	struct FAnimNode_StateResult ; // 0x2d08(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace ; // 0x2d28(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace ; // 0x2d48(0x20)
	struct FAnimNode_ModifyBone ; // 0x2d68(0x128)
	struct FAnimNode_BlendListByEnum ; // 0x2e90(0x48)
	struct FAnimNode_BlendListByEnum ; // 0x2ed8(0x48)
	struct FAnimNode_SequencePlayer ; // 0x2f20(0x40)
	struct FAnimNode_SequencePlayer ; // 0x2f60(0x40)
	struct FAnimNode_SequencePlayer ; // 0x2fa0(0x40)
	struct FAnimNode_SequencePlayer ; // 0x2fe0(0x40)
	struct FAnimNode_SequencePlayer ; // 0x3020(0x40)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x3060(0xe0)
	struct FAnimNode_RotateRootBone ; // 0x3140(0xa8)
	struct FAnimNode_SequencePlayer ; // 0x31e8(0x40)
	struct FAnimNode_SequencePlayer ; // 0x3228(0x40)
	struct FAnimNode_SequencePlayer ; // 0x3268(0x40)
	struct FAnimNode_StateResult ; // 0x32a8(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace ; // 0x32c8(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace ; // 0x32e8(0x20)
	struct FAnimNode_ModifyBone ; // 0x3308(0x128)
	struct FAnimNode_ConvertComponentToLocalSpace ; // 0x3430(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace ; // 0x3450(0x20)
	struct FFortAnimNode_SpeedWarping FortAnimGraphNode_SpeedWarping; // 0x3470(0x200)
	struct FAnimNode_SequencePlayer ; // 0x3670(0x40)
	struct FAnimNode_BlendListByBool ; // 0x36b0(0x48)
	struct FAnimNode_SequencePlayer ; // 0x36f8(0x40)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x3738(0xc0)
	struct FAnimNode_SequencePlayer ; // 0x37f8(0x40)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone; // 0x3838(0xa8)
	struct FAnimNode_StateResult ; // 0x38e0(0x20)
	struct FAnimNode_UseCachedPose ; // 0x3900(0x28)
	struct FAnimNode_SequencePlayer ; // 0x3928(0x40)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x3968(0x40)
	struct FAnimNode_BlendListByBool ; // 0x39a8(0x48)
	struct FAnimNode_ApplyAdditive ; // 0x39f0(0xc8)
	struct FAnimNode_ConvertLocalToComponentSpace ; // 0x3ab8(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace ; // 0x3ad8(0x20)
	struct FAnimNode_ModifyBone ; // 0x3af8(0x128)
	struct FAnimNode_StateResult ; // 0x3c20(0x20)
	struct FAnimNode_UseCachedPose ; // 0x3c40(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x3c68(0x28)
	struct FAnimNode_BlendListByBool ; // 0x3c90(0x48)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x3cd8(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x3cf8(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x3d18(0x128)
	struct FAnimNode_StateResult ; // 0x3e40(0x20)
	struct FAnimNode_LinkedAnimLayer ; // 0x3e60(0xc8)
	struct FAnimNode_LinkedAnimLayer ; // 0x3f28(0xc8)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x3ff0(0xc8)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_Layer; // 0x40b8(0xc8)
	struct FAnimNode_BlendSpacePlayer ; // 0x4180(0x68)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x41e8(0x68)
	struct FAnimNode_BlendListByBool ; // 0x4250(0x48)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x4298(0xc8)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x4360(0x48)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x43a8(0x48)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x43f0(0x20)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x4410(0xc8)
	struct FAnimNode_SaveCachedPose ; // 0x44d8(0x100)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x45d8(0x100)
	struct FAnimNode_LinkedInputPose ; // 0x46d8(0xc0)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x4798(0xc0)
	double JogStartPosition; // 0x4858(0x08)
	double CrouchPlayRate; // 0x4860(0x08)
	double PivotAnimBlendTime; // 0x4868(0x08)
	double StartAnimBlendTime; // 0x4870(0x08)

	void ItemUpperBody(struct FPoseLink InPoseUpperBody, struct FFortAnimInput_AdjustedAim InputParam, struct FPoseLink& ItemUpperBody); // Function Fortnite_Player_LowerBodyJog_AnimBP.Fortnite_Player_LowerBodyJog_AnimBP_C.ItemUpperBody // (HasOutParms|BlueprintCallable) // @ game+0xdef49c
	void ItemIdleAdditive(struct FPoseLink InPoseIdleAdditive, struct FPoseLink& ItemIdleAdditive); // Function Fortnite_Player_LowerBodyJog_AnimBP.Fortnite_Player_LowerBodyJog_AnimBP_C.ItemIdleAdditive // (HasOutParms|BlueprintCallable) // @ game+0xdef49c
	void ItemJumpUpAdditive(struct FPoseLink& ItemJumpUpAdditive); // Function Fortnite_Player_LowerBodyJog_AnimBP.Fortnite_Player_LowerBodyJog_AnimBP_C.ItemJumpUpAdditive // (HasOutParms|BlueprintCallable) // @ game+0xdef49c
	void ItemJumpLoopAdditive(struct FPoseLink& ItemJumpLoopAdditive); // Function Fortnite_Player_LowerBodyJog_AnimBP.Fortnite_Player_LowerBodyJog_AnimBP_C.ItemJumpLoopAdditive // (HasOutParms|BlueprintCallable) // @ game+0xdef49c
	void ItemFallAdditive(struct FPoseLink& ItemFallAdditive); // Function Fortnite_Player_LowerBodyJog_AnimBP.Fortnite_Player_LowerBodyJog_AnimBP_C.ItemFallAdditive // (HasOutParms|BlueprintCallable) // @ game+0xdef49c
	void ItemFallLandAdditive(struct FPoseLink& ItemFallLandAdditive); // Function Fortnite_Player_LowerBodyJog_AnimBP.Fortnite_Player_LowerBodyJog_AnimBP_C.ItemFallLandAdditive // (HasOutParms|BlueprintCallable) // @ game+0xdef49c
	void ItemJetPackStartAdditive(struct FPoseLink& ItemJetPackStartAdditive); // Function Fortnite_Player_LowerBodyJog_AnimBP.Fortnite_Player_LowerBodyJog_AnimBP_C.ItemJetPackStartAdditive // (HasOutParms|BlueprintCallable) // @ game+0xdef49c
	void ItemJetPackJumpAdditive(struct FPoseLink& ItemJetPackJumpAdditive); // Function Fortnite_Player_LowerBodyJog_AnimBP.Fortnite_Player_LowerBodyJog_AnimBP_C.ItemJetPackJumpAdditive // (HasOutParms|BlueprintCallable) // @ game+0xdef49c
	void ItemZipLineStartAdditive(struct FPoseLink& ItemZipLineStartAdditive); // Function Fortnite_Player_LowerBodyJog_AnimBP.Fortnite_Player_LowerBodyJog_AnimBP_C.ItemZipLineStartAdditive // (HasOutParms|BlueprintCallable) // @ game+0xdef49c
	void ItemLowerBodyMovement(struct FPoseLink InPoseLowerBodyMovement, struct FPoseLink& ItemLowerBodyMovement); // Function Fortnite_Player_LowerBodyJog_AnimBP.Fortnite_Player_LowerBodyJog_AnimBP_C.ItemLowerBodyMovement // (HasOutParms|BlueprintCallable) // @ game+0xdef49c
	void ItemRelaxedEntry(struct FPoseLink InPoseRelaxedEntry, struct FPoseLink& ItemRelaxedEntry); // Function Fortnite_Player_LowerBodyJog_AnimBP.Fortnite_Player_LowerBodyJog_AnimBP_C.ItemRelaxedEntry // (HasOutParms|BlueprintCallable) // @ game+0xdef49c
	void ItemSwimJumpStart(struct FPoseLink& ItemSwimJumpStart); // Function Fortnite_Player_LowerBodyJog_AnimBP.Fortnite_Player_LowerBodyJog_AnimBP_C.ItemSwimJumpStart // (HasOutParms|BlueprintCallable) // @ game+0xdef49c
	void ItemSwimJumpStartLoop(struct FPoseLink& ItemSwimJumpStartLoop); // Function Fortnite_Player_LowerBodyJog_AnimBP.Fortnite_Player_LowerBodyJog_AnimBP_C.ItemSwimJumpStartLoop // (HasOutParms|BlueprintCallable) // @ game+0xdef49c
	void ItemSwimJumpFallLoop(struct FPoseLink& ItemSwimJumpFallLoop); // Function Fortnite_Player_LowerBodyJog_AnimBP.Fortnite_Player_LowerBodyJog_AnimBP_C.ItemSwimJumpFallLoop // (HasOutParms|BlueprintCallable) // @ game+0xdef49c
	void ItemSwimJumpSurfaceLoop(struct FPoseLink& ItemSwimJumpSurfaceLoop); // Function Fortnite_Player_LowerBodyJog_AnimBP.Fortnite_Player_LowerBodyJog_AnimBP_C.ItemSwimJumpSurfaceLoop // (HasOutParms|BlueprintCallable) // @ game+0xdef49c
	void ItemSwimJumpSurfaceEnd(struct FPoseLink& ItemSwimJumpSurfaceEnd); // Function Fortnite_Player_LowerBodyJog_AnimBP.Fortnite_Player_LowerBodyJog_AnimBP_C.ItemSwimJumpSurfaceEnd // (HasOutParms|BlueprintCallable) // @ game+0xdef49c
	void ItemSkeletalControl(struct FPoseLink InPose, struct FPoseLink& ItemSkeletalControl); // Function Fortnite_Player_LowerBodyJog_AnimBP.Fortnite_Player_LowerBodyJog_AnimBP_C.ItemSkeletalControl // (HasOutParms|BlueprintCallable) // @ game+0xdef49c
	void ItemAimOffset(struct FPoseLink InPose_AimOffset, double AimOffsetAlpha, double Yaw, double Pitch, struct FPoseLink InPose_UpperLowerPreMeleeAO, struct FPoseLink& ItemAimOffset); // Function Fortnite_Player_LowerBodyJog_AnimBP.Fortnite_Player_LowerBodyJog_AnimBP_C.ItemAimOffset // (HasOutParms|BlueprintCallable) // @ game+0xdef49c
	void ItemFullBodyOverride(struct FPoseLink InPoseFullBody, struct FPoseLink& ItemFullBodyOverride); // Function Fortnite_Player_LowerBodyJog_AnimBP.Fortnite_Player_LowerBodyJog_AnimBP_C.ItemFullBodyOverride // (HasOutParms|BlueprintCallable) // @ game+0xdef49c
	void ItemPreIK(struct FPoseLink InPose_PreIK, struct FPoseLink& ItemPreIK); // Function Fortnite_Player_LowerBodyJog_AnimBP.Fortnite_Player_LowerBodyJog_AnimBP_C.ItemPreIK // (HasOutParms|BlueprintCallable) // @ game+0xdef49c
	void Movement_HeavyWeapon(struct FPoseLink& Movement_HeavyWeapon); // Function Fortnite_Player_LowerBodyJog_AnimBP.Fortnite_Player_LowerBodyJog_AnimBP_C.Movement_HeavyWeapon // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xdef49c
	void Movement_Crouching(struct FPoseLink& Movement_Crouching); // Function Fortnite_Player_LowerBodyJog_AnimBP.Fortnite_Player_LowerBodyJog_AnimBP_C.Movement_Crouching // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xdef49c
	void Movement_Standing(struct FPoseLink& Movement_Standing); // Function Fortnite_Player_LowerBodyJog_AnimBP.Fortnite_Player_LowerBodyJog_AnimBP_C.Movement_Standing // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xdef49c
	void AnimGraph(struct FPoseLink UpperBody, struct FPoseLink PreUpperBodySlot, struct FPoseLink& AnimGraph); // Function Fortnite_Player_LowerBodyJog_AnimBP.Fortnite_Player_LowerBodyJog_AnimBP_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xdef49c
	void ExecuteUbergraph_Fortnite_Player_LowerBodyJog_AnimBP(int32_t EntryPoint); // Function Fortnite_Player_LowerBodyJog_AnimBP.Fortnite_Player_LowerBodyJog_AnimBP_C.ExecuteUbergraph_Fortnite_Player_LowerBodyJog_AnimBP // (Final|UbergraphFunction) // @ game+0xdef49c
};

