// ScriptStruct Galileo_LobsterLayerAnimBP.Galileo_LobsterLayerAnimBP_C.AnimBlueprintGeneratedMutableData
// Size: 0x4f (Inherited: 0x01)
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData {
	char pad_1[0x7]; // 0x01(0x07)
	struct UAnimSequenceBase* __AnimSequenceBase; // 0x08(0x08)
	struct UAnimSequenceBase* ; // 0x10(0x08)
	struct UAnimSequenceBase* ; // 0x18(0x08)
	struct UAnimSequenceBase* ; // 0x20(0x08)
	struct UAnimSequenceBase* ; // 0x28(0x08)
	struct UAnimSequenceBase* ; // 0x30(0x08)
	struct UAnimSequenceBase* ; // 0x38(0x08)
	bool ; // 0x40(0x01)
	bool ; // 0x41(0x01)
	char pad_42[0x2]; // 0x42(0x02)
	float ; // 0x44(0x04)
	float ; // 0x48(0x04)
	bool ; // 0x4c(0x01)
	bool ; // 0x4d(0x01)
	bool ; // 0x4e(0x01)
};

// ScriptStruct Galileo_LobsterLayerAnimBP.Galileo_LobsterLayerAnimBP_C.AnimBlueprintGeneratedConstantData
// Size: 0x268 (Inherited: 0x01)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData {
	char pad_1[0x3]; // 0x01(0x03)
	struct FName ; // 0x04(0x04)
	struct FName ; // 0x08(0x04)
	struct FName ; // 0x0c(0x04)
	struct FName ; // 0x10(0x04)
	struct FName ; // 0x14(0x04)
	struct FName ; // 0x18(0x04)
	int32_t ; // 0x1c(0x04)
	struct FName ; // 0x20(0x04)
	int32_t ; // 0x24(0x04)
	struct FName ; // 0x28(0x04)
	int32_t ; // 0x2c(0x04)
	struct UAnimSequenceBase* ; // 0x30(0x08)
	struct FName ; // 0x38(0x04)
	int32_t ; // 0x3c(0x04)
	struct FName ; // 0x40(0x04)
	int32_t ; // 0x44(0x04)
	struct UAnimSequenceBase* ; // 0x48(0x08)
	struct FName ; // 0x50(0x04)
	int32_t ; // 0x54(0x04)
	struct FName ; // 0x58(0x04)
	int32_t ; // 0x5c(0x04)
	struct FName ; // 0x60(0x04)
	int32_t ; // 0x64(0x04)
	struct FName ; // 0x68(0x04)
	int32_t ; // 0x6c(0x04)
	struct FName ; // 0x70(0x04)
	int32_t ; // 0x74(0x04)
	struct UAnimSequenceBase* ; // 0x78(0x08)
	struct FName ; // 0x80(0x04)
	int32_t ; // 0x84(0x04)
	struct FName ; // 0x88(0x04)
	struct FName ; // 0x8c(0x04)
	struct UAnimSequenceBase* ; // 0x90(0x08)
	struct UAnimSequenceBase* ; // 0x98(0x08)
	struct FName ; // 0xa0(0x04)
	char pad_A4[0x4]; // 0xa4(0x04)
	struct UAnimSequenceBase* ; // 0xa8(0x08)
	float ; // 0xb0(0x04)
	char pad_B4[0x4]; // 0xb4(0x04)
	struct UAnimSequenceBase* ; // 0xb8(0x08)
	struct FName ; // 0xc0(0x04)
	char pad_C4[0x4]; // 0xc4(0x04)
	struct UAnimSequenceBase* ; // 0xc8(0x08)
	struct UAnimSequenceBase* ; // 0xd0(0x08)
	struct FName ; // 0xd8(0x04)
	struct FName ; // 0xdc(0x04)
	struct FName ; // 0xe0(0x04)
	char pad_E4[0x4]; // 0xe4(0x04)
	struct UAnimSequenceBase* ; // 0xe8(0x08)
	bool ; // 0xf0(0x01)
	char pad_F1[0x7]; // 0xf1(0x07)
	struct UAnimSequenceBase* ; // 0xf8(0x08)
	struct TArray<float> ; // 0x100(0x10)
	struct FName ; // 0x110(0x04)
	char pad_114[0x4]; // 0x114(0x04)
	struct UAnimSequenceBase* ; // 0x118(0x08)
	float ; // 0x120(0x04)
	struct FInputScaleBiasClampConstants ; // 0x124(0x2c)
	float ; // 0x150(0x04)
	char pad_154[0x4]; // 0x154(0x04)
	struct UAnimSequenceBase* ; // 0x158(0x08)
	enum class EAnimSyncMethod ; // 0x160(0x01)
	enum class EAnimGroupRole ; // 0x161(0x01)
	char pad_162[0x6]; // 0x162(0x06)
	struct UBlendProfile* ; // 0x168(0x08)
	struct UCurveFloat* ; // 0x170(0x08)
	bool ; // 0x178(0x01)
	enum class EAlphaBlendOption ; // 0x179(0x01)
	enum class EBlendListTransitionType ; // 0x17a(0x01)
	char pad_17B[0x5]; // 0x17b(0x05)
	struct TArray<float> ; // 0x180(0x10)
	struct FName ; // 0x190(0x04)
	struct FName ; // 0x194(0x04)
	struct FName ; // 0x198(0x04)
	struct FName ; // 0x19c(0x04)
	struct FName ; // 0x1a0(0x04)
	struct FName ; // 0x1a4(0x04)
	struct FName ; // 0x1a8(0x04)
	struct FName ; // 0x1ac(0x04)
	struct FAnimNodeFunctionRef ; // 0x1b0(0x18)
	struct FName ; // 0x1c8(0x04)
	struct FName ; // 0x1cc(0x04)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x1d0(0x80)
	struct FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0x250(0x18)
};

