// AnimBlueprintGeneratedClass Galileo_LobsterLayerAnimBP.Galileo_LobsterLayerAnimBP_C
// Size: 0x1db0 (Inherited: 0x4e0)
struct UGalileo_LobsterLayerAnimBP_C : UFortItemLayerAnimInstance_Lobster {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x4e0(0x08)
	struct FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x4e8(0x50)
	struct FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x538(0x08)
	struct FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x540(0x08)
	struct FAnimNode_Root ; // 0x548(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x568(0xc0)
	struct FAnimNode_Root ; // 0x628(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x648(0xc0)
	struct FAnimNode_Root ; // 0x708(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x728(0xc0)
	struct FAnimNode_LinkedInputPose ; // 0x7e8(0xc0)
	struct FAnimNode_Root ; // 0x8a8(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x8c8(0xc0)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x988(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x9a8(0x128)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0xad0(0x20)
	struct FAnimNode_Root ; // 0xaf0(0x20)
	struct FAnimNode_LinkedInputPose ; // 0xb10(0xc0)
	struct FAnimNode_TransitionResult ; // 0xbd0(0x28)
	struct FAnimNode_TransitionResult ; // 0xbf8(0x28)
	struct FAnimNode_TransitionResult ; // 0xc20(0x28)
	struct FAnimNode_TransitionResult ; // 0xc48(0x28)
	struct FAnimNode_TransitionResult ; // 0xc70(0x28)
	struct FAnimNode_TransitionResult ; // 0xc98(0x28)
	struct FAnimNode_TransitionResult ; // 0xcc0(0x28)
	struct FAnimNode_TransitionResult ; // 0xce8(0x28)
	struct FAnimNode_TransitionResult ; // 0xd10(0x28)
	struct FAnimNode_TransitionResult ; // 0xd38(0x28)
	struct FAnimNode_TransitionResult ; // 0xd60(0x28)
	struct FAnimNode_TransitionResult ; // 0xd88(0x28)
	struct FAnimNode_TransitionResult ; // 0xdb0(0x28)
	struct FAnimNode_TransitionResult ; // 0xdd8(0x28)
	struct FAnimNode_TransitionResult ; // 0xe00(0x28)
	struct FAnimNode_TransitionResult ; // 0xe28(0x28)
	struct FAnimNode_TransitionResult ; // 0xe50(0x28)
	struct FAnimNode_TransitionResult ; // 0xe78(0x28)
	struct FAnimNode_TransitionResult ; // 0xea0(0x28)
	struct FAnimNode_TransitionResult ; // 0xec8(0x28)
	struct FAnimNode_TransitionResult ; // 0xef0(0x28)
	struct FAnimNode_TransitionResult ; // 0xf18(0x28)
	struct FAnimNode_TransitionResult ; // 0xf40(0x28)
	struct FAnimNode_TransitionResult ; // 0xf68(0x28)
	struct FAnimNode_SequencePlayer ; // 0xf90(0x40)
	struct FAnimNode_StateResult ; // 0xfd0(0x20)
	struct FAnimNode_SequencePlayer ; // 0xff0(0x40)
	struct FAnimNode_StateResult ; // 0x1030(0x20)
	struct FAnimNode_SequencePlayer ; // 0x1050(0x40)
	struct FAnimNode_StateResult ; // 0x1090(0x20)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x10b0(0x28)
	struct FAnimNode_SequencePlayer ; // 0x10d8(0x40)
	struct FAnimNode_StateResult ; // 0x1118(0x20)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x1138(0x28)
	struct FAnimNode_StateResult ; // 0x1160(0x20)
	struct FAnimNode_SequencePlayer ; // 0x1180(0x40)
	struct FAnimNode_StateResult ; // 0x11c0(0x20)
	struct FAnimNode_SequencePlayer ; // 0x11e0(0x40)
	struct FAnimNode_StateResult ; // 0x1220(0x20)
	struct FAnimNode_SequencePlayer ; // 0x1240(0x40)
	struct FAnimNode_StateResult ; // 0x1280(0x20)
	struct FAnimNode_SequencePlayer ; // 0x12a0(0x40)
	struct FAnimNode_StateResult ; // 0x12e0(0x20)
	struct FAnimNode_SequencePlayer ; // 0x1300(0x40)
	struct FAnimNode_StateResult ; // 0x1340(0x20)
	struct FAnimNode_SequencePlayer ; // 0x1360(0x40)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x13a0(0x20)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x13c0(0xc8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x1488(0x100)
	struct FAnimNode_Root ; // 0x1588(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x15a8(0xc0)
	struct FAnimNode_Root ; // 0x1668(0x20)
	struct FAnimNode_SequencePlayer ; // 0x1688(0x40)
	struct FAnimNode_BlendListByBool ; // 0x16c8(0x48)
	struct FAnimNode_SequencePlayer ; // 0x1710(0x40)
	struct FAnimNode_Root ; // 0x1750(0x20)
	struct FAnimNode_SequencePlayer ; // 0x1770(0x40)
	struct FAnimNode_BlendListByBool ; // 0x17b0(0x48)
	struct FAnimNode_SequencePlayer ; // 0x17f8(0x40)
	struct FAnimNode_Root ; // 0x1838(0x20)
	struct FAnimNode_SequencePlayer ; // 0x1858(0x40)
	struct FAnimNode_SequencePlayer ; // 0x1898(0x40)
	struct FAnimNode_BlendListByBool ; // 0x18d8(0x48)
	struct FAnimNode_Root ; // 0x1920(0x20)
	struct FAnimNode_Root ; // 0x1940(0x20)
	struct FAnimNode_Root ; // 0x1960(0x20)
	struct FAnimNode_SequencePlayer ; // 0x1980(0x40)
	struct FAnimNode_SequencePlayer ; // 0x19c0(0x40)
	struct FAnimNode_BlendListByBool ; // 0x1a00(0x48)
	struct FAnimNode_Root ; // 0x1a48(0x20)
	struct FAnimNode_SequencePlayer ; // 0x1a68(0x40)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1aa8(0x40)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1ae8(0x48)
	struct FAnimNode_Root ; // 0x1b30(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x1b50(0xc0)
	struct FAnimNode_Root ; // 0x1c10(0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1c30(0xc0)
	struct FAnimNode_Root ; // 0x1cf0(0x20)
	struct FAnimNode_Root ; // 0x1d10(0x20)
	struct FAnimNode_Root ; // 0x1d30(0x20)
	struct FAnimNode_Root ; // 0x1d50(0x20)
	struct FAnimNode_Root ; // 0x1d70(0x20)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x1d90(0x20)

	void ItemPreIK(struct FPoseLink InPose_PreIK, struct FPoseLink& ItemPreIK); // Function Galileo_LobsterLayerAnimBP.Galileo_LobsterLayerAnimBP_C.ItemPreIK // (HasOutParms|BlueprintCallable) // @ game+0xdef49c
	void ItemFullBodyOverride(struct FPoseLink InPoseFullBody, struct FPoseLink& ItemFullBodyOverride); // Function Galileo_LobsterLayerAnimBP.Galileo_LobsterLayerAnimBP_C.ItemFullBodyOverride // (HasOutParms|BlueprintCallable) // @ game+0xdef49c
	void ItemAimOffset(struct FPoseLink InPose_AimOffset, double AimOffsetAlpha, double Yaw, double Pitch, struct FPoseLink InPose_UpperLowerPreMeleeAO, struct FPoseLink& ItemAimOffset); // Function Galileo_LobsterLayerAnimBP.Galileo_LobsterLayerAnimBP_C.ItemAimOffset // (HasOutParms|BlueprintCallable) // @ game+0xdef49c
	void ItemSkeletalControl(struct FPoseLink InPose, struct FPoseLink& ItemSkeletalControl); // Function Galileo_LobsterLayerAnimBP.Galileo_LobsterLayerAnimBP_C.ItemSkeletalControl // (HasOutParms|BlueprintCallable) // @ game+0xdef49c
	void ItemUpperBody(struct FPoseLink InPoseUpperBody, struct FFortAnimInput_AdjustedAim InputParam, struct FPoseLink& ItemUpperBody); // Function Galileo_LobsterLayerAnimBP.Galileo_LobsterLayerAnimBP_C.ItemUpperBody // (HasOutParms|BlueprintCallable) // @ game+0xdef49c
	void ItemFullBodySprint(struct FPoseLink InPoseSprint, struct FPoseLink& ItemFullBodySprint); // Function Galileo_LobsterLayerAnimBP.Galileo_LobsterLayerAnimBP_C.ItemFullBodySprint // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xdef49c
	void ItemIdleAdditive(struct FPoseLink InPoseIdleAdditive, struct FPoseLink& ItemIdleAdditive); // Function Galileo_LobsterLayerAnimBP.Galileo_LobsterLayerAnimBP_C.ItemIdleAdditive // (HasOutParms|BlueprintCallable) // @ game+0xdef49c
	void ItemCrouchTurningAdditive(struct FPoseLink& ItemCrouchTurningAdditive); // Function Galileo_LobsterLayerAnimBP.Galileo_LobsterLayerAnimBP_C.ItemCrouchTurningAdditive // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xdef49c
	void ItemSlopeSliding(struct FPoseLink& ItemSlopeSliding); // Function Galileo_LobsterLayerAnimBP.Galileo_LobsterLayerAnimBP_C.ItemSlopeSliding // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xdef49c
	void ItemJumpUpAdditive(struct FPoseLink& ItemJumpUpAdditive); // Function Galileo_LobsterLayerAnimBP.Galileo_LobsterLayerAnimBP_C.ItemJumpUpAdditive // (HasOutParms|BlueprintCallable) // @ game+0xdef49c
	void ItemJumpLoopAdditive(struct FPoseLink& ItemJumpLoopAdditive); // Function Galileo_LobsterLayerAnimBP.Galileo_LobsterLayerAnimBP_C.ItemJumpLoopAdditive // (HasOutParms|BlueprintCallable) // @ game+0xdef49c
	void ItemFallAdditive(struct FPoseLink& ItemFallAdditive); // Function Galileo_LobsterLayerAnimBP.Galileo_LobsterLayerAnimBP_C.ItemFallAdditive // (HasOutParms|BlueprintCallable) // @ game+0xdef49c
	void ItemFallLandAdditive(struct FPoseLink& ItemFallLandAdditive); // Function Galileo_LobsterLayerAnimBP.Galileo_LobsterLayerAnimBP_C.ItemFallLandAdditive // (HasOutParms|BlueprintCallable) // @ game+0xdef49c
	void ItemJetPackStartAdditive(struct FPoseLink& ItemJetPackStartAdditive); // Function Galileo_LobsterLayerAnimBP.Galileo_LobsterLayerAnimBP_C.ItemJetPackStartAdditive // (HasOutParms|BlueprintCallable) // @ game+0xdef49c
	void ItemJetPackJumpAdditive(struct FPoseLink& ItemJetPackJumpAdditive); // Function Galileo_LobsterLayerAnimBP.Galileo_LobsterLayerAnimBP_C.ItemJetPackJumpAdditive // (HasOutParms|BlueprintCallable) // @ game+0xdef49c
	void ItemZipLineStartAdditive(struct FPoseLink& ItemZipLineStartAdditive); // Function Galileo_LobsterLayerAnimBP.Galileo_LobsterLayerAnimBP_C.ItemZipLineStartAdditive // (HasOutParms|BlueprintCallable) // @ game+0xdef49c
	void ItemFlyModeStartAdditive(struct FPoseLink& ItemFlyModeStartAdditive); // Function Galileo_LobsterLayerAnimBP.Galileo_LobsterLayerAnimBP_C.ItemFlyModeStartAdditive // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xdef49c
	void ItemFlyModeLoopAdditive(struct FPoseLink& ItemFlyModeLoopAdditive); // Function Galileo_LobsterLayerAnimBP.Galileo_LobsterLayerAnimBP_C.ItemFlyModeLoopAdditive // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xdef49c
	void ItemJogStartAdditive(struct FPoseLink InPoseJogStartAdditive, struct FPoseLink& ItemJogStartAdditive); // Function Galileo_LobsterLayerAnimBP.Galileo_LobsterLayerAnimBP_C.ItemJogStartAdditive // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xdef49c
	void ItemJogStopAdditive(struct FPoseLink InPoseJogStopAdditive, struct FPoseLink& ItemJogStopAdditive); // Function Galileo_LobsterLayerAnimBP.Galileo_LobsterLayerAnimBP_C.ItemJogStopAdditive // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xdef49c
	void ItemJogPrePivotAdditive(struct FPoseLink InPosePrePivotAdditive, struct FPoseLink& ItemJogPrePivotAdditive); // Function Galileo_LobsterLayerAnimBP.Galileo_LobsterLayerAnimBP_C.ItemJogPrePivotAdditive // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xdef49c
	void ItemJogPostPivotAdditive(struct FPoseLink InPosePostPivotAdditive, struct FPoseLink& ItemJogPostPivotAdditive); // Function Galileo_LobsterLayerAnimBP.Galileo_LobsterLayerAnimBP_C.ItemJogPostPivotAdditive // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xdef49c
	void ItemLowerBodyMovement(struct FPoseLink InPoseLowerBodyMovement, struct FPoseLink& ItemLowerBodyMovement); // Function Galileo_LobsterLayerAnimBP.Galileo_LobsterLayerAnimBP_C.ItemLowerBodyMovement // (HasOutParms|BlueprintCallable) // @ game+0xdef49c
	void ItemLowerBodyLeanAdditive(struct FPoseLink InPoseLowerBodyLeanAdditive, struct FPoseLink& ItemLowerBodyLeanAdditive); // Function Galileo_LobsterLayerAnimBP.Galileo_LobsterLayerAnimBP_C.ItemLowerBodyLeanAdditive // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xdef49c
	void ItemLowerBodyJogStart(struct FPoseLink InPoseLowerBodyJogStart, struct FPoseLink& ItemLowerBodyJogStart); // Function Galileo_LobsterLayerAnimBP.Galileo_LobsterLayerAnimBP_C.ItemLowerBodyJogStart // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xdef49c
	void ItemLowerBodyJogStop(struct FPoseLink InPoseLowerBodyJogStop, struct FPoseLink& ItemLowerBodyJogStop); // Function Galileo_LobsterLayerAnimBP.Galileo_LobsterLayerAnimBP_C.ItemLowerBodyJogStop // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xdef49c
	void ItemLowerBodyJogPrePivot(struct FPoseLink InPoseLowerBodyJogPrePivot, struct FPoseLink& ItemLowerBodyJogPrePivot); // Function Galileo_LobsterLayerAnimBP.Galileo_LobsterLayerAnimBP_C.ItemLowerBodyJogPrePivot // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xdef49c
	void ItemLowerBodyJogPostPivot(struct FPoseLink InPoseLowerBodyJogPostPivot, struct FPoseLink& ItemLowerBodyJogPostPivot); // Function Galileo_LobsterLayerAnimBP.Galileo_LobsterLayerAnimBP_C.ItemLowerBodyJogPostPivot // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xdef49c
	void ItemRelaxedEntry(struct FPoseLink InPoseRelaxedEntry, struct FPoseLink& ItemRelaxedEntry); // Function Galileo_LobsterLayerAnimBP.Galileo_LobsterLayerAnimBP_C.ItemRelaxedEntry // (HasOutParms|BlueprintCallable) // @ game+0xdef49c
	void ItemSwimJumpStart(struct FPoseLink& ItemSwimJumpStart); // Function Galileo_LobsterLayerAnimBP.Galileo_LobsterLayerAnimBP_C.ItemSwimJumpStart // (HasOutParms|BlueprintCallable) // @ game+0xdef49c
	void ItemSwimJumpStartLoop(struct FPoseLink& ItemSwimJumpStartLoop); // Function Galileo_LobsterLayerAnimBP.Galileo_LobsterLayerAnimBP_C.ItemSwimJumpStartLoop // (HasOutParms|BlueprintCallable) // @ game+0xdef49c
	void ItemSwimJumpFallLoop(struct FPoseLink& ItemSwimJumpFallLoop); // Function Galileo_LobsterLayerAnimBP.Galileo_LobsterLayerAnimBP_C.ItemSwimJumpFallLoop // (HasOutParms|BlueprintCallable) // @ game+0xdef49c
	void ItemSwimJumpSurfaceLoop(struct FPoseLink& ItemSwimJumpSurfaceLoop); // Function Galileo_LobsterLayerAnimBP.Galileo_LobsterLayerAnimBP_C.ItemSwimJumpSurfaceLoop // (HasOutParms|BlueprintCallable) // @ game+0xdef49c
	void ItemSwimJumpSurfaceEnd(struct FPoseLink& ItemSwimJumpSurfaceEnd); // Function Galileo_LobsterLayerAnimBP.Galileo_LobsterLayerAnimBP_C.ItemSwimJumpSurfaceEnd // (HasOutParms|BlueprintCallable) // @ game+0xdef49c
	void AnimGraph(struct FPoseLink& AnimGraph); // Function Galileo_LobsterLayerAnimBP.Galileo_LobsterLayerAnimBP_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xdef49c
	void ExecuteUbergraph_Galileo_LobsterLayerAnimBP(int32_t EntryPoint); // Function Galileo_LobsterLayerAnimBP.Galileo_LobsterLayerAnimBP_C.ExecuteUbergraph_Galileo_LobsterLayerAnimBP // (Final|UbergraphFunction) // @ game+0xdef49c
};

