// WidgetBlueprintGeneratedClass LockedOnReticleWidget.LockedOnReticleWidget_C
// Size: 0x2a8 (Inherited: 0x268)
struct ULockedOnReticleWidget_C : UUserWidget {
	struct UImage* Reticle_LockedOn; // 0x268(0x08)
	struct UImage* Reticle_LockedOn_CenterdotShadow; // 0x270(0x08)
	struct UImage* Reticle_LockedOn_Glow; // 0x278(0x08)
	struct UImage* Reticle_LockedOn_Growth; // 0x280(0x08)
	struct UImage* Reticle_LockedOn_Pulse; // 0x288(0x08)
	struct UImage* Reticle_LockedOn_SecondaryRings; // 0x290(0x08)
	struct UImage* Reticle_LockedOn_Shadow_Overall; // 0x298(0x08)
	struct UImage* Reticle_LockedOn_Shadow_Rings; // 0x2a0(0x08)
};

