// WidgetBlueprintGeneratedClass LoginCredentialSelect.LoginCredentialSelect_C
// Size: 0x468 (Inherited: 0x400)
struct ULoginCredentialSelect_C : UFortLoginCredentialSelect {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x400(0x08)
	struct UCommonWidgetSwitcherLegacy* ; // 0x408(0x08)
	struct UCommonTextBlock* Erebus_Title; // 0x410(0x08)
	struct UCommonTextBlock* ErebusType; // 0x418(0x08)
	struct UImage* ; // 0x420(0x08)
	struct UImage* ; // 0x428(0x08)
	struct UImage* ; // 0x430(0x08)
	struct UImage* ; // 0x438(0x08)
	struct UImage* ; // 0x440(0x08)
	struct UImage* ; // 0x448(0x08)
	struct UImage* ; // 0x450(0x08)
	struct USafeZone* ; // 0x458(0x08)
	struct UBorder* TrademarksBorder; // 0x460(0x08)

	void Construct(); // Function LoginCredentialSelect.LoginCredentialSelect_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0xdef49c
	void ExecuteUbergraph_LoginCredentialSelect(int32_t EntryPoint); // Function LoginCredentialSelect.LoginCredentialSelect_C.ExecuteUbergraph_LoginCredentialSelect // (Final|UbergraphFunction) // @ game+0xdef49c
};

