// ScriptStruct MiniShieldPotion_Prop_AnimBP.MiniShieldPotion_Prop_AnimBP_C.AnimBlueprintGeneratedConstantData
// Size: 0xd0 (Inherited: 0x01)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData {
	char pad_1[0x3]; // 0x01(0x03)
	struct FName ; // 0x04(0x04)
	struct FAnimNodeFunctionRef ; // 0x08(0x18)
	enum class ESequenceEvalReinit ; // 0x20(0x01)
	bool ; // 0x21(0x01)
	char pad_22[0x2]; // 0x22(0x02)
	float ; // 0x24(0x04)
	struct UAnimSequenceBase* ; // 0x28(0x08)
	bool ; // 0x30(0x01)
	enum class EAnimSyncMethod ; // 0x31(0x01)
	enum class EAnimGroupRole ; // 0x32(0x01)
	char pad_33[0x1]; // 0x33(0x01)
	struct FName ; // 0x34(0x04)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x38(0x80)
	struct FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0xb8(0x18)
};

