// ScriptStruct MountedCannon_Gunner_AnimBP.MountedCannon_Gunner_AnimBP_C.AnimBlueprintGeneratedConstantData
// Size: 0x140 (Inherited: 0x01)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData {
	char pad_1[0x3]; // 0x01(0x03)
	struct FName ; // 0x04(0x04)
	struct UAnimSequenceBase* ; // 0x08(0x08)
	struct UBlendProfile* ; // 0x10(0x08)
	struct UCurveFloat* ; // 0x18(0x08)
	enum class EAlphaBlendOption ; // 0x20(0x01)
	enum class EBlendListTransitionType ; // 0x21(0x01)
	char pad_22[0x6]; // 0x22(0x06)
	struct TArray<float> ; // 0x28(0x10)
	struct TArray<int32_t> ; // 0x38(0x10)
	struct FAnimNodeFunctionRef ; // 0x48(0x18)
	bool ; // 0x60(0x01)
	char pad_61[0x3]; // 0x61(0x03)
	float ; // 0x64(0x04)
	struct FInputScaleBiasClampConstants ; // 0x68(0x2c)
	float ; // 0x94(0x04)
	struct UAnimSequenceBase* ; // 0x98(0x08)
	bool ; // 0xa0(0x01)
	enum class EAnimSyncMethod ; // 0xa1(0x01)
	enum class EAnimGroupRole ; // 0xa2(0x01)
	char pad_A3[0x1]; // 0xa3(0x01)
	struct FName ; // 0xa4(0x04)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0xa8(0x80)
	struct FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0x128(0x18)
};

// ScriptStruct MountedCannon_Gunner_AnimBP.MountedCannon_Gunner_AnimBP_C.AnimBlueprintGeneratedMutableData
// Size: 0x02 (Inherited: 0x01)
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData {
	char __ByteProperty; // 0x01(0x01)
};

