// ScriptStruct MountedTurret_Gunner_AnimBP.MountedTurret_Gunner_AnimBP_C.AnimBlueprintGeneratedConstantData
// Size: 0x160 (Inherited: 0x01)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData {
	char pad_1[0x3]; // 0x01(0x03)
	struct FName ; // 0x04(0x04)
	enum class ESequenceEvalReinit ; // 0x08(0x01)
	char pad_9[0x7]; // 0x09(0x07)
	struct UAnimSequenceBase* ; // 0x10(0x08)
	struct UBlendProfile* ; // 0x18(0x08)
	struct UCurveFloat* ; // 0x20(0x08)
	enum class EAlphaBlendOption ; // 0x28(0x01)
	enum class EBlendListTransitionType ; // 0x29(0x01)
	char pad_2A[0x6]; // 0x2a(0x06)
	struct TArray<float> ; // 0x30(0x10)
	struct TArray<int32_t> ; // 0x40(0x10)
	struct FInputScaleBiasClampConstants ; // 0x50(0x2c)
	char pad_7C[0x4]; // 0x7c(0x04)
	struct UAnimSequenceBase* ; // 0x80(0x08)
	struct UBlendSpace* ; // 0x88(0x08)
	float ; // 0x90(0x04)
	bool ; // 0x94(0x01)
	char pad_95[0x3]; // 0x95(0x03)
	float ; // 0x98(0x04)
	bool ; // 0x9c(0x01)
	enum class EAnimSyncMethod ; // 0x9d(0x01)
	enum class EAnimGroupRole ; // 0x9e(0x01)
	char pad_9F[0x1]; // 0x9f(0x01)
	struct FName ; // 0xa0(0x04)
	char pad_A4[0x4]; // 0xa4(0x04)
	struct FAnimNodeFunctionRef ; // 0xa8(0x18)
	enum class ERefPoseType ; // 0xc0(0x01)
	char pad_C1[0x7]; // 0xc1(0x07)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0xc8(0x80)
	struct FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0x148(0x18)
};

// ScriptStruct MountedTurret_Gunner_AnimBP.MountedTurret_Gunner_AnimBP_C.AnimBlueprintGeneratedMutableData
// Size: 0x14 (Inherited: 0x01)
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData {
	char pad_1[0x3]; // 0x01(0x03)
	float __FloatProperty; // 0x04(0x04)
	char ; // 0x08(0x01)
	char pad_9[0x3]; // 0x09(0x03)
	float ; // 0x0c(0x04)
	float ; // 0x10(0x04)
};

