// AnimBlueprintGeneratedClass OctopusVehicle_Driver_AnimBP.OctopusVehicle_Driver_AnimBP_C
// Size: 0x3b98 (Inherited: 0x1f70)
struct UOctopusVehicle_Driver_AnimBP_C : UFortPlayerAnimInstance_OctopusDriver {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x1f70(0x08)
	struct FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x1f78(0x20)
	struct FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x1f98(0x08)
	struct FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x1fa0(0x08)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x1fa8(0x20)
	struct FAnimNode_ModifyBone ; // 0x1fc8(0x128)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x20f0(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x2110(0x20)
	struct FAnimNode_BlendSpacePlayer ; // 0x2130(0x68)
	struct FAnimNode_ApplyAdditive ; // 0x2198(0xc8)
	struct FAnimNode_TransitionResult ; // 0x2260(0x28)
	struct FAnimNode_TransitionResult ; // 0x2288(0x28)
	struct FAnimNode_TransitionResult ; // 0x22b0(0x28)
	struct FAnimNode_TransitionResult ; // 0x22d8(0x28)
	struct FAnimNode_TransitionResult ; // 0x2300(0x28)
	struct FAnimNode_TransitionResult ; // 0x2328(0x28)
	struct FAnimNode_TransitionResult ; // 0x2350(0x28)
	struct FAnimNode_TransitionResult ; // 0x2378(0x28)
	struct FAnimNode_TransitionResult ; // 0x23a0(0x28)
	struct FAnimNode_SequencePlayer ; // 0x23c8(0x40)
	struct FAnimNode_StateResult ; // 0x2408(0x20)
	struct FAnimNode_SequencePlayer ; // 0x2428(0x40)
	struct FAnimNode_StateResult ; // 0x2468(0x20)
	struct FAnimNode_SequencePlayer ; // 0x2488(0x40)
	struct FAnimNode_StateResult ; // 0x24c8(0x20)
	struct FAnimNode_SequencePlayer ; // 0x24e8(0x40)
	struct FAnimNode_StateResult ; // 0x2528(0x20)
	struct FAnimNode_ApplyAdditive ; // 0x2548(0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x2610(0x68)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2678(0x48)
	struct FAnimNode_SequencePlayer ; // 0x26c0(0x40)
	struct FAnimNode_SequencePlayer ; // 0x2700(0x40)
	struct FAnimNode_StateResult ; // 0x2740(0x20)
	struct FAnimNode_StateMachine ; // 0x2760(0xc8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x2828(0x100)
	struct FAnimNode_TransitionResult ; // 0x2928(0x28)
	struct FAnimNode_TransitionResult ; // 0x2950(0x28)
	struct FAnimNode_TransitionResult ; // 0x2978(0x28)
	struct FAnimNode_TransitionResult ; // 0x29a0(0x28)
	struct FAnimNode_TransitionResult ; // 0x29c8(0x28)
	struct FAnimNode_TransitionResult ; // 0x29f0(0x28)
	struct FAnimNode_TransitionResult ; // 0x2a18(0x28)
	struct FAnimNode_TransitionResult ; // 0x2a40(0x28)
	struct FAnimNode_TransitionResult ; // 0x2a68(0x28)
	struct FAnimNode_TransitionResult ; // 0x2a90(0x28)
	struct FAnimNode_TransitionResult ; // 0x2ab8(0x28)
	struct FAnimNode_TransitionResult ; // 0x2ae0(0x28)
	struct FAnimNode_TransitionResult ; // 0x2b08(0x28)
	struct FAnimNode_TransitionResult ; // 0x2b30(0x28)
	struct FAnimNode_TransitionResult ; // 0x2b58(0x28)
	struct FAnimNode_TransitionResult ; // 0x2b80(0x28)
	struct FAnimNode_TransitionResult ; // 0x2ba8(0x28)
	struct FAnimNode_TransitionResult ; // 0x2bd0(0x28)
	struct FAnimNode_TransitionResult ; // 0x2bf8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2c20(0x28)
	struct FAnimNode_SequencePlayer ; // 0x2c48(0x40)
	struct FAnimNode_StateResult ; // 0x2c88(0x20)
	struct FAnimNode_SequencePlayer ; // 0x2ca8(0x40)
	struct FAnimNode_StateResult ; // 0x2ce8(0x20)
	struct FAnimNode_SequencePlayer ; // 0x2d08(0x40)
	struct FAnimNode_StateResult ; // 0x2d48(0x20)
	struct FAnimNode_UseCachedPose ; // 0x2d68(0x28)
	struct FAnimNode_StateResult ; // 0x2d90(0x20)
	struct FAnimNode_BlendListByEnum ; // 0x2db0(0x48)
	struct FAnimNode_SequencePlayer ; // 0x2df8(0x40)
	struct FAnimNode_SequencePlayer ; // 0x2e38(0x40)
	struct FAnimNode_SequencePlayer ; // 0x2e78(0x40)
	struct FAnimNode_SequencePlayer ; // 0x2eb8(0x40)
	struct FAnimNode_SequencePlayer ; // 0x2ef8(0x40)
	struct FAnimNode_BlendListByEnum ; // 0x2f38(0x48)
	struct FAnimNode_StateResult ; // 0x2f80(0x20)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x2fa0(0x28)
	struct FAnimNode_StateResult ; // 0x2fc8(0x20)
	struct FAnimNode_SequencePlayer ; // 0x2fe8(0x40)
	struct FAnimNode_StateResult ; // 0x3028(0x20)
	struct FAnimNode_SequencePlayer ; // 0x3048(0x40)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x3088(0x20)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x30a8(0xc8)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace; // 0x3170(0x110)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x3280(0xc8)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x3348(0x48)
	struct FAnimNode_SequencePlayer ; // 0x3390(0x40)
	struct FAnimNode_ModifyBone ; // 0x33d0(0x128)
	struct FAnimNode_ModifyBone ; // 0x34f8(0x128)
	struct FAnimNode_ModifyBone ; // 0x3620(0x128)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x3748(0x128)
	struct FAnimNode_LegIK ; // 0x3870(0xf8)
	struct FAnimNode_LegIK ; // 0x3968(0xf8)
	struct FAnimNode_LegIK AnimGraphNode_LegIK; // 0x3a60(0xf8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x3b58(0x40)

	void AnimGraph(struct FPoseLink& AnimGraph); // Function OctopusVehicle_Driver_AnimBP.OctopusVehicle_Driver_AnimBP_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xdef49c
	void ExecuteUbergraph_OctopusVehicle_Driver_AnimBP(int32_t EntryPoint); // Function OctopusVehicle_Driver_AnimBP.OctopusVehicle_Driver_AnimBP_C.ExecuteUbergraph_OctopusVehicle_Driver_AnimBP // (Final|UbergraphFunction) // @ game+0xdef49c
};

