// ScriptStruct OctopusVehicleAnimBP.OctopusVehicleAnimBP_C.AnimBlueprintGeneratedConstantData
// Size: 0x1f8 (Inherited: 0x01)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData {
	char pad_1[0x3]; // 0x01(0x03)
	struct FName ; // 0x04(0x04)
	float ; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
	struct UAnimSequenceBase* ; // 0x10(0x08)
	struct FName ; // 0x18(0x04)
	int32_t ; // 0x1c(0x04)
	struct UAnimSequenceBase* ; // 0x20(0x08)
	struct UAnimSequenceBase* ; // 0x28(0x08)
	struct UAnimSequenceBase* ; // 0x30(0x08)
	struct UAnimSequenceBase* ; // 0x38(0x08)
	struct TArray<float> ; // 0x40(0x10)
	struct TArray<int32_t> ; // 0x50(0x10)
	struct FName ; // 0x60(0x04)
	int32_t ; // 0x64(0x04)
	struct FName ; // 0x68(0x04)
	int32_t ; // 0x6c(0x04)
	struct UAnimSequenceBase* ; // 0x70(0x08)
	struct UAnimSequenceBase* ; // 0x78(0x08)
	struct FName ; // 0x80(0x04)
	int32_t ; // 0x84(0x04)
	struct UAnimSequenceBase* ; // 0x88(0x08)
	struct UBlendProfile* ; // 0x90(0x08)
	struct UCurveFloat* ; // 0x98(0x08)
	enum class EAlphaBlendOption ; // 0xa0(0x01)
	enum class EBlendListTransitionType ; // 0xa1(0x01)
	char pad_A2[0x6]; // 0xa2(0x06)
	struct TArray<float> ; // 0xa8(0x10)
	float ; // 0xb8(0x04)
	char pad_BC[0x4]; // 0xbc(0x04)
	struct UAnimSequenceBase* ; // 0xc0(0x08)
	struct FName ; // 0xc8(0x04)
	int32_t ; // 0xcc(0x04)
	struct UAnimSequenceBase* ; // 0xd0(0x08)
	struct FName ; // 0xd8(0x04)
	int32_t ; // 0xdc(0x04)
	struct FInputScaleBiasClampConstants ; // 0xe0(0x2c)
	char pad_10C[0x4]; // 0x10c(0x04)
	struct UAnimSequenceBase* ; // 0x110(0x08)
	struct FName ; // 0x118(0x04)
	int32_t ; // 0x11c(0x04)
	struct FName ; // 0x120(0x04)
	int32_t ; // 0x124(0x04)
	struct UBlendSpace* ; // 0x128(0x08)
	float ; // 0x130(0x04)
	bool ; // 0x134(0x01)
	char pad_135[0x3]; // 0x135(0x03)
	float ; // 0x138(0x04)
	bool ; // 0x13c(0x01)
	enum class EAnimSyncMethod ; // 0x13d(0x01)
	enum class EAnimGroupRole ; // 0x13e(0x01)
	char pad_13F[0x1]; // 0x13f(0x01)
	struct FName ; // 0x140(0x04)
	char pad_144[0x4]; // 0x144(0x04)
	struct FAnimNodeFunctionRef ; // 0x148(0x18)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x160(0x80)
	struct FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0x1e0(0x18)
};

// ScriptStruct OctopusVehicleAnimBP.OctopusVehicleAnimBP_C.AnimBlueprintGeneratedMutableData
// Size: 0x0c (Inherited: 0x01)
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData {
	char __ByteProperty; // 0x01(0x01)
	bool ; // 0x02(0x01)
	bool ; // 0x03(0x01)
	float ; // 0x04(0x04)
	float ; // 0x08(0x04)
};

