// ScriptStruct OctopusVehicle_Driver_AnimBP.OctopusVehicle_Driver_AnimBP_C.AnimBlueprintGeneratedConstantData
// Size: 0x278 (Inherited: 0x01)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData {
	char pad_1[0x3]; // 0x01(0x03)
	struct FName ; // 0x04(0x04)
	struct UBlendSpace* ; // 0x08(0x08)
	struct UAnimSequenceBase* ; // 0x10(0x08)
	struct FName ; // 0x18(0x04)
	char pad_1C[0x4]; // 0x1c(0x04)
	struct UAnimSequenceBase* ; // 0x20(0x08)
	struct FName ; // 0x28(0x04)
	struct FName ; // 0x2c(0x04)
	struct UAnimSequenceBase* ; // 0x30(0x08)
	struct FName ; // 0x38(0x04)
	char pad_3C[0x4]; // 0x3c(0x04)
	struct UBlendSpace* ; // 0x40(0x08)
	struct TArray<float> ; // 0x48(0x10)
	struct UAnimSequenceBase* ; // 0x58(0x08)
	struct UAnimSequenceBase* ; // 0x60(0x08)
	enum class EAnimSyncMethod ; // 0x68(0x01)
	char pad_69[0x3]; // 0x69(0x03)
	struct FName ; // 0x6c(0x04)
	float ; // 0x70(0x04)
	char pad_74[0x4]; // 0x74(0x04)
	struct UAnimSequenceBase* ; // 0x78(0x08)
	struct FName ; // 0x80(0x04)
	int32_t ; // 0x84(0x04)
	struct UAnimSequenceBase* ; // 0x88(0x08)
	struct FName ; // 0x90(0x04)
	int32_t ; // 0x94(0x04)
	float ; // 0x98(0x04)
	char pad_9C[0x4]; // 0x9c(0x04)
	struct UAnimSequenceBase* ; // 0xa0(0x08)
	struct FName ; // 0xa8(0x04)
	int32_t ; // 0xac(0x04)
	struct FName ; // 0xb0(0x04)
	int32_t ; // 0xb4(0x04)
	struct UAnimSequenceBase* ; // 0xb8(0x08)
	struct UAnimSequenceBase* ; // 0xc0(0x08)
	struct UAnimSequenceBase* ; // 0xc8(0x08)
	struct UAnimSequenceBase* ; // 0xd0(0x08)
	struct UAnimSequenceBase* ; // 0xd8(0x08)
	struct TArray<float> ; // 0xe0(0x10)
	struct TArray<int32_t> ; // 0xf0(0x10)
	struct FName ; // 0x100(0x04)
	int32_t ; // 0x104(0x04)
	struct FName ; // 0x108(0x04)
	int32_t ; // 0x10c(0x04)
	struct UAnimSequenceBase* ; // 0x110(0x08)
	struct FName ; // 0x118(0x04)
	int32_t ; // 0x11c(0x04)
	float ; // 0x120(0x04)
	char pad_124[0x4]; // 0x124(0x04)
	struct UAnimSequenceBase* ; // 0x128(0x08)
	struct FName ; // 0x130(0x04)
	int32_t ; // 0x134(0x04)
	struct UBlendSpace* ; // 0x138(0x08)
	struct UBlendProfile* ; // 0x140(0x08)
	struct UCurveFloat* ; // 0x148(0x08)
	enum class EAlphaBlendOption ; // 0x150(0x01)
	enum class EBlendListTransitionType ; // 0x151(0x01)
	char pad_152[0x6]; // 0x152(0x06)
	struct TArray<float> ; // 0x158(0x10)
	struct TArray<int32_t> ; // 0x168(0x10)
	struct UAnimSequenceBase* ; // 0x178(0x08)
	struct FAnimNodeFunctionRef ; // 0x180(0x18)
	bool ; // 0x198(0x01)
	char pad_199[0x3]; // 0x199(0x03)
	float ; // 0x19c(0x04)
	struct FInputScaleBiasClampConstants ; // 0x1a0(0x2c)
	float ; // 0x1cc(0x04)
	struct UAnimSequenceBase* ; // 0x1d0(0x08)
	bool ; // 0x1d8(0x01)
	enum class EAnimSyncMethod ; // 0x1d9(0x01)
	enum class EAnimGroupRole ; // 0x1da(0x01)
	char pad_1DB[0x1]; // 0x1db(0x01)
	struct FName ; // 0x1dc(0x04)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x1e0(0x80)
	struct FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0x260(0x18)
};

// ScriptStruct OctopusVehicle_Driver_AnimBP.OctopusVehicle_Driver_AnimBP_C.AnimBlueprintGeneratedMutableData
// Size: 0x1d (Inherited: 0x01)
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData {
	char pad_1[0x3]; // 0x01(0x03)
	float __FloatProperty; // 0x04(0x04)
	float ; // 0x08(0x04)
	float ; // 0x0c(0x04)
	bool ; // 0x10(0x01)
	char ; // 0x11(0x01)
	char ; // 0x12(0x01)
	char pad_13[0x1]; // 0x13(0x01)
	float ; // 0x14(0x04)
	float ; // 0x18(0x04)
	char ; // 0x1c(0x01)
};

