// ScriptStruct Pistol_Core_AnimBP.Pistol_Core_AnimBP_C.AnimBlueprintGeneratedConstantData
// Size: 0x100 (Inherited: 0x01)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData {
	char pad_1[0x3]; // 0x01(0x03)
	struct FName ; // 0x04(0x04)
	struct FAnimNodeFunctionRef ; // 0x08(0x18)
	bool ; // 0x20(0x01)
	char pad_21[0x3]; // 0x21(0x03)
	float ; // 0x24(0x04)
	struct FInputScaleBiasClampConstants ; // 0x28(0x2c)
	float ; // 0x54(0x04)
	struct UAnimSequenceBase* ; // 0x58(0x08)
	bool ; // 0x60(0x01)
	enum class EAnimSyncMethod ; // 0x61(0x01)
	enum class EAnimGroupRole ; // 0x62(0x01)
	char pad_63[0x1]; // 0x63(0x01)
	struct FName ; // 0x64(0x04)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x68(0x80)
	struct FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0xe8(0x18)
};

