// WidgetBlueprintGeneratedClass PlayedBeforeSelect.PlayedBeforeSelect_C
// Size: 0x420 (Inherited: 0x3d8)
struct UPlayedBeforeSelect_C : UFortPlayedBeforeSelect {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x3d8(0x08)
	struct UWidgetAnimation* Intro; // 0x3e0(0x08)
	struct UCommonTextBlock* ; // 0x3e8(0x08)
	struct UCommonTextBlock* ; // 0x3f0(0x08)
	struct UCommonWidgetSwitcherLegacy* CommonWidgetSwitcher_InviteOnly; // 0x3f8(0x08)
	struct UInviteEventTitle_C* InviteEventTitle; // 0x400(0x08)
	struct UWidgetSwitcher* LoginType_Switcher; // 0x408(0x08)
	struct USafeZone* ; // 0x410(0x08)
	struct USignInWidget_C* SignInWidget; // 0x418(0x08)

	void (); // Function PlayedBeforeSelect.PlayedBeforeSelect_C. // (BlueprintCallable|BlueprintEvent) // @ game+0xdef49c
	void ExecuteUbergraph_PlayedBeforeSelect(int32_t EntryPoint); // Function PlayedBeforeSelect.PlayedBeforeSelect_C.ExecuteUbergraph_PlayedBeforeSelect // (Final|UbergraphFunction) // @ game+0xdef49c
};

