// ScriptStruct Shotgun_leverAction_AnimBP.Shotgun_leverAction_AnimBP_C.AnimBlueprintGeneratedConstantData
// Size: 0xc0 (Inherited: 0x01)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData {
	char pad_1[0x3]; // 0x01(0x03)
	struct FName ; // 0x04(0x04)
	struct FName ; // 0x08(0x04)
	enum class ERefPoseType ; // 0x0c(0x01)
	char pad_D[0x3]; // 0x0d(0x03)
	struct FAnimNodeFunctionRef ; // 0x10(0x18)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x28(0x80)
	struct FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0xa8(0x18)
};

