// WidgetBlueprintGeneratedClass SidebarWhatAreTagsEditTagsTooltip.SidebarWhatAreTagsEditTagsTooltip_C
// Size: 0x3e8 (Inherited: 0x3a8)
struct USidebarWhatAreTagsEditTagsTooltip_C : UCommonActivatableWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x3a8(0x08)
	struct UWidgetAnimation* Outro; // 0x3b0(0x08)
	struct UWidgetAnimation* Pulse; // 0x3b8(0x08)
	struct UCommonRichTextBlock* ; // 0x3c0(0x08)
	struct UCommonRichTextBlock* ; // 0x3c8(0x08)
	struct UOnboardingTextInputActionButton_C* Dismiss_Button; // 0x3d0(0x08)
	struct UImage* Image_Arrow; // 0x3d8(0x08)
	struct UImage* ImageBurst; // 0x3e0(0x08)

	void Finished_403D1C044D946ADE029116801BEB88EB(); // Function SidebarWhatAreTagsEditTagsTooltip.SidebarWhatAreTagsEditTagsTooltip_C.Finished_403D1C044D946ADE029116801BEB88EB // (BlueprintCallable|BlueprintEvent) // @ game+0xdef49c
	void Finished_5D07487B49685BD47F6772925D8F43EB(); // Function SidebarWhatAreTagsEditTagsTooltip.SidebarWhatAreTagsEditTagsTooltip_C.Finished_5D07487B49685BD47F6772925D8F43EB // (BlueprintCallable|BlueprintEvent) // @ game+0xdef49c
	void BP_OnActivated(); // Function SidebarWhatAreTagsEditTagsTooltip.SidebarWhatAreTagsEditTagsTooltip_C.BP_OnActivated // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void BP_OnDeactivated(); // Function SidebarWhatAreTagsEditTagsTooltip.SidebarWhatAreTagsEditTagsTooltip_C.BP_OnDeactivated // (Event|Protected|BlueprintEvent) // @ game+0xdef49c
	void BndEvt__SidebarWhatAreTagsEditTagsTooltip_Dismiss_Button_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(struct UCommonButtonLegacy* Button); // Function SidebarWhatAreTagsEditTagsTooltip.SidebarWhatAreTagsEditTagsTooltip_C.BndEvt__SidebarWhatAreTagsEditTagsTooltip_Dismiss_Button_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature // (BlueprintEvent) // @ game+0xdef49c
	void ExecuteUbergraph_SidebarWhatAreTagsEditTagsTooltip(int32_t EntryPoint); // Function SidebarWhatAreTagsEditTagsTooltip.SidebarWhatAreTagsEditTagsTooltip_C.ExecuteUbergraph_SidebarWhatAreTagsEditTagsTooltip // (Final|UbergraphFunction) // @ game+0xdef49c
};

