// AnimBlueprintGeneratedClass SpicySake_Driver_LayerAnimBP.SpicySake_Driver_LayerAnimBP_C
// Size: 0x21b0 (Inherited: 0x460)
struct USpicySake_Driver_LayerAnimBP_C : UFortSpicySakeOccupantAnimInstanceLayer {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x460(0x08)
	struct FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x468(0x18)
	struct FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x480(0x08)
	struct FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x488(0x08)
	struct FAnimNode_Root ; // 0x490(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x4b0(0xc0)
	struct FAnimNode_Root ; // 0x570(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x590(0xc0)
	struct FAnimNode_TransitionResult ; // 0x650(0x28)
	struct FAnimNode_SequencePlayer ; // 0x678(0x40)
	struct FAnimNode_ApplyAdditive ; // 0x6b8(0xc8)
	struct FAnimNode_TransitionResult ; // 0x780(0x28)
	struct FAnimNode_SequencePlayer ; // 0x7a8(0x40)
	struct FAnimNode_StateResult ; // 0x7e8(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x808(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x828(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x848(0x128)
	struct FAnimNode_UseCachedPose ; // 0x970(0x28)
	struct FAnimNode_LayeredBoneBlend ; // 0x998(0xe0)
	struct FAnimNode_BlendSpacePlayer ; // 0xa78(0x68)
	struct FAnimNode_StateResult ; // 0xae0(0x20)
	struct FAnimNode_StateMachine ; // 0xb00(0xc8)
	struct FAnimNode_BlendListByBool ; // 0xbc8(0x48)
	struct FAnimNode_TransitionResult ; // 0xc10(0x28)
	struct FAnimNode_TransitionResult ; // 0xc38(0x28)
	struct FAnimNode_TransitionResult ; // 0xc60(0x28)
	struct FAnimNode_TransitionResult ; // 0xc88(0x28)
	struct FAnimNode_TransitionResult ; // 0xcb0(0x28)
	struct FAnimNode_TransitionResult ; // 0xcd8(0x28)
	struct FAnimNode_TransitionResult ; // 0xd00(0x28)
	struct FAnimNode_TransitionResult ; // 0xd28(0x28)
	struct FAnimNode_TransitionResult ; // 0xd50(0x28)
	struct FAnimNode_TransitionResult ; // 0xd78(0x28)
	struct FAnimNode_TransitionResult ; // 0xda0(0x28)
	struct FAnimNode_TransitionResult ; // 0xdc8(0x28)
	struct FAnimNode_TransitionResult ; // 0xdf0(0x28)
	struct FAnimNode_TransitionResult ; // 0xe18(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xe40(0x28)
	struct FAnimNode_SequencePlayer ; // 0xe68(0x40)
	struct FAnimNode_StateResult ; // 0xea8(0x20)
	struct FAnimNode_SequencePlayer ; // 0xec8(0x40)
	struct FAnimNode_StateResult ; // 0xf08(0x20)
	struct FAnimNode_SequencePlayer ; // 0xf28(0x40)
	struct FAnimNode_StateResult ; // 0xf68(0x20)
	struct FAnimNode_SequencePlayer ; // 0xf88(0x40)
	struct FAnimNode_StateResult ; // 0xfc8(0x20)
	struct FAnimNode_SequencePlayer ; // 0xfe8(0x40)
	struct FAnimNode_StateResult ; // 0x1028(0x20)
	struct FAnimNode_SequencePlayer ; // 0x1048(0x40)
	struct FAnimNode_StateResult ; // 0x1088(0x20)
	struct FAnimNode_SequencePlayer ; // 0x10a8(0x40)
	struct FAnimNode_BlendListByBool ; // 0x10e8(0x48)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x1130(0x68)
	struct FAnimNode_StateResult ; // 0x1198(0x20)
	struct FAnimNode_StateMachine ; // 0x11b8(0xc8)
	struct FAnimNode_StateResult ; // 0x1280(0x20)
	struct FAnimNode_SequencePlayer ; // 0x12a0(0x40)
	struct FAnimNode_BlendListByBool ; // 0x12e0(0x48)
	struct FAnimNode_SequencePlayer ; // 0x1328(0x40)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1368(0x20)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x1388(0xc8)
	struct FAnimNode_ApplyAdditive ; // 0x1450(0xc8)
	struct FAnimNode_SequencePlayer ; // 0x1518(0x40)
	struct FAnimNode_ApplyAdditive ; // 0x1558(0xc8)
	struct FAnimNode_SaveCachedPose ; // 0x1620(0x100)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x1720(0xc8)
	struct FAnimNode_SequencePlayer ; // 0x17e8(0x40)
	struct FAnimNode_BlendListByBool ; // 0x1828(0x48)
	struct FAnimNode_UseCachedPose ; // 0x1870(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x1898(0x100)
	struct FAnimNode_UseCachedPose ; // 0x1998(0x28)
	struct FAnimNode_UseCachedPose ; // 0x19c0(0x28)
	struct FAnimNode_LayeredBoneBlend ; // 0x19e8(0xe0)
	struct FAnimNode_SequencePlayer ; // 0x1ac8(0x40)
	struct FAnimNode_BlendListByBool ; // 0x1b08(0x48)
	struct FAnimNode_SequencePlayer ; // 0x1b50(0x40)
	struct FAnimNode_BlendListByBool ; // 0x1b90(0x48)
	struct FAnimNode_UseCachedPose ; // 0x1bd8(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x1c00(0xe0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x1ce0(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1d08(0x40)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1d48(0x48)
	struct FAnimNode_Root ; // 0x1d90(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x1db0(0xc0)
	struct FAnimNode_LinkedInputPose ; // 0x1e70(0xc0)
	struct FAnimNode_Root ; // 0x1f30(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x1f50(0xc0)
	struct FAnimNode_LinkedInputPose ; // 0x2010(0xc0)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x20d0(0xc0)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x2190(0x20)

	void VehicleFinalPoseOverride(struct FPoseLink InFinalPose, struct FPoseLink& VehicleFinalPoseOverride); // Function SpicySake_Driver_LayerAnimBP.SpicySake_Driver_LayerAnimBP_C.VehicleFinalPoseOverride // (HasOutParms|BlueprintCallable) // @ game+0xdef49c
	void VehicleFullBodyOverride(struct FPoseLink InPoseFullBody, struct FPoseLink& VehicleFullBodyOverride); // Function SpicySake_Driver_LayerAnimBP.SpicySake_Driver_LayerAnimBP_C.VehicleFullBodyOverride // (HasOutParms|BlueprintCallable) // @ game+0xdef49c
	void VehicleLowerBodyOverride(struct FPoseLink InPoseLowerBodyDefault, struct FPoseLink InPoseUpperBody, struct FPoseLink& VehicleLowerBodyOverride); // Function SpicySake_Driver_LayerAnimBP.SpicySake_Driver_LayerAnimBP_C.VehicleLowerBodyOverride // (HasOutParms|BlueprintCallable) // @ game+0xdef49c
	void VehicleSplitBodyOverride(struct FPoseLink InPoseSplitBody, struct FPoseLink InPoseUpperAndLowerBody, struct FFortAnimInput_TurnInPlace TurnInPlace, struct FPoseLink InPoseUpperAndLowerBodyRemoveRoot, struct FPoseLink& VehicleSplitBodyOverride); // Function SpicySake_Driver_LayerAnimBP.SpicySake_Driver_LayerAnimBP_C.VehicleSplitBodyOverride // (HasOutParms|BlueprintCallable) // @ game+0xdef49c
	void AnimGraph(struct FPoseLink& AnimGraph); // Function SpicySake_Driver_LayerAnimBP.SpicySake_Driver_LayerAnimBP_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xdef49c
	void AnimNotify_OnTurnLeft(); // Function SpicySake_Driver_LayerAnimBP.SpicySake_Driver_LayerAnimBP_C.AnimNotify_OnTurnLeft // (BlueprintCallable|BlueprintEvent) // @ game+0xdef49c
	void AnimNotify_OnTurnRight(); // Function SpicySake_Driver_LayerAnimBP.SpicySake_Driver_LayerAnimBP_C.AnimNotify_OnTurnRight // (BlueprintCallable|BlueprintEvent) // @ game+0xdef49c
	void ExecuteUbergraph_SpicySake_Driver_LayerAnimBP(int32_t EntryPoint); // Function SpicySake_Driver_LayerAnimBP.SpicySake_Driver_LayerAnimBP_C.ExecuteUbergraph_SpicySake_Driver_LayerAnimBP // (Final|UbergraphFunction) // @ game+0xdef49c
};

