// ScriptStruct SpicySake_Driver_LayerAnimBP.SpicySake_Driver_LayerAnimBP_C.AnimBlueprintGeneratedMutableData
// Size: 0x15 (Inherited: 0x01)
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData {
	char pad_1[0x3]; // 0x01(0x03)
	float __FloatProperty; // 0x04(0x04)
	bool ; // 0x08(0x01)
	bool ; // 0x09(0x01)
	char pad_A[0x2]; // 0x0a(0x02)
	float ; // 0x0c(0x04)
	bool ; // 0x10(0x01)
	bool ; // 0x11(0x01)
	bool ; // 0x12(0x01)
	bool ; // 0x13(0x01)
	bool ; // 0x14(0x01)
};

// ScriptStruct SpicySake_Driver_LayerAnimBP.SpicySake_Driver_LayerAnimBP_C.AnimBlueprintGeneratedConstantData
// Size: 0x270 (Inherited: 0x01)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData {
	char pad_1[0x3]; // 0x01(0x03)
	struct FName ; // 0x04(0x04)
	struct FName ; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
	struct UAnimSequenceBase* ; // 0x10(0x08)
	float ; // 0x18(0x04)
	char pad_1C[0x4]; // 0x1c(0x04)
	struct UAnimSequenceBase* ; // 0x20(0x08)
	struct FName ; // 0x28(0x04)
	char pad_2C[0x4]; // 0x2c(0x04)
	struct UBlendSpace* ; // 0x30(0x08)
	struct FName ; // 0x38(0x04)
	char pad_3C[0x4]; // 0x3c(0x04)
	struct TArray<float> ; // 0x40(0x10)
	struct UAnimSequenceBase* ; // 0x50(0x08)
	struct FName ; // 0x58(0x04)
	int32_t ; // 0x5c(0x04)
	struct UAnimSequenceBase* ; // 0x60(0x08)
	struct FName ; // 0x68(0x04)
	int32_t ; // 0x6c(0x04)
	struct UAnimSequenceBase* ; // 0x70(0x08)
	struct FName ; // 0x78(0x04)
	int32_t ; // 0x7c(0x04)
	struct UAnimSequenceBase* ; // 0x80(0x08)
	struct FName ; // 0x88(0x04)
	int32_t ; // 0x8c(0x04)
	struct UAnimSequenceBase* ; // 0x90(0x08)
	struct FName ; // 0x98(0x04)
	int32_t ; // 0x9c(0x04)
	struct UAnimSequenceBase* ; // 0xa0(0x08)
	struct FName ; // 0xa8(0x04)
	char pad_AC[0x4]; // 0xac(0x04)
	struct UAnimSequenceBase* ; // 0xb0(0x08)
	struct UBlendSpace* ; // 0xb8(0x08)
	struct FName ; // 0xc0(0x04)
	struct FName ; // 0xc4(0x04)
	int32_t ; // 0xc8(0x04)
	char pad_CC[0x4]; // 0xcc(0x04)
	struct UAnimSequenceBase* ; // 0xd0(0x08)
	struct UAnimSequenceBase* ; // 0xd8(0x08)
	struct FName ; // 0xe0(0x04)
	struct FName ; // 0xe4(0x04)
	int32_t ; // 0xe8(0x04)
	char pad_EC[0x4]; // 0xec(0x04)
	struct UAnimSequenceBase* ; // 0xf0(0x08)
	struct UAnimSequenceBase* ; // 0xf8(0x08)
	struct TArray<float> ; // 0x100(0x10)
	struct UAnimSequenceBase* ; // 0x110(0x08)
	struct UAnimSequenceBase* ; // 0x118(0x08)
	enum class EAnimSyncMethod ; // 0x120(0x01)
	char pad_121[0x3]; // 0x121(0x03)
	struct FName ; // 0x124(0x04)
	struct TArray<float> ; // 0x128(0x10)
	bool ; // 0x138(0x01)
	char pad_139[0x3]; // 0x139(0x03)
	float ; // 0x13c(0x04)
	struct FInputScaleBiasClampConstants ; // 0x140(0x2c)
	float ; // 0x16c(0x04)
	struct UAnimSequenceBase* ; // 0x170(0x08)
	enum class EAnimSyncMethod ; // 0x178(0x01)
	enum class EAnimGroupRole ; // 0x179(0x01)
	char pad_17A[0x6]; // 0x17a(0x06)
	struct UBlendProfile* ; // 0x180(0x08)
	struct UCurveFloat* ; // 0x188(0x08)
	bool ; // 0x190(0x01)
	enum class EAlphaBlendOption ; // 0x191(0x01)
	enum class EBlendListTransitionType ; // 0x192(0x01)
	char pad_193[0x5]; // 0x193(0x05)
	struct TArray<float> ; // 0x198(0x10)
	struct FName ; // 0x1a8(0x04)
	struct FName ; // 0x1ac(0x04)
	struct FName ; // 0x1b0(0x04)
	struct FName ; // 0x1b4(0x04)
	struct FAnimNodeFunctionRef ; // 0x1b8(0x18)
	struct FName ; // 0x1d0(0x04)
	struct FName ; // 0x1d4(0x04)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x1d8(0x80)
	struct FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0x258(0x18)
};

