// ScriptStruct Transient.ENiagaraBoneData_SWC
// Size: 0x50 (Inherited: 0x00)
struct FENiagaraBoneData_SWC {
	struct FVector3f Position_2_9AC2D87F46A07EE69027009126BC67C8; // 0x00(0x0c)
	struct FVector3f LocalPosition_35_F479C6694451A0F8BEB744A89D067968; // 0x0c(0x0c)
	struct FVector3f QuatXYZ_47_1789E1BE407FF0D0DC0A4AA8C8C0C4E2; // 0x18(0x0c)
	float QuatW_48_5DDF0862481099664FA7558A1B18676E; // 0x24(0x04)
	struct FVector3f LocalQuatXYZ_52_69592550475548B677B8C884CA2EFD6E; // 0x28(0x0c)
	float LocalQuatW_53_7E4498034FA99A9FF8381092623D0567; // 0x34(0x04)
	struct FVector3f Velocity_24_B56F972A4A37F7A87BD832A4A5B3CCDC; // 0x38(0x0c)
	struct FVector3f LocalVelocity_38_C61A08D84A325DE4075BE9841AF6D6C4; // 0x44(0x0c)
};

