// AnimBlueprintGeneratedClass UnstableLiquidGun_AnimBP.UnstableLiquidGun_AnimBP_C
// Size: 0x17c3 (Inherited: 0x350)
struct UUnstableLiquidGun_AnimBP_C : UAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x350(0x08)
	struct FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x358(0x08)
	struct FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x360(0x08)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x368(0x20)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0x388(0x48)
	struct FAnimNode_SequencePlayer ; // 0x3d0(0x40)
	struct FAnimNode_LayeredBoneBlend ; // 0x410(0xe0)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x4f0(0x128)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x618(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x638(0x20)
	struct FAnimNode_TransitionResult ; // 0x658(0x28)
	struct FAnimNode_TransitionResult ; // 0x680(0x28)
	struct FAnimNode_TransitionResult ; // 0x6a8(0x28)
	struct FAnimNode_TransitionResult ; // 0x6d0(0x28)
	struct FAnimNode_TransitionResult ; // 0x6f8(0x28)
	struct FAnimNode_TransitionResult ; // 0x720(0x28)
	struct FAnimNode_TransitionResult ; // 0x748(0x28)
	struct FAnimNode_TransitionResult ; // 0x770(0x28)
	struct FAnimNode_TransitionResult ; // 0x798(0x28)
	struct FAnimNode_TransitionResult ; // 0x7c0(0x28)
	struct FAnimNode_TransitionResult ; // 0x7e8(0x28)
	struct FAnimNode_TwoWayBlend ; // 0x810(0xc0)
	struct FAnimNode_SequencePlayer ; // 0x8d0(0x40)
	struct FAnimNode_SequencePlayer ; // 0x910(0x40)
	struct FAnimNode_StateResult ; // 0x950(0x20)
	struct FAnimNode_SequencePlayer ; // 0x970(0x40)
	struct FAnimNode_StateResult ; // 0x9b0(0x20)
	struct FAnimNode_SequencePlayer ; // 0x9d0(0x40)
	struct FAnimNode_StateResult ; // 0xa10(0x20)
	struct FAnimNode_SequencePlayer ; // 0xa30(0x40)
	struct FAnimNode_StateResult ; // 0xa70(0x20)
	struct FAnimNode_SequencePlayer ; // 0xa90(0x40)
	struct FAnimNode_StateResult ; // 0xad0(0x20)
	struct FAnimNode_TwoWayBlend ; // 0xaf0(0xc0)
	struct FAnimNode_SequencePlayer ; // 0xbb0(0x40)
	struct FAnimNode_SequencePlayer ; // 0xbf0(0x40)
	struct FAnimNode_StateResult ; // 0xc30(0x20)
	struct FAnimNode_TwoWayBlend ; // 0xc50(0xc0)
	struct FAnimNode_SequencePlayer ; // 0xd10(0x40)
	struct FAnimNode_SequencePlayer ; // 0xd50(0x40)
	struct FAnimNode_StateResult ; // 0xd90(0x20)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0xdb0(0xc0)
	struct FAnimNode_SequencePlayer ; // 0xe70(0x40)
	struct FAnimNode_SequencePlayer ; // 0xeb0(0x40)
	struct FAnimNode_StateResult ; // 0xef0(0x20)
	struct FAnimNode_StateMachine ; // 0xf10(0xc8)
	struct FAnimNode_LayeredBoneBlend ; // 0xfd8(0xe0)
	struct FAnimNode_TransitionResult ; // 0x10b8(0x28)
	struct FAnimNode_TransitionResult ; // 0x10e0(0x28)
	struct FAnimNode_TransitionResult ; // 0x1108(0x28)
	struct FAnimNode_TransitionResult ; // 0x1130(0x28)
	struct FAnimNode_TransitionResult ; // 0x1158(0x28)
	struct FAnimNode_TransitionResult ; // 0x1180(0x28)
	struct FAnimNode_SequencePlayer ; // 0x11a8(0x40)
	struct FAnimNode_StateResult ; // 0x11e8(0x20)
	struct FAnimNode_SequencePlayer ; // 0x1208(0x40)
	struct FAnimNode_StateResult ; // 0x1248(0x20)
	struct FAnimNode_SequencePlayer ; // 0x1268(0x40)
	struct FAnimNode_StateResult ; // 0x12a8(0x20)
	struct FAnimNode_SequencePlayer ; // 0x12c8(0x40)
	struct FAnimNode_StateResult ; // 0x1308(0x20)
	struct FAnimNode_SequencePlayer ; // 0x1328(0x40)
	struct FAnimNode_StateResult ; // 0x1368(0x20)
	struct FAnimNode_StateMachine ; // 0x1388(0xc8)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x1450(0xe0)
	struct FAnimNode_TransitionResult ; // 0x1530(0x28)
	struct FAnimNode_TransitionResult ; // 0x1558(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1580(0x28)
	struct FAnimNode_SequencePlayer ; // 0x15a8(0x40)
	struct FAnimNode_StateResult ; // 0x15e8(0x20)
	struct FAnimNode_SequencePlayer ; // 0x1608(0x40)
	struct FAnimNode_StateResult ; // 0x1648(0x20)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1668(0x40)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x16a8(0x20)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x16c8(0xc8)
	int32_t RemainingAmmo; // 0x1790(0x04)
	char pad_1794[0x4]; // 0x1794(0x04)
	double AmmoPercentage; // 0x1798(0x08)
	bool Reloading; // 0x17a0(0x01)
	char pad_17A1[0x7]; // 0x17a1(0x07)
	double CanisterValue; // 0x17a8(0x08)
	double ReloadAmount; // 0x17b0(0x08)
	double AmmoPercentageCache; // 0x17b8(0x08)
	bool ReloadDelay; // 0x17c0(0x01)
	bool WeaponFired; // 0x17c1(0x01)
	bool ReloadDone; // 0x17c2(0x01)

	void AnimGraph(struct FPoseLink& AnimGraph); // Function UnstableLiquidGun_AnimBP.UnstableLiquidGun_AnimBP_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xdef49c
	void EvaluateGraphExposedInputs_ExecuteUbergraph_UnstableLiquidGun_AnimBP_AnimGraphNode_ModifyBone_5E60ECE1405BDA5F8F7183A881DBA02B(); // Function UnstableLiquidGun_AnimBP.UnstableLiquidGun_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_UnstableLiquidGun_AnimBP_AnimGraphNode_ModifyBone_5E60ECE1405BDA5F8F7183A881DBA02B // (BlueprintEvent) // @ game+0xdef49c
	void EvaluateGraphExposedInputs_ExecuteUbergraph_UnstableLiquidGun_AnimBP_AnimGraphNode_TwoWayBlend_0D54CE1845B639FE9AF5C6BB8F05CC1F(); // Function UnstableLiquidGun_AnimBP.UnstableLiquidGun_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_UnstableLiquidGun_AnimBP_AnimGraphNode_TwoWayBlend_0D54CE1845B639FE9AF5C6BB8F05CC1F // (BlueprintEvent) // @ game+0xdef49c
	void EvaluateGraphExposedInputs_ExecuteUbergraph_UnstableLiquidGun_AnimBP_AnimGraphNode_TwoWayBlend_EDE477E5458D050E5B5FD78DE6B25D34(); // Function UnstableLiquidGun_AnimBP.UnstableLiquidGun_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_UnstableLiquidGun_AnimBP_AnimGraphNode_TwoWayBlend_EDE477E5458D050E5B5FD78DE6B25D34 // (BlueprintEvent) // @ game+0xdef49c
	void EvaluateGraphExposedInputs_ExecuteUbergraph_UnstableLiquidGun_AnimBP_AnimGraphNode_TwoWayBlend_DDC067374A2DEB5E35A97CB826C421EC(); // Function UnstableLiquidGun_AnimBP.UnstableLiquidGun_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_UnstableLiquidGun_AnimBP_AnimGraphNode_TwoWayBlend_DDC067374A2DEB5E35A97CB826C421EC // (BlueprintEvent) // @ game+0xdef49c
	void EvaluateGraphExposedInputs_ExecuteUbergraph_UnstableLiquidGun_AnimBP_AnimGraphNode_TransitionResult_AA21A8714238106FE29D9CBA48C6D798(); // Function UnstableLiquidGun_AnimBP.UnstableLiquidGun_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_UnstableLiquidGun_AnimBP_AnimGraphNode_TransitionResult_AA21A8714238106FE29D9CBA48C6D798 // (BlueprintEvent) // @ game+0xdef49c
	void EvaluateGraphExposedInputs_ExecuteUbergraph_UnstableLiquidGun_AnimBP_AnimGraphNode_TransitionResult_52C196564DBD577011C678B6A2A838B9(); // Function UnstableLiquidGun_AnimBP.UnstableLiquidGun_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_UnstableLiquidGun_AnimBP_AnimGraphNode_TransitionResult_52C196564DBD577011C678B6A2A838B9 // (BlueprintEvent) // @ game+0xdef49c
	void EvaluateGraphExposedInputs_ExecuteUbergraph_UnstableLiquidGun_AnimBP_AnimGraphNode_TransitionResult_6AA6BF884823386C444ED09013756BBC(); // Function UnstableLiquidGun_AnimBP.UnstableLiquidGun_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_UnstableLiquidGun_AnimBP_AnimGraphNode_TransitionResult_6AA6BF884823386C444ED09013756BBC // (BlueprintEvent) // @ game+0xdef49c
	void EvaluateGraphExposedInputs_ExecuteUbergraph_UnstableLiquidGun_AnimBP_AnimGraphNode_TransitionResult_EFDE53B1471F7F45DF01659753634758(); // Function UnstableLiquidGun_AnimBP.UnstableLiquidGun_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_UnstableLiquidGun_AnimBP_AnimGraphNode_TransitionResult_EFDE53B1471F7F45DF01659753634758 // (BlueprintEvent) // @ game+0xdef49c
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function UnstableLiquidGun_AnimBP.UnstableLiquidGun_AnimBP_C.BlueprintUpdateAnimation // (Event|Public|BlueprintEvent) // @ game+0xdef49c
	void ExecuteUbergraph_UnstableLiquidGun_AnimBP(int32_t EntryPoint); // Function UnstableLiquidGun_AnimBP.UnstableLiquidGun_AnimBP_C.ExecuteUbergraph_UnstableLiquidGun_AnimBP // (Final|UbergraphFunction) // @ game+0xdef49c
};

