// ScriptStruct UnstableLiquidGun_AnimBP.UnstableLiquidGun_AnimBP_C.AnimBlueprintGeneratedConstantData
// Size: 0x1e0 (Inherited: 0x01)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData {
	char pad_1[0x3]; // 0x01(0x03)
	struct FName ; // 0x04(0x04)
	struct FName ; // 0x08(0x04)
	int32_t ; // 0x0c(0x04)
	struct UAnimSequenceBase* ; // 0x10(0x08)
	struct FName ; // 0x18(0x04)
	int32_t ; // 0x1c(0x04)
	struct UAnimSequenceBase* ; // 0x20(0x08)
	struct FName ; // 0x28(0x04)
	int32_t ; // 0x2c(0x04)
	struct UAnimSequenceBase* ; // 0x30(0x08)
	struct FName ; // 0x38(0x04)
	char pad_3C[0x4]; // 0x3c(0x04)
	struct UAnimSequenceBase* ; // 0x40(0x08)
	struct FName ; // 0x48(0x04)
	struct FName ; // 0x4c(0x04)
	struct FName ; // 0x50(0x04)
	char pad_54[0x4]; // 0x54(0x04)
	struct UAnimSequenceBase* ; // 0x58(0x08)
	struct UAnimSequenceBase* ; // 0x60(0x08)
	struct FName ; // 0x68(0x04)
	char pad_6C[0x4]; // 0x6c(0x04)
	struct UAnimSequenceBase* ; // 0x70(0x08)
	int32_t ; // 0x78(0x04)
	char pad_7C[0x4]; // 0x7c(0x04)
	struct UAnimSequenceBase* ; // 0x80(0x08)
	struct FName ; // 0x88(0x04)
	int32_t ; // 0x8c(0x04)
	struct UAnimSequenceBase* ; // 0x90(0x08)
	struct FName ; // 0x98(0x04)
	char pad_9C[0x4]; // 0x9c(0x04)
	struct UAnimSequenceBase* ; // 0xa0(0x08)
	struct FName ; // 0xa8(0x04)
	char pad_AC[0x4]; // 0xac(0x04)
	struct UAnimSequenceBase* ; // 0xb0(0x08)
	struct FName ; // 0xb8(0x04)
	char pad_BC[0x4]; // 0xbc(0x04)
	struct UAnimSequenceBase* ; // 0xc0(0x08)
	struct FName ; // 0xc8(0x04)
	int32_t ; // 0xcc(0x04)
	struct UAnimSequenceBase* ; // 0xd0(0x08)
	struct FName ; // 0xd8(0x04)
	int32_t ; // 0xdc(0x04)
	bool ; // 0xe0(0x01)
	char pad_E1[0x3]; // 0xe1(0x03)
	float ; // 0xe4(0x04)
	struct FInputScaleBiasClampConstants ; // 0xe8(0x2c)
	float ; // 0x114(0x04)
	struct UAnimSequenceBase* ; // 0x118(0x08)
	bool ; // 0x120(0x01)
	enum class EAnimSyncMethod ; // 0x121(0x01)
	enum class EAnimGroupRole ; // 0x122(0x01)
	char pad_123[0x1]; // 0x123(0x01)
	struct FName ; // 0x124(0x04)
	struct FName ; // 0x128(0x04)
	int32_t ; // 0x12c(0x04)
	struct FAnimNodeFunctionRef ; // 0x130(0x18)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x148(0x80)
	struct FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0x1c8(0x18)
};

