// ScriptStruct ValetVehiclePassengerLayerAnimBP.ValetVehiclePassengerLayerAnimBP_C.AnimBlueprintGeneratedMutableData
// Size: 0x54 (Inherited: 0x01)
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData {
	char pad_1[0x3]; // 0x01(0x03)
	float __FloatProperty; // 0x04(0x04)
	bool ; // 0x08(0x01)
	char pad_9[0x3]; // 0x09(0x03)
	float ; // 0x0c(0x04)
	float ; // 0x10(0x04)
	float ; // 0x14(0x04)
	float ; // 0x18(0x04)
	bool ; // 0x1c(0x01)
	char pad_1D[0x3]; // 0x1d(0x03)
	float ; // 0x20(0x04)
	bool ; // 0x24(0x01)
	char pad_25[0x3]; // 0x25(0x03)
	float ; // 0x28(0x04)
	bool ; // 0x2c(0x01)
	bool ; // 0x2d(0x01)
	bool ; // 0x2e(0x01)
	bool ; // 0x2f(0x01)
	bool ; // 0x30(0x01)
	bool ; // 0x31(0x01)
	bool ; // 0x32(0x01)
	bool ; // 0x33(0x01)
	bool ; // 0x34(0x01)
	char pad_35[0x3]; // 0x35(0x03)
	float ; // 0x38(0x04)
	bool ; // 0x3c(0x01)
	bool ; // 0x3d(0x01)
	char pad_3E[0x2]; // 0x3e(0x02)
	float ; // 0x40(0x04)
	bool ; // 0x44(0x01)
	bool ; // 0x45(0x01)
	char pad_46[0x2]; // 0x46(0x02)
	float ; // 0x48(0x04)
	bool ; // 0x4c(0x01)
	bool ; // 0x4d(0x01)
	char pad_4E[0x2]; // 0x4e(0x02)
	float ; // 0x50(0x04)
};

// ScriptStruct ValetVehiclePassengerLayerAnimBP.ValetVehiclePassengerLayerAnimBP_C.AnimBlueprintGeneratedConstantData
// Size: 0x308 (Inherited: 0x01)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData {
	char pad_1[0x3]; // 0x01(0x03)
	struct FName ; // 0x04(0x04)
	struct FName ; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
	struct UAnimSequenceBase* ; // 0x10(0x08)
	float ; // 0x18(0x04)
	char pad_1C[0x4]; // 0x1c(0x04)
	struct UAnimSequenceBase* ; // 0x20(0x08)
	struct FName ; // 0x28(0x04)
	char pad_2C[0x4]; // 0x2c(0x04)
	struct UBlendSpace* ; // 0x30(0x08)
	struct UBlendSpace* ; // 0x38(0x08)
	struct FName ; // 0x40(0x04)
	char pad_44[0x4]; // 0x44(0x04)
	struct UAnimSequenceBase* ; // 0x48(0x08)
	struct UAnimSequenceBase* ; // 0x50(0x08)
	struct UAnimSequenceBase* ; // 0x58(0x08)
	struct UAnimSequenceBase* ; // 0x60(0x08)
	struct UAnimSequenceBase* ; // 0x68(0x08)
	struct FName ; // 0x70(0x04)
	struct FName ; // 0x74(0x04)
	struct FName ; // 0x78(0x04)
	char pad_7C[0x4]; // 0x7c(0x04)
	struct TArray<float> ; // 0x80(0x10)
	struct UAnimSequenceBase* ; // 0x90(0x08)
	struct UAnimSequenceBase* ; // 0x98(0x08)
	struct UAnimSequenceBase* ; // 0xa0(0x08)
	struct UAnimSequenceBase* ; // 0xa8(0x08)
	struct FName ; // 0xb0(0x04)
	struct FName ; // 0xb4(0x04)
	struct UAnimSequenceBase* ; // 0xb8(0x08)
	struct UAnimSequenceBase* ; // 0xc0(0x08)
	struct FName ; // 0xc8(0x04)
	int32_t ; // 0xcc(0x04)
	struct UAnimSequenceBase* ; // 0xd0(0x08)
	struct UAnimSequenceBase* ; // 0xd8(0x08)
	struct FName ; // 0xe0(0x04)
	int32_t ; // 0xe4(0x04)
	struct UAnimSequenceBase* ; // 0xe8(0x08)
	struct UAnimSequenceBase* ; // 0xf0(0x08)
	struct FName ; // 0xf8(0x04)
	int32_t ; // 0xfc(0x04)
	struct UAnimSequenceBase* ; // 0x100(0x08)
	struct UAnimSequenceBase* ; // 0x108(0x08)
	struct FName ; // 0x110(0x04)
	int32_t ; // 0x114(0x04)
	struct UAnimSequenceBase* ; // 0x118(0x08)
	struct UAnimSequenceBase* ; // 0x120(0x08)
	struct FName ; // 0x128(0x04)
	int32_t ; // 0x12c(0x04)
	struct UAnimSequenceBase* ; // 0x130(0x08)
	struct UAnimSequenceBase* ; // 0x138(0x08)
	struct FName ; // 0x140(0x04)
	int32_t ; // 0x144(0x04)
	struct UAnimSequenceBase* ; // 0x148(0x08)
	struct UAnimSequenceBase* ; // 0x150(0x08)
	struct FName ; // 0x158(0x04)
	int32_t ; // 0x15c(0x04)
	struct UAnimSequenceBase* ; // 0x160(0x08)
	struct UAnimSequenceBase* ; // 0x168(0x08)
	struct FName ; // 0x170(0x04)
	int32_t ; // 0x174(0x04)
	struct UAnimSequenceBase* ; // 0x178(0x08)
	struct UAnimSequenceBase* ; // 0x180(0x08)
	struct FName ; // 0x188(0x04)
	int32_t ; // 0x18c(0x04)
	struct UAnimSequenceBase* ; // 0x190(0x08)
	struct UAnimSequenceBase* ; // 0x198(0x08)
	struct FName ; // 0x1a0(0x04)
	int32_t ; // 0x1a4(0x04)
	struct UAnimSequenceBase* ; // 0x1a8(0x08)
	struct UAnimSequenceBase* ; // 0x1b0(0x08)
	struct FName ; // 0x1b8(0x04)
	int32_t ; // 0x1bc(0x04)
	struct UAnimSequenceBase* ; // 0x1c0(0x08)
	struct UBlendProfile* ; // 0x1c8(0x08)
	struct UCurveFloat* ; // 0x1d0(0x08)
	enum class EAlphaBlendOption ; // 0x1d8(0x01)
	enum class EBlendListTransitionType ; // 0x1d9(0x01)
	char pad_1DA[0x6]; // 0x1da(0x06)
	struct TArray<float> ; // 0x1e0(0x10)
	struct FInputScaleBiasClampConstants ; // 0x1f0(0x2c)
	char pad_21C[0x4]; // 0x21c(0x04)
	struct UAnimSequenceBase* ; // 0x220(0x08)
	struct UBlendSpace* ; // 0x228(0x08)
	bool ; // 0x230(0x01)
	char pad_231[0x3]; // 0x231(0x03)
	float ; // 0x234(0x04)
	float ; // 0x238(0x04)
	bool ; // 0x23c(0x01)
	enum class EAnimSyncMethod ; // 0x23d(0x01)
	enum class EAnimGroupRole ; // 0x23e(0x01)
	char pad_23F[0x1]; // 0x23f(0x01)
	struct FName ; // 0x240(0x04)
	int32_t ; // 0x244(0x04)
	struct FName ; // 0x248(0x04)
	struct FName ; // 0x24c(0x04)
	struct FAnimNodeFunctionRef ; // 0x250(0x18)
	struct FName ; // 0x268(0x04)
	struct FName ; // 0x26c(0x04)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x270(0x80)
	struct FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0x2f0(0x18)
};

