// AnimBlueprintGeneratedClass ValetVehiclePassengerLayerAnimBP.ValetVehiclePassengerLayerAnimBP_C
// Size: 0x3e3b (Inherited: 0x880)
struct UValetVehiclePassengerLayerAnimBP_C : UFortValetPassengerAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x880(0x08)
	struct FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x888(0x54)
	char pad_8DC[0x4]; // 0x8dc(0x04)
	struct FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x8e0(0x08)
	struct FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x8e8(0x08)
	struct FAnimNode_Root ; // 0x8f0(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x910(0xc0)
	struct FAnimNode_Root ; // 0x9d0(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x9f0(0xc0)
	struct FAnimNode_SaveCachedPose ; // 0xab0(0x100)
	struct FAnimNode_TransitionResult ; // 0xbb0(0x28)
	struct FAnimNode_TransitionResult ; // 0xbd8(0x28)
	struct FAnimNode_TransitionResult ; // 0xc00(0x28)
	struct FAnimNode_SequencePlayer ; // 0xc28(0x40)
	struct FAnimNode_BlendListByBool ; // 0xc68(0x48)
	struct FAnimNode_RotateRootBone ; // 0xcb0(0xa8)
	struct FAnimNode_SequencePlayer ; // 0xd58(0x40)
	struct FAnimNode_ConvertComponentToLocalSpace ; // 0xd98(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace ; // 0xdb8(0x20)
	struct FAnimNode_ModifyBone ; // 0xdd8(0x128)
	struct FAnimNode_StateResult ; // 0xf00(0x20)
	struct FAnimNode_TransitionResult ; // 0xf20(0x28)
	struct FAnimNode_ConvertLocalToComponentSpace ; // 0xf48(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace ; // 0xf68(0x20)
	struct FAnimNode_ResetRoot AnimGraphNode_ResetRoot; // 0xf88(0xd8)
	struct FAnimNode_RotationOffsetBlendSpace ; // 0x1060(0x110)
	struct FAnimNode_RotationOffsetBlendSpace ; // 0x1170(0x110)
	struct FAnimNode_UseCachedPose ; // 0x1280(0x28)
	struct FAnimNode_StateResult ; // 0x12a8(0x20)
	struct FAnimNode_SequencePlayer ; // 0x12c8(0x40)
	struct FAnimNode_ApplyAdditive ; // 0x1308(0xc8)
	struct FAnimNode_SequencePlayer ; // 0x13d0(0x40)
	struct FAnimNode_ApplyAdditive ; // 0x1410(0xc8)
	struct FAnimNode_SequencePlayer ; // 0x14d8(0x40)
	struct FAnimNode_BlendListByBool ; // 0x1518(0x48)
	struct FAnimNode_SequencePlayer ; // 0x1560(0x40)
	struct FAnimNode_BlendListByBool ; // 0x15a0(0x48)
	struct FAnimNode_RotateRootBone ; // 0x15e8(0xa8)
	struct FAnimNode_SequencePlayer ; // 0x1690(0x40)
	struct FAnimNode_StateResult ; // 0x16d0(0x20)
	struct FAnimNode_StateMachine ; // 0x16f0(0xc8)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x17b8(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x17d8(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x17f8(0x128)
	struct FAnimNode_StateResult ; // 0x1920(0x20)
	struct FAnimNode_UseCachedPose ; // 0x1940(0x28)
	struct FAnimNode_RotateRootBone ; // 0x1968(0xa8)
	struct FAnimNode_StateResult ; // 0x1a10(0x20)
	struct FAnimNode_StateMachine ; // 0x1a30(0xc8)
	struct FAnimNode_BlendListByBool ; // 0x1af8(0x48)
	struct FAnimNode_UseCachedPose ; // 0x1b40(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x1b68(0xe0)
	struct FAnimNode_SequencePlayer ; // 0x1c48(0x40)
	struct FAnimNode_RotateRootBone ; // 0x1c88(0xa8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x1d30(0x100)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x1e30(0x28)
	struct FAnimNode_BlendListByBool ; // 0x1e58(0x48)
	struct FAnimNode_SequencePlayer ; // 0x1ea0(0x40)
	struct FAnimNode_ApplyAdditive ; // 0x1ee0(0xc8)
	struct FAnimNode_SequencePlayer ; // 0x1fa8(0x40)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x1fe8(0xc8)
	struct FAnimNode_SequencePlayer ; // 0x20b0(0x40)
	struct FAnimNode_Root ; // 0x20f0(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x2110(0xc0)
	struct FAnimNode_LinkedInputPose ; // 0x21d0(0xc0)
	struct FAnimNode_BlendListByBool ; // 0x2290(0x48)
	struct FAnimNode_TransitionResult ; // 0x22d8(0x28)
	struct FAnimNode_TransitionResult ; // 0x2300(0x28)
	struct FAnimNode_TransitionResult ; // 0x2328(0x28)
	struct FAnimNode_TransitionResult ; // 0x2350(0x28)
	struct FAnimNode_TransitionResult ; // 0x2378(0x28)
	struct FAnimNode_TransitionResult ; // 0x23a0(0x28)
	struct FAnimNode_TransitionResult ; // 0x23c8(0x28)
	struct FAnimNode_TransitionResult ; // 0x23f0(0x28)
	struct FAnimNode_TransitionResult ; // 0x2418(0x28)
	struct FAnimNode_TransitionResult ; // 0x2440(0x28)
	struct FAnimNode_TransitionResult ; // 0x2468(0x28)
	struct FAnimNode_TransitionResult ; // 0x2490(0x28)
	struct FAnimNode_TransitionResult ; // 0x24b8(0x28)
	struct FAnimNode_TransitionResult ; // 0x24e0(0x28)
	struct FAnimNode_TransitionResult ; // 0x2508(0x28)
	struct FAnimNode_TransitionResult ; // 0x2530(0x28)
	struct FAnimNode_TransitionResult ; // 0x2558(0x28)
	struct FAnimNode_TransitionResult ; // 0x2580(0x28)
	struct FAnimNode_TransitionResult ; // 0x25a8(0x28)
	struct FAnimNode_TransitionResult ; // 0x25d0(0x28)
	struct FAnimNode_TransitionResult ; // 0x25f8(0x28)
	struct FAnimNode_TransitionResult ; // 0x2620(0x28)
	struct FAnimNode_TransitionResult ; // 0x2648(0x28)
	struct FAnimNode_TransitionResult ; // 0x2670(0x28)
	struct FAnimNode_TransitionResult ; // 0x2698(0x28)
	struct FAnimNode_TransitionResult ; // 0x26c0(0x28)
	struct FAnimNode_TransitionResult ; // 0x26e8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2710(0x28)
	struct FAnimNode_SequencePlayer ; // 0x2738(0x40)
	struct FAnimNode_BlendListByBool ; // 0x2778(0x48)
	struct FAnimNode_SequencePlayer ; // 0x27c0(0x40)
	struct FAnimNode_StateResult ; // 0x2800(0x20)
	struct FAnimNode_SequencePlayer ; // 0x2820(0x40)
	struct FAnimNode_BlendListByBool ; // 0x2860(0x48)
	struct FAnimNode_SequencePlayer ; // 0x28a8(0x40)
	struct FAnimNode_StateResult ; // 0x28e8(0x20)
	struct FAnimNode_SequencePlayer ; // 0x2908(0x40)
	struct FAnimNode_BlendListByBool ; // 0x2948(0x48)
	struct FAnimNode_SequencePlayer ; // 0x2990(0x40)
	struct FAnimNode_StateResult ; // 0x29d0(0x20)
	struct FAnimNode_SequencePlayer ; // 0x29f0(0x40)
	struct FAnimNode_BlendListByBool ; // 0x2a30(0x48)
	struct FAnimNode_SequencePlayer ; // 0x2a78(0x40)
	struct FAnimNode_StateResult ; // 0x2ab8(0x20)
	struct FAnimNode_SequencePlayer ; // 0x2ad8(0x40)
	struct FAnimNode_BlendListByBool ; // 0x2b18(0x48)
	struct FAnimNode_SequencePlayer ; // 0x2b60(0x40)
	struct FAnimNode_StateResult ; // 0x2ba0(0x20)
	struct FAnimNode_SequencePlayer ; // 0x2bc0(0x40)
	struct FAnimNode_BlendListByBool ; // 0x2c00(0x48)
	struct FAnimNode_SequencePlayer ; // 0x2c48(0x40)
	struct FAnimNode_RotateRootBone ; // 0x2c88(0xa8)
	struct FAnimNode_RotateRootBone ; // 0x2d30(0xa8)
	struct FAnimNode_RotationOffsetBlendSpace ; // 0x2dd8(0x110)
	struct FAnimNode_StateResult ; // 0x2ee8(0x20)
	struct FAnimNode_SequencePlayer ; // 0x2f08(0x40)
	struct FAnimNode_BlendListByBool ; // 0x2f48(0x48)
	struct FAnimNode_SequencePlayer ; // 0x2f90(0x40)
	struct FAnimNode_StateResult ; // 0x2fd0(0x20)
	struct FAnimNode_SequencePlayer ; // 0x2ff0(0x40)
	struct FAnimNode_BlendListByBool ; // 0x3030(0x48)
	struct FAnimNode_SequencePlayer ; // 0x3078(0x40)
	struct FAnimNode_RotateRootBone ; // 0x30b8(0xa8)
	struct FAnimNode_RotateRootBone ; // 0x3160(0xa8)
	struct FAnimNode_RotationOffsetBlendSpace ; // 0x3208(0x110)
	struct FAnimNode_StateResult ; // 0x3318(0x20)
	struct FAnimNode_SequencePlayer ; // 0x3338(0x40)
	struct FAnimNode_BlendListByBool ; // 0x3378(0x48)
	struct FAnimNode_SequencePlayer ; // 0x33c0(0x40)
	struct FAnimNode_StateResult ; // 0x3400(0x20)
	struct FAnimNode_SequencePlayer ; // 0x3420(0x40)
	struct FAnimNode_BlendListByBool ; // 0x3460(0x48)
	struct FAnimNode_SequencePlayer ; // 0x34a8(0x40)
	struct FAnimNode_RotateRootBone ; // 0x34e8(0xa8)
	struct FAnimNode_RotateRootBone ; // 0x3590(0xa8)
	struct FAnimNode_RotationOffsetBlendSpace ; // 0x3638(0x110)
	struct FAnimNode_StateResult ; // 0x3748(0x20)
	struct FAnimNode_SequencePlayer ; // 0x3768(0x40)
	struct FAnimNode_BlendListByBool ; // 0x37a8(0x48)
	struct FAnimNode_SequencePlayer ; // 0x37f0(0x40)
	struct FAnimNode_StateResult ; // 0x3830(0x20)
	struct FAnimNode_SequencePlayer ; // 0x3850(0x40)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x3890(0x48)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x38d8(0x40)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace; // 0x3918(0x110)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x3a28(0x20)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x3a48(0xc8)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone; // 0x3b10(0xa8)
	struct FAnimNode_Root ; // 0x3bb8(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x3bd8(0xc0)
	struct FAnimNode_LinkedInputPose ; // 0x3c98(0xc0)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x3d58(0xc0)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x3e18(0x20)
	bool bIsSportsCar; // 0x3e38(0x01)
	bool bIsBasicTruck; // 0x3e39(0x01)
	bool ; // 0x3e3a(0x01)

	void VehicleFinalPoseOverride(struct FPoseLink InFinalPose, struct FPoseLink& VehicleFinalPoseOverride); // Function ValetVehiclePassengerLayerAnimBP.ValetVehiclePassengerLayerAnimBP_C.VehicleFinalPoseOverride // (HasOutParms|BlueprintCallable) // @ game+0xdef49c
	void VehicleFullBodyOverride(struct FPoseLink InPoseFullBody, struct FPoseLink& VehicleFullBodyOverride); // Function ValetVehiclePassengerLayerAnimBP.ValetVehiclePassengerLayerAnimBP_C.VehicleFullBodyOverride // (HasOutParms|BlueprintCallable) // @ game+0xdef49c
	void VehicleLowerBodyOverride(struct FPoseLink InPoseLowerBodyDefault, struct FPoseLink InPoseUpperBody, struct FPoseLink& VehicleLowerBodyOverride); // Function ValetVehiclePassengerLayerAnimBP.ValetVehiclePassengerLayerAnimBP_C.VehicleLowerBodyOverride // (HasOutParms|BlueprintCallable) // @ game+0xdef49c
	void VehicleSplitBodyOverride(struct FPoseLink InPoseSplitBody, struct FPoseLink InPoseUpperAndLowerBody, struct FFortAnimInput_TurnInPlace TurnInPlace, struct FPoseLink InPoseUpperAndLowerBodyRemoveRoot, struct FPoseLink& VehicleSplitBodyOverride); // Function ValetVehiclePassengerLayerAnimBP.ValetVehiclePassengerLayerAnimBP_C.VehicleSplitBodyOverride // (HasOutParms|BlueprintCallable) // @ game+0xdef49c
	void AnimGraph(struct FPoseLink& AnimGraph); // Function ValetVehiclePassengerLayerAnimBP.ValetVehiclePassengerLayerAnimBP_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xdef49c
	void BlueprintInitializeAnimation(); // Function ValetVehiclePassengerLayerAnimBP.ValetVehiclePassengerLayerAnimBP_C.BlueprintInitializeAnimation // (Event|Public|BlueprintEvent) // @ game+0xdef49c
	void ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP(int32_t EntryPoint); // Function ValetVehiclePassengerLayerAnimBP.ValetVehiclePassengerLayerAnimBP_C.ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP // (Final|UbergraphFunction|HasDefaults) // @ game+0xdef49c
};

