// ScriptStruct ValetVehicle_Driver_AnimBP.ValetVehicle_Driver_AnimBP_C.AnimBlueprintGeneratedMutableData
// Size: 0xc8 (Inherited: 0x01)
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData {
	char pad_1[0x7]; // 0x01(0x07)
	struct UAnimSequenceBase* __AnimSequenceBase; // 0x08(0x08)
	float ; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
	struct UAnimSequenceBase* ; // 0x18(0x08)
	struct UAnimSequenceBase* ; // 0x20(0x08)
	struct UAnimSequenceBase* ; // 0x28(0x08)
	struct UAnimSequenceBase* ; // 0x30(0x08)
	float ; // 0x38(0x04)
	char pad_3C[0x4]; // 0x3c(0x04)
	struct UAnimSequenceBase* ; // 0x40(0x08)
	struct UAnimSequenceBase* ; // 0x48(0x08)
	struct UAnimSequenceBase* ; // 0x50(0x08)
	struct UAnimSequenceBase* ; // 0x58(0x08)
	bool ; // 0x60(0x01)
	char pad_61[0x3]; // 0x61(0x03)
	float ; // 0x64(0x04)
	struct UAnimSequenceBase* ; // 0x68(0x08)
	struct UAnimSequenceBase* ; // 0x70(0x08)
	struct UAnimSequenceBase* ; // 0x78(0x08)
	bool ; // 0x80(0x01)
	bool ; // 0x81(0x01)
	char pad_82[0x6]; // 0x82(0x06)
	struct UAnimSequenceBase* ; // 0x88(0x08)
	bool ; // 0x90(0x01)
	bool ; // 0x91(0x01)
	char pad_92[0x6]; // 0x92(0x06)
	struct UAnimSequenceBase* ; // 0x98(0x08)
	struct UAnimSequenceBase* ; // 0xa0(0x08)
	struct UAnimSequenceBase* ; // 0xa8(0x08)
	struct UBlendSpace* ; // 0xb0(0x08)
	float ; // 0xb8(0x04)
	float ; // 0xbc(0x04)
	struct UAnimSequenceBase* ; // 0xc0(0x08)
};

// ScriptStruct ValetVehicle_Driver_AnimBP.ValetVehicle_Driver_AnimBP_C.AnimBlueprintGeneratedConstantData
// Size: 0x1d8 (Inherited: 0x01)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData {
	char pad_1[0x3]; // 0x01(0x03)
	struct FName ; // 0x04(0x04)
	struct UBlendSpace* ; // 0x08(0x08)
	struct FName ; // 0x10(0x04)
	int32_t ; // 0x14(0x04)
	struct FName ; // 0x18(0x04)
	int32_t ; // 0x1c(0x04)
	struct FName ; // 0x20(0x04)
	int32_t ; // 0x24(0x04)
	struct FName ; // 0x28(0x04)
	int32_t ; // 0x2c(0x04)
	struct FName ; // 0x30(0x04)
	int32_t ; // 0x34(0x04)
	struct FName ; // 0x38(0x04)
	int32_t ; // 0x3c(0x04)
	struct FName ; // 0x40(0x04)
	int32_t ; // 0x44(0x04)
	struct TArray<float> ; // 0x48(0x10)
	struct FName ; // 0x58(0x04)
	struct FName ; // 0x5c(0x04)
	enum class EAnimSyncMethod ; // 0x60(0x01)
	char pad_61[0x3]; // 0x61(0x03)
	struct FName ; // 0x64(0x04)
	struct TArray<float> ; // 0x68(0x10)
	struct FName ; // 0x78(0x04)
	char pad_7C[0x4]; // 0x7c(0x04)
	struct UAnimSequenceBase* ; // 0x80(0x08)
	struct UAnimSequenceBase* ; // 0x88(0x08)
	struct FName ; // 0x90(0x04)
	int32_t ; // 0x94(0x04)
	struct UAnimSequenceBase* ; // 0x98(0x08)
	struct FName ; // 0xa0(0x04)
	int32_t ; // 0xa4(0x04)
	enum class ERefPoseType ; // 0xa8(0x01)
	char pad_A9[0x3]; // 0xa9(0x03)
	struct FName ; // 0xac(0x04)
	int32_t ; // 0xb0(0x04)
	char pad_B4[0x4]; // 0xb4(0x04)
	struct UBlendProfile* ; // 0xb8(0x08)
	struct UCurveFloat* ; // 0xc0(0x08)
	enum class EAlphaBlendOption ; // 0xc8(0x01)
	enum class EBlendListTransitionType ; // 0xc9(0x01)
	char pad_CA[0x6]; // 0xca(0x06)
	struct TArray<float> ; // 0xd0(0x10)
	enum class ESequenceEvalReinit ; // 0xe0(0x01)
	char pad_E1[0x7]; // 0xe1(0x07)
	struct FAnimNodeFunctionRef ; // 0xe8(0x18)
	bool ; // 0x100(0x01)
	char pad_101[0x3]; // 0x101(0x03)
	float ; // 0x104(0x04)
	struct FInputScaleBiasClampConstants ; // 0x108(0x2c)
	float ; // 0x134(0x04)
	bool ; // 0x138(0x01)
	enum class EAnimSyncMethod ; // 0x139(0x01)
	enum class EAnimGroupRole ; // 0x13a(0x01)
	char pad_13B[0x1]; // 0x13b(0x01)
	struct FName ; // 0x13c(0x04)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x140(0x80)
	struct FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0x1c0(0x18)
};

