// AnimBlueprintGeneratedClass ValetVehicle_Driver_AnimBP.ValetVehicle_Driver_AnimBP_C
// Size: 0x2901 (Inherited: 0x810)
struct UValetVehicle_Driver_AnimBP_C : UFortVehicleOccupantAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x810(0x08)
	struct FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x818(0xc8)
	struct FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x8e0(0x08)
	struct FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x8e8(0x08)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x8f0(0x20)
	struct FAnimNode_LegIK ; // 0x910(0xf8)
	struct FAnimNode_LegIK ; // 0xa08(0xf8)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0xb00(0x20)
	struct FAnimNode_ModifyBone ; // 0xb20(0x128)
	struct FAnimNode_LegIK AnimGraphNode_LegIK; // 0xc48(0xf8)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0xd40(0x20)
	struct FAnimNode_ModifyBone ; // 0xd60(0x128)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0xe88(0x128)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0xfb0(0x48)
	struct FAnimNode_TransitionResult ; // 0xff8(0x28)
	struct FAnimNode_TransitionResult ; // 0x1020(0x28)
	struct FAnimNode_TransitionResult ; // 0x1048(0x28)
	struct FAnimNode_TransitionResult ; // 0x1070(0x28)
	struct FAnimNode_TransitionResult ; // 0x1098(0x28)
	struct FAnimNode_TransitionResult ; // 0x10c0(0x28)
	struct FAnimNode_TransitionResult ; // 0x10e8(0x28)
	struct FAnimNode_TransitionResult ; // 0x1110(0x28)
	struct FAnimNode_TransitionResult ; // 0x1138(0x28)
	struct FAnimNode_TransitionResult ; // 0x1160(0x28)
	struct FAnimNode_TransitionResult ; // 0x1188(0x28)
	struct FAnimNode_TransitionResult ; // 0x11b0(0x28)
	struct FAnimNode_TransitionResult ; // 0x11d8(0x28)
	struct FAnimNode_TransitionResult ; // 0x1200(0x28)
	struct FAnimNode_TransitionResult ; // 0x1228(0x28)
	struct FAnimNode_TransitionResult ; // 0x1250(0x28)
	struct FAnimNode_TransitionResult ; // 0x1278(0x28)
	struct FAnimNode_TransitionResult ; // 0x12a0(0x28)
	struct FAnimNode_TransitionResult ; // 0x12c8(0x28)
	struct FAnimNode_TransitionResult ; // 0x12f0(0x28)
	struct FAnimNode_TransitionResult ; // 0x1318(0x28)
	struct FAnimNode_TransitionResult ; // 0x1340(0x28)
	struct FAnimNode_SequencePlayer ; // 0x1368(0x40)
	struct FAnimNode_RotationOffsetBlendSpace ; // 0x13a8(0x110)
	struct FAnimNode_StateResult ; // 0x14b8(0x20)
	struct FAnimNode_SequencePlayer ; // 0x14d8(0x40)
	struct FAnimNode_StateResult ; // 0x1518(0x20)
	struct FAnimNode_SequencePlayer ; // 0x1538(0x40)
	struct FAnimNode_StateResult ; // 0x1578(0x20)
	struct FAnimNode_SequencePlayer ; // 0x1598(0x40)
	struct FAnimNode_StateResult ; // 0x15d8(0x20)
	struct FAnimNode_SequencePlayer ; // 0x15f8(0x40)
	struct FAnimNode_StateResult ; // 0x1638(0x20)
	struct FAnimNode_SequencePlayer ; // 0x1658(0x40)
	struct FAnimNode_StateResult ; // 0x1698(0x20)
	struct FAnimNode_SequencePlayer ; // 0x16b8(0x40)
	struct FAnimNode_StateResult ; // 0x16f8(0x20)
	struct FAnimNode_SequencePlayer ; // 0x1718(0x40)
	struct FAnimNode_SequencePlayer ; // 0x1758(0x40)
	struct FAnimNode_BlendListByBool ; // 0x1798(0x48)
	struct FAnimNode_ApplyAdditive ; // 0x17e0(0xc8)
	struct FAnimNode_UseCachedPose ; // 0x18a8(0x28)
	struct FAnimNode_StateResult ; // 0x18d0(0x20)
	struct FAnimNode_SequencePlayer ; // 0x18f0(0x40)
	struct FAnimNode_ApplyAdditive ; // 0x1930(0xc8)
	struct FAnimNode_UseCachedPose ; // 0x19f8(0x28)
	struct FAnimNode_StateResult ; // 0x1a20(0x20)
	struct FAnimNode_UseCachedPose ; // 0x1a40(0x28)
	struct FAnimNode_StateResult ; // 0x1a68(0x20)
	struct FAnimNode_StateMachine ; // 0x1a88(0xc8)
	struct FAnimNode_SequencePlayer ; // 0x1b50(0x40)
	struct FAnimNode_SequencePlayer ; // 0x1b90(0x40)
	struct FAnimNode_UseCachedPose ; // 0x1bd0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x1bf8(0x28)
	struct FAnimNode_ApplyAdditive ; // 0x1c20(0xc8)
	struct FAnimNode_BlendListByBool ; // 0x1ce8(0x48)
	struct FAnimNode_BlendListByBool ; // 0x1d30(0x48)
	struct FAnimNode_StateResult ; // 0x1d78(0x20)
	struct FAnimNode_StateMachine ; // 0x1d98(0xc8)
	struct FAnimNode_SaveCachedPose ; // 0x1e60(0x100)
	struct FAnimNode_SequencePlayer ; // 0x1f60(0x40)
	struct FAnimNode_ApplyAdditive ; // 0x1fa0(0xc8)
	struct FAnimNode_SequencePlayer ; // 0x2068(0x40)
	struct FAnimNode_ApplyAdditive ; // 0x20a8(0xc8)
	struct FAnimNode_TransitionResult ; // 0x2170(0x28)
	struct FAnimNode_TransitionResult ; // 0x2198(0x28)
	struct FAnimNode_TransitionResult ; // 0x21c0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x21e8(0x28)
	struct FAnimNode_SequencePlayer ; // 0x2210(0x40)
	struct FAnimNode_StateResult ; // 0x2250(0x20)
	struct FAnimNode_SequencePlayer ; // 0x2270(0x40)
	struct FAnimNode_StateResult ; // 0x22b0(0x20)
	struct FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0x22d0(0x10)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x22e0(0x20)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x2300(0xc8)
	struct FAnimNode_ApplyAdditive ; // 0x23c8(0xc8)
	struct FAnimNode_BlendListByBool ; // 0x2490(0x48)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x24d8(0x48)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x2520(0x100)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x2620(0xc8)
	struct FAnimNode_SequenceEvaluator ; // 0x26e8(0x40)
	struct FAnimNode_SequenceEvaluator ; // 0x2728(0x40)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator; // 0x2768(0x40)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace; // 0x27a8(0x110)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x28b8(0x40)
	double StartPosition; // 0x28f8(0x08)
	bool AimOffsetEnable; // 0x2900(0x01)

	void AnimGraph(struct FPoseLink& AnimGraph); // Function ValetVehicle_Driver_AnimBP.ValetVehicle_Driver_AnimBP_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xdef49c
	void AnimNotify_OnEnableAimOffset(); // Function ValetVehicle_Driver_AnimBP.ValetVehicle_Driver_AnimBP_C.AnimNotify_OnEnableAimOffset // (BlueprintCallable|BlueprintEvent) // @ game+0xdef49c
	void AnimNotify_OnDisableAimOffset(); // Function ValetVehicle_Driver_AnimBP.ValetVehicle_Driver_AnimBP_C.AnimNotify_OnDisableAimOffset // (BlueprintCallable|BlueprintEvent) // @ game+0xdef49c
	void ExecuteUbergraph_ValetVehicle_Driver_AnimBP(int32_t EntryPoint); // Function ValetVehicle_Driver_AnimBP.ValetVehicle_Driver_AnimBP_C.ExecuteUbergraph_ValetVehicle_Driver_AnimBP // (Final|UbergraphFunction) // @ game+0xdef49c
};

