// VerseStruct Verse.Color
// Size: 0x18 (Inherited: 0x00)
struct FColor {
	double __verse_0x35184040_R; // 0x00(0x08)
	double __verse_0x98BF8727_G; // 0x08(0x08)
	double __verse_0xAA4F5910_B; // 0x10(0x08)
};

// VerseStruct Verse.locale
// Size: 0x01 (Inherited: 0x00)
struct Flocale {
	char pad_0[0x1]; // 0x00(0x01)
};

// VerseStruct Verse.tuple_L_K_Kchar_M_Kchar_R
// Size: 0x20 (Inherited: 0x00)
struct Ftuple_L_K_Kchar_M_Kchar_R {
	struct TArray<VerseStringProperty> __verse_0x18E3F084_Elem0; // 0x00(0x10)
	VerseStringProperty __verse_0x7D844C3C_Elem1; // 0x10(0x10)
};

// VerseStruct Verse.tuple_L_Kany_M_Kany_M_Kany_R
// Size: 0x30 (Inherited: 0x00)
struct Ftuple_L_Kany_M_Kany_M_Kany_R {
	struct TArray<VerseDynamicProperty> __verse_0x18E3F084_Elem0; // 0x00(0x10)
	struct TArray<VerseDynamicProperty> __verse_0x7D844C3C_Elem1; // 0x10(0x10)
	struct TArray<VerseDynamicProperty> __verse_0x932BF92E_Elem2; // 0x20(0x10)
};

// VerseStruct Verse.tuple_L_Kany_Many_Many_R
// Size: 0x30 (Inherited: 0x00)
struct Ftuple_L_Kany_Many_Many_R {
	struct TArray<VerseDynamicProperty> __verse_0x18E3F084_Elem0; // 0x00(0x10)
	VerseDynamicProperty __verse_0x7D844C3C_Elem1; // 0x10(0x10)
	VerseDynamicProperty __verse_0x932BF92E_Elem2; // 0x20(0x10)
};

// VerseStruct Verse.tuple_L_Kany_Many_R
// Size: 0x20 (Inherited: 0x00)
struct Ftuple_L_Kany_Many_R {
	struct TArray<VerseDynamicProperty> __verse_0x18E3F084_Elem0; // 0x00(0x10)
	VerseDynamicProperty __verse_0x7D844C3C_Elem1; // 0x10(0x10)
};

// VerseStruct Verse.tuple_L_Kany_Mint_M_Kany_R
// Size: 0x28 (Inherited: 0x00)
struct Ftuple_L_Kany_Mint_M_Kany_R {
	struct TArray<VerseDynamicProperty> __verse_0x18E3F084_Elem0; // 0x00(0x10)
	int64_t __verse_0x7D844C3C_Elem1; // 0x10(0x08)
	struct TArray<VerseDynamicProperty> __verse_0x932BF92E_Elem2; // 0x18(0x10)
};

// VerseStruct Verse.tuple_L_Kany_Mint_Many_R
// Size: 0x28 (Inherited: 0x00)
struct Ftuple_L_Kany_Mint_Many_R {
	struct TArray<VerseDynamicProperty> __verse_0x18E3F084_Elem0; // 0x00(0x10)
	int64_t __verse_0x7D844C3C_Elem1; // 0x10(0x08)
	VerseDynamicProperty __verse_0x932BF92E_Elem2; // 0x18(0x10)
};

// VerseStruct Verse.tuple_L_Kany_Mint_Mint_R
// Size: 0x20 (Inherited: 0x00)
struct Ftuple_L_Kany_Mint_Mint_R {
	struct TArray<VerseDynamicProperty> __verse_0x18E3F084_Elem0; // 0x00(0x10)
	int64_t __verse_0x7D844C3C_Elem1; // 0x10(0x08)
	int64_t __verse_0x932BF92E_Elem2; // 0x18(0x08)
};

// VerseStruct Verse.tuple_L_Kany_Mint_R
// Size: 0x18 (Inherited: 0x00)
struct Ftuple_L_Kany_Mint_R {
	struct TArray<VerseDynamicProperty> __verse_0x18E3F084_Elem0; // 0x00(0x10)
	int64_t __verse_0x7D844C3C_Elem1; // 0x10(0x08)
};

// VerseStruct Verse.tuple_L_Kany_Mtype_7b0_7d_Mint_R
// Size: 0x20 (Inherited: 0x00)
struct Ftuple_L_Kany_Mtype_7b0_7d_Mint_R {
	struct TArray<VerseDynamicProperty> __verse_0x18E3F084_Elem0; // 0x00(0x10)
	int64_t __verse_0x7D844C3C_Elem1; // 0x10(0x08)
	int64_t __verse_0x932BF92E_Elem2; // 0x18(0x08)
};

// VerseStruct Verse.tuple_L_Kchar_M_Kchar_M_5b_Kchar_5dlocalizable__value_R
// Size: 0x70 (Inherited: 0x00)
struct Ftuple_L_Kchar_M_Kchar_M_5b_Kchar_5dlocalizable__value_R {
	VerseStringProperty __verse_0x18E3F084_Elem0; // 0x00(0x10)
	VerseStringProperty __verse_0x7D844C3C_Elem1; // 0x10(0x10)
	struct TMap<VerseStringProperty, struct UObject*> __verse_0x932BF92E_Elem2; // 0x20(0x50)
};

// VerseStruct Verse.tuple_L_Kchar_M_Kchar_M_Ktuple_L_Kchar_M_Kchar_R_Mlocale_R
// Size: 0x31 (Inherited: 0x00)
struct Ftuple_L_Kchar_M_Kchar_M_Ktuple_L_Kchar_M_Kchar_R_Mlocale_R {
	VerseStringProperty __verse_0x18E3F084_Elem0; // 0x00(0x10)
	VerseStringProperty __verse_0x7D844C3C_Elem1; // 0x10(0x10)
	struct TArray<struct Ftuple_L_Kchar_M_Kchar_R> __verse_0x932BF92E_Elem2; // 0x20(0x10)
	struct Flocale __verse_0xF64C4596_Elem3; // 0x30(0x01)
};

// VerseStruct Verse.tuple_L_Kchar_M_Kchar_R
// Size: 0x20 (Inherited: 0x00)
struct Ftuple_L_Kchar_M_Kchar_R {
	VerseStringProperty __verse_0x18E3F084_Elem0; // 0x00(0x10)
	VerseStringProperty __verse_0x7D844C3C_Elem1; // 0x10(0x10)
};

// VerseStruct Verse.tuple_L_Kchar_M_QWhere_Nlocale_R
// Size: 0x12 (Inherited: 0x00)
struct Ftuple_L_Kchar_M_QWhere_Nlocale_R {
	VerseStringProperty __verse_0x18E3F084_Elem0; // 0x00(0x10)
	OptionProperty __verse_0x7D844C3C_Elem1; // 0x10(0x02)
};

// VerseStruct Verse.tuple_L_R
// Size: 0x01 (Inherited: 0x00)
struct Ftuple_L_R {
	char $StructPaddingDummy; // 0x00(0x01)
};

// VerseStruct Verse.tuple_Lcolor_Mcolor_R
// Size: 0x30 (Inherited: 0x00)
struct Ftuple_Lcolor_Mcolor_R {
	struct FColor __verse_0x18E3F084_Elem0; // 0x00(0x18)
	struct FColor __verse_0x7D844C3C_Elem1; // 0x18(0x18)
};

// VerseStruct Verse.tuple_Lcolor_Mfloat_R
// Size: 0x20 (Inherited: 0x00)
struct Ftuple_Lcolor_Mfloat_R {
	struct FColor __verse_0x18E3F084_Elem0; // 0x00(0x18)
	double __verse_0x7D844C3C_Elem1; // 0x18(0x08)
};

// VerseStruct Verse.tuple_Lcolor_Mint_R
// Size: 0x20 (Inherited: 0x00)
struct Ftuple_Lcolor_Mint_R {
	struct FColor __verse_0x18E3F084_Elem0; // 0x00(0x18)
	int64_t __verse_0x7D844C3C_Elem1; // 0x18(0x08)
};

// VerseStruct Verse.tuple_Lfloat_M_QWhere_Nlocale_R
// Size: 0x0a (Inherited: 0x00)
struct Ftuple_Lfloat_M_QWhere_Nlocale_R {
	double __verse_0x18E3F084_Elem0; // 0x00(0x08)
	OptionProperty __verse_0x7D844C3C_Elem1; // 0x08(0x02)
};

// VerseStruct Verse.tuple_Lfloat_Mcolor_R
// Size: 0x20 (Inherited: 0x00)
struct Ftuple_Lfloat_Mcolor_R {
	double __verse_0x18E3F084_Elem0; // 0x00(0x08)
	struct FColor __verse_0x7D844C3C_Elem1; // 0x08(0x18)
};

// VerseStruct Verse.tuple_Lfloat_Mfloat_Mfloat_R
// Size: 0x18 (Inherited: 0x00)
struct Ftuple_Lfloat_Mfloat_Mfloat_R {
	double __verse_0x18E3F084_Elem0; // 0x00(0x08)
	double __verse_0x7D844C3C_Elem1; // 0x08(0x08)
	double __verse_0x932BF92E_Elem2; // 0x10(0x08)
};

// VerseStruct Verse.tuple_Lfloat_Mfloat_R
// Size: 0x10 (Inherited: 0x00)
struct Ftuple_Lfloat_Mfloat_R {
	double __verse_0x18E3F084_Elem0; // 0x00(0x08)
	double __verse_0x7D844C3C_Elem1; // 0x08(0x08)
};

// VerseStruct Verse.tuple_Lint_M_QWhere_Nlocale_R
// Size: 0x0a (Inherited: 0x00)
struct Ftuple_Lint_M_QWhere_Nlocale_R {
	int64_t __verse_0x18E3F084_Elem0; // 0x00(0x08)
	OptionProperty __verse_0x7D844C3C_Elem1; // 0x08(0x02)
};

// VerseStruct Verse.tuple_Lint_Mcolor_R
// Size: 0x20 (Inherited: 0x00)
struct Ftuple_Lint_Mcolor_R {
	int64_t __verse_0x18E3F084_Elem0; // 0x00(0x08)
	struct FColor __verse_0x7D844C3C_Elem1; // 0x08(0x18)
};

// VerseStruct Verse.tuple_Lint_Mint_Mint_R
// Size: 0x18 (Inherited: 0x00)
struct Ftuple_Lint_Mint_Mint_R {
	int64_t __verse_0x18E3F084_Elem0; // 0x00(0x08)
	int64_t __verse_0x7D844C3C_Elem1; // 0x08(0x08)
	int64_t __verse_0x932BF92E_Elem2; // 0x10(0x08)
};

// VerseStruct Verse.tuple_Lint_Mint_R
// Size: 0x10 (Inherited: 0x00)
struct Ftuple_Lint_Mint_R {
	int64_t __verse_0x18E3F084_Elem0; // 0x00(0x08)
	int64_t __verse_0x7D844C3C_Elem1; // 0x08(0x08)
};

