// VerseClass Verse.$SolarisSignatureFunctionOuter
// Size: 0x28 (Inherited: 0x28)
struct U$SolarisSignatureFunctionOuter : UObject {
};

// VerseClass Verse.cancellable
// Size: 0x28 (Inherited: 0x28)
struct Ucancellable : UObject {

	void _L_2fVerse_2eorg_2fVerse_2fcancellable_N_RCancel(struct Ftuple_L_R __verse_0xB2CDDD72_Argument); // Function Verse.cancellable._L_2fVerse_2eorg_2fVerse_2fcancellable_N_RCancel // (Public|BlueprintCallable) // @ game+0xdef49c
};

// VerseClass Verse.Colors
// Size: 0x28 (Inherited: 0x28)
struct UColors : UObject {

	OptionProperty _L_2fVerse_2eorg_2fColors_N_Roperator_U_2f_U_L_Ncolor_M_Nint_R(struct Ftuple_Lcolor_Mint_R __verse_0xB2CDDD72_Argument); // Function Verse.Colors._L_2fVerse_2eorg_2fColors_N_Roperator_U_2f_U_L_Ncolor_M_Nint_R // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x5d26de4
	OptionProperty _L_2fVerse_2eorg_2fColors_N_Roperator_U_2f_U_L_Ncolor_M_Nfloat_R(struct Ftuple_Lcolor_Mfloat_R __verse_0xB2CDDD72_Argument); // Function Verse.Colors._L_2fVerse_2eorg_2fColors_N_Roperator_U_2f_U_L_Ncolor_M_Nfloat_R // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x5d26ddc
	struct FColor _L_2fVerse_2eorg_2fColors_N_Roperator_U_2d_U_L_Ncolor_M_Ncolor_R(struct Ftuple_Lcolor_Mcolor_R __verse_0xB2CDDD72_Argument); // Function Verse.Colors._L_2fVerse_2eorg_2fColors_N_Roperator_U_2d_U_L_Ncolor_M_Ncolor_R // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x5d26dd4
	struct FColor _L_2fVerse_2eorg_2fColors_N_Roperator_U_2b_U_L_Ncolor_M_Ncolor_R(struct Ftuple_Lcolor_Mcolor_R __verse_0xB2CDDD72_Argument); // Function Verse.Colors._L_2fVerse_2eorg_2fColors_N_Roperator_U_2b_U_L_Ncolor_M_Ncolor_R // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x5d26dcc
	struct FColor _L_2fVerse_2eorg_2fColors_N_Roperator_U_2a_U_L_Ncolor_M_Ncolor_R(struct Ftuple_Lcolor_Mcolor_R __verse_0xB2CDDD72_Argument); // Function Verse.Colors._L_2fVerse_2eorg_2fColors_N_Roperator_U_2a_U_L_Ncolor_M_Ncolor_R // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x5d26da4
	struct FColor _L_2fVerse_2eorg_2fColors_N_Roperator_U_2a_U_L_Ncolor_M_Nfloat_R(struct Ftuple_Lcolor_Mfloat_R __verse_0xB2CDDD72_Argument); // Function Verse.Colors._L_2fVerse_2eorg_2fColors_N_Roperator_U_2a_U_L_Ncolor_M_Nfloat_R // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x5d26dac
	struct FColor _L_2fVerse_2eorg_2fColors_N_Roperator_U_2a_U_L_Nfloat_M_Ncolor_R(struct Ftuple_Lfloat_Mcolor_R __verse_0xB2CDDD72_Argument); // Function Verse.Colors._L_2fVerse_2eorg_2fColors_N_Roperator_U_2a_U_L_Nfloat_M_Ncolor_R // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x5d26dbc
	struct FColor _L_2fVerse_2eorg_2fColors_N_Roperator_U_2a_U_L_Ncolor_M_Nint_R(struct Ftuple_Lcolor_Mint_R __verse_0xB2CDDD72_Argument); // Function Verse.Colors._L_2fVerse_2eorg_2fColors_N_Roperator_U_2a_U_L_Ncolor_M_Nint_R // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x5d26db4
	struct FColor _L_2fVerse_2eorg_2fColors_N_Roperator_U_2a_U_L_Nint_M_Ncolor_R(struct Ftuple_Lint_Mcolor_R __verse_0xB2CDDD72_Argument); // Function Verse.Colors._L_2fVerse_2eorg_2fColors_N_Roperator_U_2a_U_L_Nint_M_Ncolor_R // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x5d26dc4
	struct Ftuple_Lfloat_Mfloat_Mfloat_R _L_2fVerse_2eorg_2fColors_N_RMakeSRGBFromColor_L_Ncolor_R(struct FColor __verse_0xB2CDDD72_Argument); // Function Verse.Colors._L_2fVerse_2eorg_2fColors_N_RMakeSRGBFromColor_L_Ncolor_R // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x5d26d9c
	struct Ftuple_Lfloat_Mfloat_Mfloat_R _L_2fVerse_2eorg_2fColors_N_RMakeHSVFromColor_L_Ncolor_R(struct FColor __verse_0xB2CDDD72_Argument); // Function Verse.Colors._L_2fVerse_2eorg_2fColors_N_RMakeHSVFromColor_L_Ncolor_R // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x5d26d94
	struct FColor _L_2fVerse_2eorg_2fColors_N_RMakeColorFromTemperature_L_Nfloat_R(double __verse_0xB2CDDD72_Argument); // Function Verse.Colors._L_2fVerse_2eorg_2fColors_N_RMakeColorFromTemperature_L_Nfloat_R // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x5d26d8c
	struct FColor _L_2fVerse_2eorg_2fColors_N_RMakeColorFromSRGBValues_L_Nint_M_Nint_M_Nint_R(struct Ftuple_Lint_Mint_Mint_R __verse_0xB2CDDD72_Argument); // Function Verse.Colors._L_2fVerse_2eorg_2fColors_N_RMakeColorFromSRGBValues_L_Nint_M_Nint_M_Nint_R // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x5d26d7c
	struct FColor _L_2fVerse_2eorg_2fColors_N_RMakeColorFromSRGB_L_Nfloat_M_Nfloat_M_Nfloat_R(struct Ftuple_Lfloat_Mfloat_Mfloat_R __verse_0xB2CDDD72_Argument); // Function Verse.Colors._L_2fVerse_2eorg_2fColors_N_RMakeColorFromSRGB_L_Nfloat_M_Nfloat_M_Nfloat_R // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x5d26d84
	struct FColor _L_2fVerse_2eorg_2fColors_N_RMakeColorFromHex_L_N_Kchar_R(VerseStringProperty __verse_0xB2CDDD72_Argument); // Function Verse.Colors._L_2fVerse_2eorg_2fColors_N_RMakeColorFromHex_L_N_Kchar_R // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x5d26d74
	struct FColor _L_2fVerse_2eorg_2fColors_N_RMakeColorFromHSV_L_Nfloat_M_Nfloat_M_Nfloat_R(struct Ftuple_Lfloat_Mfloat_Mfloat_R __verse_0xB2CDDD72_Argument); // Function Verse.Colors._L_2fVerse_2eorg_2fColors_N_RMakeColorFromHSV_L_Nfloat_M_Nfloat_M_Nfloat_R // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x5d26d6c
	struct FColor color$Factory(); // Function Verse.Colors.color$Factory // (Static|HasOutParms) // @ game+0xdef49c
	void $InitCDO(); // Function Verse.Colors.$InitCDO // (None) // @ game+0xdef49c
};

// VerseClass Verse.disposable
// Size: 0x28 (Inherited: 0x28)
struct Udisposable : UObject {

	void _L_2fVerse_2eorg_2fVerse_2fdisposable_N_RDispose(struct Ftuple_L_R __verse_0xB2CDDD72_Argument); // Function Verse.disposable._L_2fVerse_2eorg_2fVerse_2fdisposable_N_RDispose // (Public|BlueprintCallable) // @ game+0xdef49c
};

// VerseClass Verse.event(t)
// Size: 0x80 (Inherited: 0x28)
struct Uevent(t) : UObject {
	VerseFunctionProperty __verse_0x57187737__L_2fVerse_2eorg_2fVerse_2fevent_2fevent_Lt_R_N_RGetAwaitCount; // 0x28(0x10)
	char pad_38[0x10]; // 0x38(0x10)
	VerseFunctionProperty __verse_0x8DE7DBE5_Await; // 0x48(0x10)
	VerseFunctionProperty __verse_0x7260621D__L_2fVerse_2eorg_2fVerse_2fsignalable_2fsignalable_Lt_R_N_RSignal_L_Nt_R; // 0x38(0x10)
	char pad_68[0x18]; // 0x68(0x18)

	void _L_2fVerse_2eorg_2fVerse_2fsignalable_2fsignalable_Lt_R_N_RSignal_L_Nt_R(VerseDynamicProperty __verse_0xB2CDDD72_Argument); // Function Verse.event(t)._L_2fVerse_2eorg_2fVerse_2fsignalable_2fsignalable_Lt_R_N_RSignal_L_Nt_R // (Native|Public|BlueprintCallable) // @ game+0x5d26e04
	int64_t _L_2fVerse_2eorg_2fVerse_2fevent_2fevent_Lt_R_N_RGetAwaitCount(struct Ftuple_L_R __verse_0xB2CDDD72_Argument); // Function Verse.event(t)._L_2fVerse_2eorg_2fVerse_2fevent_2fevent_Lt_R_N_RGetAwaitCount // (Native|Public|HasOutParms|BlueprintCallable) // @ game+0x5d26dfc
	struct Utask(t)* Await(struct Utask(t)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Ftuple_L_R __verse_0xB2CDDD72_Argument); // Function Verse.event(t).Await // (Public|HasOutParms|BlueprintCallable) // @ game+0xdef49c
	void $InitInstance(); // Function Verse.event(t).$InitInstance // (None) // @ game+0xdef49c
	void $Block(); // Function Verse.event(t).$Block // (None) // @ game+0xdef49c
	void $InitCDO(); // Function Verse.event(t).$InitCDO // (None) // @ game+0xdef49c
};

// VerseClass Verse.invalidatable
// Size: 0x28 (Inherited: 0x28)
struct Uinvalidatable : UObject {

	OptionProperty _L_2fVerse_2eorg_2fVerse_2finvalidatable_N_RIsValid(struct Ftuple_L_R __verse_0xB2CDDD72_Argument); // Function Verse.invalidatable._L_2fVerse_2eorg_2fVerse_2finvalidatable_N_RIsValid // (Public|HasOutParms|BlueprintCallable) // @ game+0xdef49c
};

// VerseClass Verse.listenable(t)
// Size: 0x28 (Inherited: 0x28)
struct Ulistenable(t) : UObject {
};

// VerseClass Verse.localizable_float
// Size: 0x40 (Inherited: 0x28)
struct Ulocalizable_float : UObject {
	double __verse_0x31A8F10C_Value; // 0x28(0x08)
	VerseFunctionProperty __verse_0x3FB03556__L_2fVerse_2eorg_2fVerse_2flocalizable__value_N_RLocalizeValue_L_Nlocale_R; // 0x30(0x10)

	VerseStringProperty _L_2fVerse_2eorg_2fVerse_2flocalizable__value_N_RLocalizeValue_L_Nlocale_R(struct Flocale __verse_0xB2CDDD72_Argument); // Function Verse.localizable_float._L_2fVerse_2eorg_2fVerse_2flocalizable__value_N_RLocalizeValue_L_Nlocale_R // (Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0xdef49c
	void $InitInstance(); // Function Verse.localizable_float.$InitInstance // (None) // @ game+0xdef49c
	void $Block(); // Function Verse.localizable_float.$Block // (None) // @ game+0xdef49c
	void $InitCDO(); // Function Verse.localizable_float.$InitCDO // (None) // @ game+0xdef49c
};

// VerseClass Verse.localizable_int
// Size: 0x40 (Inherited: 0x28)
struct Ulocalizable_int : UObject {
	int64_t __verse_0x31A8F10C_Value; // 0x28(0x08)
	VerseFunctionProperty __verse_0x3FB03556__L_2fVerse_2eorg_2fVerse_2flocalizable__value_N_RLocalizeValue_L_Nlocale_R; // 0x30(0x10)

	VerseStringProperty _L_2fVerse_2eorg_2fVerse_2flocalizable__value_N_RLocalizeValue_L_Nlocale_R(struct Flocale __verse_0xB2CDDD72_Argument); // Function Verse.localizable_int._L_2fVerse_2eorg_2fVerse_2flocalizable__value_N_RLocalizeValue_L_Nlocale_R // (Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0xdef49c
	void $InitInstance(); // Function Verse.localizable_int.$InitInstance // (None) // @ game+0xdef49c
	void $Block(); // Function Verse.localizable_int.$Block // (None) // @ game+0xdef49c
	void $InitCDO(); // Function Verse.localizable_int.$InitCDO // (None) // @ game+0xdef49c
};

// VerseClass Verse.localizable_string
// Size: 0x48 (Inherited: 0x28)
struct Ulocalizable_string : UObject {
	VerseStringProperty __verse_0x31A8F10C_Value; // 0x28(0x10)
	VerseFunctionProperty __verse_0x3FB03556__L_2fVerse_2eorg_2fVerse_2flocalizable__value_N_RLocalizeValue_L_Nlocale_R; // 0x38(0x10)

	VerseStringProperty _L_2fVerse_2eorg_2fVerse_2flocalizable__value_N_RLocalizeValue_L_Nlocale_R(struct Flocale __verse_0xB2CDDD72_Argument); // Function Verse.localizable_string._L_2fVerse_2eorg_2fVerse_2flocalizable__value_N_RLocalizeValue_L_Nlocale_R // (Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0xdef49c
	void $InitInstance(); // Function Verse.localizable_string.$InitInstance // (None) // @ game+0xdef49c
	void $Block(); // Function Verse.localizable_string.$Block // (None) // @ game+0xdef49c
	void $InitCDO(); // Function Verse.localizable_string.$InitCDO // (None) // @ game+0xdef49c
};

// VerseClass Verse.localizable_value
// Size: 0x28 (Inherited: 0x28)
struct Ulocalizable_value : UObject {

	VerseStringProperty _L_2fVerse_2eorg_2fVerse_2flocalizable__value_N_RLocalizeValue_L_Nlocale_R(struct Flocale __verse_0xB2CDDD72_Argument); // Function Verse.localizable_value._L_2fVerse_2eorg_2fVerse_2flocalizable__value_N_RLocalizeValue_L_Nlocale_R // (Public|HasOutParms|BlueprintCallable) // @ game+0xdef49c
};

// VerseClass Verse.message
// Size: 0x98 (Inherited: 0x28)
struct Umessage : UObject {
	VerseStringProperty __verse_0x589418B4_Key; // 0x28(0x10)
	VerseStringProperty __verse_0xEDB05B46_DefaultText; // 0x38(0x10)
	struct TMap<VerseStringProperty, struct UObject*> __verse_0x85420AD2_Substitutions; // 0x48(0x50)

	void $InitInstance(); // Function Verse.message.$InitInstance // (None) // @ game+0xdef49c
	void $Block(); // Function Verse.message.$Block // (None) // @ game+0xdef49c
	void $InitCDO(); // Function Verse.message.$InitCDO // (None) // @ game+0xdef49c
};

// VerseClass Verse.NamedColors
// Size: 0xdd8 (Inherited: 0x28)
struct UNamedColors : UObject {
	struct FColor __verse_0x9FBDE6AE_AliceBlue; // 0x28(0x18)
	struct FColor __verse_0xB3F7599D_AntiqueWhite; // 0x40(0x18)
	struct FColor __verse_0x37EE68B4_Aqua; // 0x58(0x18)
	struct FColor __verse_0xA52EBB79_Aquamarine; // 0x70(0x18)
	struct FColor __verse_0xD06EFB2A_Azure; // 0x88(0x18)
	struct FColor __verse_0x8CE5D6D0_Beige; // 0xa0(0x18)
	struct FColor __verse_0xC6B3972A_Bisque; // 0xb8(0x18)
	struct FColor __verse_0x65E4346F_Black; // 0xd0(0x18)
	struct FColor __verse_0x513D3B5F_BlanchedAlmond; // 0xe8(0x18)
	struct FColor __verse_0x80217580_Blue; // 0x100(0x18)
	struct FColor __verse_0x31D0653D_BlueViolet; // 0x118(0x18)
	struct FColor __verse_0xAD308F8F_Brown; // 0x130(0x18)
	struct FColor __verse_0xED3A42A8_Burlywood; // 0x148(0x18)
	struct FColor __verse_0x921A6303_CadetBlue; // 0x160(0x18)
	struct FColor __verse_0x9E2BDE1B_Chartreuse; // 0x178(0x18)
	struct FColor __verse_0x082AED19_Chocolate; // 0x190(0x18)
	struct FColor __verse_0x196BEF87_Coral; // 0x1a8(0x18)
	struct FColor __verse_0xC6BCD84F_CornflowerBlue; // 0x1c0(0x18)
	struct FColor __verse_0xEE818697_Cornsilk; // 0x1d8(0x18)
	struct FColor __verse_0x6733DEF7_Crimson; // 0x1f0(0x18)
	struct FColor __verse_0x2D925695_Cyan; // 0x208(0x18)
	struct FColor __verse_0x935B7248_DarkBlue; // 0x220(0x18)
	struct FColor __verse_0x3EE8515D_DarkCyan; // 0x238(0x18)
	struct FColor __verse_0x5817F032_DarkGoldenrod; // 0x250(0x18)
	struct FColor __verse_0x916F3C35_DarkGray; // 0x268(0x18)
	struct FColor __verse_0x37F798B1_DarkGreen; // 0x280(0x18)
	struct FColor __verse_0x6B6176B1_DarkGrey; // 0x298(0x18)
	struct FColor __verse_0x9A5F61FB_DarkKhaki; // 0x2b0(0x18)
	struct FColor __verse_0x97899EDF_DarkMagenta; // 0x2c8(0x18)
	struct FColor __verse_0xC2E62C73_DarkOliveGreen; // 0x2e0(0x18)
	struct FColor __verse_0x7431D49D_DarkOrange; // 0x2f8(0x18)
	struct FColor __verse_0xA0C47F58_DarkOrchid; // 0x310(0x18)
	struct FColor __verse_0xA3246E28_DarkRed; // 0x328(0x18)
	struct FColor __verse_0x5A06EB6C_DarkSalmon; // 0x340(0x18)
	struct FColor __verse_0xF141484E_DarkSeaGreen; // 0x358(0x18)
	struct FColor __verse_0x4167AB57_DarkSlateBlue; // 0x370(0x18)
	struct FColor __verse_0x4353E52A_DarkSlateGray; // 0x388(0x18)
	struct FColor __verse_0xB95DAFAE_DarkSlateGrey; // 0x3a0(0x18)
	struct FColor __verse_0x26DA5155_DarkTurquoise; // 0x3b8(0x18)
	struct FColor __verse_0x3E781A05_DarkViolet; // 0x3d0(0x18)
	struct FColor __verse_0x53E148EA_DeepPink; // 0x3e8(0x18)
	struct FColor __verse_0xA474CD21_DeepSkyBlue; // 0x400(0x18)
	struct FColor __verse_0xEC312FE8_DimGray; // 0x418(0x18)
	struct FColor __verse_0x163F656C_DimGrey; // 0x430(0x18)
	struct FColor __verse_0x617B6862_DodgerBlue; // 0x448(0x18)
	struct FColor __verse_0xC636E104_Firebrick; // 0x460(0x18)
	struct FColor __verse_0x06164DB2_FloralWhite; // 0x478(0x18)
	struct FColor __verse_0x4939E624_ForestGreen; // 0x490(0x18)
	struct FColor __verse_0x8069E472_Fuchsia; // 0x4a8(0x18)
	struct FColor __verse_0x71D0705F_Gainsboro; // 0x4c0(0x18)
	struct FColor __verse_0x1EDD5A5B_GhostWhite; // 0x4d8(0x18)
	struct FColor __verse_0x0363FA56_Gold; // 0x4f0(0x18)
	struct FColor __verse_0x13A0B098_Goldenrod; // 0x508(0x18)
	struct FColor __verse_0x82153BFD_Gray; // 0x520(0x18)
	struct FColor __verse_0x853EAC70_Green; // 0x538(0x18)
	struct FColor __verse_0x94CAEBA0_GreenYellow; // 0x550(0x18)
	struct FColor __verse_0x781B7179_Grey; // 0x568(0x18)
	struct FColor __verse_0x6FB30324_Honeydew; // 0x580(0x18)
	struct FColor __verse_0x2D404B19_Hotpink; // 0x598(0x18)
	struct FColor __verse_0x2CE09720_IndianRed; // 0x5b0(0x18)
	struct FColor __verse_0x180B2901_Indigo; // 0x5c8(0x18)
	struct FColor __verse_0x1086E2EC_Ivory; // 0x5e0(0x18)
	struct FColor __verse_0x2896553A_Khaki; // 0x5f8(0x18)
	struct FColor __verse_0xB93AFCDC_Lavender; // 0x610(0x18)
	struct FColor __verse_0x4CF8F931_LavenderBlush; // 0x628(0x18)
	struct FColor __verse_0x08B4792E_LawnGreen; // 0x640(0x18)
	struct FColor __verse_0xCC22276F_LemonChiffon; // 0x658(0x18)
	struct FColor __verse_0x607C97F4_LightBlue; // 0x670(0x18)
	struct FColor __verse_0x89B3D40E_LightCoral; // 0x688(0x18)
	struct FColor __verse_0xCDCFB4E1_LightCyan; // 0x6a0(0x18)
	struct FColor __verse_0x6C11FD65_LightGoldenrodYellow; // 0x6b8(0x18)
	struct FColor __verse_0x6248D989_LightGray; // 0x6d0(0x18)
	struct FColor __verse_0x15E697F9_LightGreen; // 0x6e8(0x18)
	struct FColor __verse_0x9846930D_LightGrey; // 0x700(0x18)
	struct FColor __verse_0xC34ABDCC_LightPink; // 0x718(0x18)
	struct FColor __verse_0xC57DAB84_LightSalmon; // 0x730(0x18)
	struct FColor __verse_0x0FE57B41_LightSeaGreen; // 0x748(0x18)
	struct FColor __verse_0x4077C098_LightSkyBlue; // 0x760(0x18)
	struct FColor __verse_0xCABFF9F6_LightSlateGray; // 0x778(0x18)
	struct FColor __verse_0x30B1B372_LightSlateGrey; // 0x790(0x18)
	struct FColor __verse_0xEFD2DF75_LightSteelBlue; // 0x7a8(0x18)
	struct FColor __verse_0x5732C477_LightYellow; // 0x7c0(0x18)
	struct FColor __verse_0xA58A0A97_Lime; // 0x7d8(0x18)
	struct FColor __verse_0xC8D6E552_LimeGreen; // 0x7f0(0x18)
	struct FColor __verse_0xD014B08F_Linen; // 0x808(0x18)
	struct FColor __verse_0xC5065659_Magenta; // 0x820(0x18)
	struct FColor __verse_0x2C6B6225_Maroon; // 0x838(0x18)
	struct FColor __verse_0x603DC640_MediumAquamarine; // 0x850(0x18)
	struct FColor __verse_0x03344EDD_MediumBlue; // 0x868(0x18)
	struct FColor __verse_0xEB235F60_MediumOrchid; // 0x880(0x18)
	struct FColor __verse_0x80AC62AF_MediumPurple; // 0x898(0x18)
	struct FColor __verse_0xA2F1456A_MediumSeaGreen; // 0x8b0(0x18)
	struct FColor __verse_0x81A3E0C2_MediumSlateBlue; // 0x8c8(0x18)
	struct FColor __verse_0x8259C923_MediumSpringGreen; // 0x8e0(0x18)
	struct FColor __verse_0xE61E1AC0_MediumTurquoise; // 0x8f8(0x18)
	struct FColor __verse_0x750A73D1_MediumVioletRed; // 0x910(0x18)
	struct FColor __verse_0x54B068FD_MidnightBlue; // 0x928(0x18)
	struct FColor __verse_0x2D5517E3_MintCream; // 0x940(0x18)
	struct FColor __verse_0xC9B38859_MistyRose; // 0x958(0x18)
	struct FColor __verse_0x045E548D_Moccasin; // 0x970(0x18)
	struct FColor __verse_0x66A473BA_NavajoWhite; // 0x988(0x18)
	struct FColor __verse_0x621CB82D_Navy; // 0x9a0(0x18)
	struct FColor __verse_0x4433768E_OldLace; // 0x9b8(0x18)
	struct FColor __verse_0x4ADCED0B_Olive; // 0x9d0(0x18)
	struct FColor __verse_0x662F5053_OliveDrab; // 0x9e8(0x18)
	struct FColor __verse_0x7B1B98E3_Orange; // 0xa00(0x18)
	struct FColor __verse_0x31DF128E_OrangeRed; // 0xa18(0x18)
	struct FColor __verse_0xAFEE3326_Orchid; // 0xa30(0x18)
	struct FColor __verse_0xA90612F2_PaleGoldenrod; // 0xa48(0x18)
	struct FColor __verse_0x6494F519_PaleGreen; // 0xa60(0x18)
	struct FColor __verse_0xD7CBB395_PaleTurquoise; // 0xa78(0x18)
	struct FColor __verse_0xBC04EB9C_PaleVioletred; // 0xa90(0x18)
	struct FColor __verse_0x1267A5CE_PapayaWhip; // 0xaa8(0x18)
	struct FColor __verse_0x5B815063_PeachPuff; // 0xac0(0x18)
	struct FColor __verse_0x6A5E8726_Peru; // 0xad8(0x18)
	struct FColor __verse_0x23175FB8_Pink; // 0xaf0(0x18)
	struct FColor __verse_0x92124624_Plum; // 0xb08(0x18)
	struct FColor __verse_0x315A9690_PowderBlue; // 0xb20(0x18)
	struct FColor __verse_0xC4610EE9_Purple; // 0xb38(0x18)
	struct FColor __verse_0x77CCDA87_Red; // 0xb50(0x18)
	struct FColor __verse_0xFB01846B_RosyBrown; // 0xb68(0x18)
	struct FColor __verse_0xA95C80D8_RoyalBlue; // 0xb80(0x18)
	struct FColor __verse_0xFCC2BB8C_SaddleBrown; // 0xb98(0x18)
	struct FColor __verse_0x552CA712_Salmon; // 0xbb0(0x18)
	struct FColor __verse_0xE1C22521_SandyBrown; // 0xbc8(0x18)
	struct FColor __verse_0x36A1DDC2_SeaGreen; // 0xbe0(0x18)
	struct FColor __verse_0x58B624CB_SeaShell; // 0xbf8(0x18)
	struct FColor __verse_0x013650B1_Sienna; // 0xc10(0x18)
	struct FColor __verse_0xFA47F979_Silver; // 0xc28(0x18)
	struct FColor __verse_0x1EAB27FD_SkyBlue; // 0xc40(0x18)
	struct FColor __verse_0x0AD0EBFD_SlateBlue; // 0xc58(0x18)
	struct FColor __verse_0x08E4A580_SlateGray; // 0xc70(0x18)
	struct FColor __verse_0xF2EAEF04_SlateGrey; // 0xc88(0x18)
	struct FColor __verse_0xE7A26A33_Snow; // 0xca0(0x18)
	struct FColor __verse_0x2CD5AEB9_SpringGreen; // 0xcb8(0x18)
	struct FColor __verse_0x2D898303_SteelBlue; // 0xcd0(0x18)
	struct FColor __verse_0x303C932D_Teal; // 0xce8(0x18)
	struct FColor __verse_0x303F6677_Thistle; // 0xd00(0x18)
	struct FColor __verse_0x4DC64808_Tomato; // 0xd18(0x18)
	struct FColor __verse_0x6D6D11FF_Turquoise; // 0xd30(0x18)
	struct FColor __verse_0x3152567B_Violet; // 0xd48(0x18)
	struct FColor __verse_0x13A81039_Wheat; // 0xd60(0x18)
	struct FColor __verse_0x27EAE4E0_White; // 0xd78(0x18)
	struct FColor __verse_0xBE90A762_WhiteSmoke; // 0xd90(0x18)
	struct FColor __verse_0xC763C8E1_Yellow; // 0xda8(0x18)
	struct FColor __verse_0xF10B434A_YellowGreen; // 0xdc0(0x18)

	void $InitCDO(); // Function Verse.NamedColors.$InitCDO // (HasDefaults) // @ game+0xdef49c
};

// VerseClass Verse.Random
// Size: 0x28 (Inherited: 0x28)
struct URandom : UObject {

	struct TArray<VerseDynamicProperty> _L_2fVerse_2eorg_2fRandom_N_RShuffle_L_N_Kt_20where_20t_R(struct TArray<VerseDynamicProperty> __verse_0xB2CDDD72_Argument); // Function Verse.Random._L_2fVerse_2eorg_2fRandom_N_RShuffle_L_N_Kt_20where_20t_R // (Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0xdef49c
	int64_t _L_2fVerse_2eorg_2fRandom_N_RGetRandomInt_L_Nint_M_Nint_R(struct Ftuple_Lint_Mint_R __verse_0xB2CDDD72_Argument); // Function Verse.Random._L_2fVerse_2eorg_2fRandom_N_RGetRandomInt_L_Nint_M_Nint_R // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x5d26df4
	double _L_2fVerse_2eorg_2fRandom_N_RGetRandomFloat_L_Nfloat_M_Nfloat_R(struct Ftuple_Lfloat_Mfloat_R __verse_0xB2CDDD72_Argument); // Function Verse.Random._L_2fVerse_2eorg_2fRandom_N_RGetRandomFloat_L_Nfloat_M_Nfloat_R // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x5d26dec
	void $InitCDO(); // Function Verse.Random.$InitCDO // (None) // @ game+0xdef49c
};

// VerseClass Verse.signalable(t)
// Size: 0x28 (Inherited: 0x28)
struct Usignalable(t) : UObject {

	void _L_2fVerse_2eorg_2fVerse_2fsignalable_2fsignalable_Lt_R_N_RSignal_L_Nt_R(VerseDynamicProperty __verse_0xB2CDDD72_Argument); // Function Verse.signalable(t)._L_2fVerse_2eorg_2fVerse_2fsignalable_2fsignalable_Lt_R_N_RSignal_L_Nt_R // (Public|BlueprintCallable) // @ game+0xdef49c
};

// VerseClass Verse.subscribable(t)
// Size: 0x28 (Inherited: 0x28)
struct Usubscribable(t) : UObject {

	struct UObject* _L_2fVerse_2eorg_2fVerse_2fsubscribable_2fsubscribable_Lt_R_N_RSubscribe_L_Nt_Tvoid_R(VerseFunctionProperty __verse_0xB2CDDD72_Argument); // Function Verse.subscribable(t)._L_2fVerse_2eorg_2fVerse_2fsubscribable_2fsubscribable_Lt_R_N_RSubscribe_L_Nt_Tvoid_R // (Public|HasOutParms|BlueprintCallable) // @ game+0xdef49c
};

// VerseClass Verse.task_event(t)$Await
// Size: 0x168 (Inherited: 0x148)
struct Utask_event(t)$Await : Utask(t) {
	struct Uevent(t)* _Self; // 0x148(0x08)
	struct Ftuple_L_R __verse_0xB2CDDD72_Argument; // 0x150(0x01)
	char pad_151[0x7]; // 0x151(0x07)
	VerseDynamicProperty _RetVal; // 0x158(0x10)

	int64_t Update(); // Function Verse.task_event(t)$Await.Update // (Native|Public|HasOutParms) // @ game+0x5d26d64
};

// VerseClass Verse.Verse
// Size: 0x30 (Inherited: 0x28)
struct UVerse : UObject {
	double __verse_0x34BB10F0_PiFloat; // 0x28(0x08)

	struct UObject* _L_2fVerse_2eorg_2fVerse_N_Rsubscribable_L_Nany_R(struct UObject* __verse_0xB2CDDD72_Argument); // Function Verse.Verse._L_2fVerse_2eorg_2fVerse_N_Rsubscribable_L_Nany_R // (Final|Static|Public|HasOutParms|BlueprintCallable) // @ game+0xdef49c
	struct UObject* _L_2fVerse_2eorg_2fVerse_N_Rsubscribable(struct Ftuple_L_R __verse_0xB2CDDD72_Argument); // Function Verse.Verse._L_2fVerse_2eorg_2fVerse_N_Rsubscribable // (Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0xdef49c
	struct UObject* _L_2fVerse_2eorg_2fVerse_N_Rsignalable_L_Nany_R(struct UObject* __verse_0xB2CDDD72_Argument); // Function Verse.Verse._L_2fVerse_2eorg_2fVerse_N_Rsignalable_L_Nany_R // (Final|Static|Public|HasOutParms|BlueprintCallable) // @ game+0xdef49c
