// VerseClass VerseFortnite.$SolarisSignatureFunctionOuter
// Size: 0x28 (Inherited: 0x28)
struct U$SolarisSignatureFunctionOuter : UObject {
};

// VerseClass VerseFortnite.Characters
// Size: 0x28 (Inherited: 0x28)
struct UCharacters : UObject {

	OptionProperty _L_2fFortnite_2ecom_2fCharacters_N_Roperator_U_2eGetFortCharacter_U_L_Nplayer_M_Ntuple_L_R_R(struct Ftuple_Lplayer_Mtuple_L_R_R __verse_0xB2CDDD72_Argument); // Function VerseFortnite.Characters._L_2fFortnite_2ecom_2fCharacters_N_Roperator_U_2eGetFortCharacter_U_L_Nplayer_M_Ntuple_L_R_R // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x63a2c5c
	void $InitCDO(); // Function VerseFortnite.Characters.$InitCDO // (None) // @ game+0xdef49c
};

// VerseClass VerseFortnite.fort_character
// Size: 0x28 (Inherited: 0x28)
struct Ufort_character : UObject {

	struct UObject* _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RSprintedEvent(struct Ftuple_L_R __verse_0xB2CDDD72_Argument); // Function VerseFortnite.fort_character._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RSprintedEvent // (Public|HasOutParms|BlueprintCallable) // @ game+0xdef49c
	void _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RSetShield_L_Nfloat_R(double __verse_0xB2CDDD72_Argument); // Function VerseFortnite.fort_character._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RSetShield_L_Nfloat_R // (Public|BlueprintCallable) // @ game+0xdef49c
	void _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RSetMaxShield_L_Nfloat_R(double __verse_0xB2CDDD72_Argument); // Function VerseFortnite.fort_character._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RSetMaxShield_L_Nfloat_R // (Public|BlueprintCallable) // @ game+0xdef49c
	void _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RSetMaxHealth_L_Nfloat_R(double __verse_0xB2CDDD72_Argument); // Function VerseFortnite.fort_character._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RSetMaxHealth_L_Nfloat_R // (Public|BlueprintCallable) // @ game+0xdef49c
	void _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RSetHealth_L_Nfloat_R(double __verse_0xB2CDDD72_Argument); // Function VerseFortnite.fort_character._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RSetHealth_L_Nfloat_R // (Public|BlueprintCallable) // @ game+0xdef49c
	struct UObject* _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RJumpedEvent(struct Ftuple_L_R __verse_0xB2CDDD72_Argument); // Function VerseFortnite.fort_character._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RJumpedEvent // (Public|HasOutParms|BlueprintCallable) // @ game+0xdef49c
	char _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsDownButNotOut(struct Ftuple_L_R __verse_0xB2CDDD72_Argument); // Function VerseFortnite.fort_character._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsDownButNotOut // (Public|HasOutParms|BlueprintCallable) // @ game+0xdef49c
	char _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsDown(struct Ftuple_L_R __verse_0xB2CDDD72_Argument); // Function VerseFortnite.fort_character._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsDown // (Public|HasOutParms|BlueprintCallable) // @ game+0xdef49c
	struct UObject* _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RHealedEvent(struct Ftuple_L_R __verse_0xB2CDDD72_Argument); // Function VerseFortnite.fort_character._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RHealedEvent // (Public|HasOutParms|BlueprintCallable) // @ game+0xdef49c
	void _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RHeal_L_Nfloat_R(double __verse_0xB2CDDD72_Argument); // Function VerseFortnite.fort_character._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RHeal_L_Nfloat_R // (Public|BlueprintCallable) // @ game+0xdef49c
	struct FTransform _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetTransform(struct Ftuple_L_R __verse_0xB2CDDD72_Argument); // Function VerseFortnite.fort_character._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetTransform // (Public|HasOutParms|BlueprintCallable) // @ game+0xdef49c
	double _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetShield(struct Ftuple_L_R __verse_0xB2CDDD72_Argument); // Function VerseFortnite.fort_character._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetShield // (Public|HasOutParms|BlueprintCallable) // @ game+0xdef49c
	OptionProperty _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetPlayer(struct Ftuple_L_R __verse_0xB2CDDD72_Argument); // Function VerseFortnite.fort_character._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetPlayer // (Public|HasOutParms|BlueprintCallable) // @ game+0xdef49c
	double _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetMaxShield(struct Ftuple_L_R __verse_0xB2CDDD72_Argument); // Function VerseFortnite.fort_character._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetMaxShield // (Public|HasOutParms|BlueprintCallable) // @ game+0xdef49c
	double _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetMaxHealth(struct Ftuple_L_R __verse_0xB2CDDD72_Argument); // Function VerseFortnite.fort_character._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetMaxHealth // (Public|HasOutParms|BlueprintCallable) // @ game+0xdef49c
	double _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetHealth(struct Ftuple_L_R __verse_0xB2CDDD72_Argument); // Function VerseFortnite.fort_character._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetHealth // (Public|HasOutParms|BlueprintCallable) // @ game+0xdef49c
	struct UObject* _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_REliminatedEvent(struct Ftuple_L_R __verse_0xB2CDDD72_Argument); // Function VerseFortnite.fort_character._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_REliminatedEvent // (Public|HasOutParms|BlueprintCallable) // @ game+0xdef49c
	struct UObject* _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RDamagedEvent(struct Ftuple_L_R __verse_0xB2CDDD72_Argument); // Function VerseFortnite.fort_character._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RDamagedEvent // (Public|HasOutParms|BlueprintCallable) // @ game+0xdef49c
	void _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RDamage_L_Nfloat_R(double __verse_0xB2CDDD72_Argument); // Function VerseFortnite.fort_character._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RDamage_L_Nfloat_R // (Public|BlueprintCallable) // @ game+0xdef49c
	struct UObject* _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RCrouchedEvent(struct Ftuple_L_R __verse_0xB2CDDD72_Argument); // Function VerseFortnite.fort_character._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RCrouchedEvent // (Public|HasOutParms|BlueprintCallable) // @ game+0xdef49c
};

// VerseClass VerseFortnite.fort_character_impl
// Size: 0x1b0 (Inherited: 0x40)
struct Ufort_character_impl : UVerseFortniteCharacter {
	char pad_40[0x140]; // 0x40(0x140)
	struct Umulticast_delegate(t)* __verse_0x4996425D_DamagedEventInternal; // 0x180(0x08)
	struct Umulticast_delegate(t)* __verse_0xC2836551_HealedEventInternal; // 0x188(0x08)
	struct Umulticast_delegate(t)* __verse_0x0008931F_CrouchedEventInternal; // 0x190(0x08)
	struct Umulticast_delegate(t)* __verse_0xCE63A4CB_JumpedEventInternal; // 0x198(0x08)
	struct Umulticast_delegate(t)* __verse_0x242DF4E0_SprintedEventInternal; // 0x1a0(0x08)
	struct Umulticast_delegate(t)* __verse_0x5587B813_EliminatedEventInternal; // 0x1a8(0x08)
	VerseFunctionProperty __verse_0xC92ABB7D__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RCrouchedEvent; // 0x60(0x10)
	VerseFunctionProperty __verse_0x245B7055__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RDamage_L_Nfloat_R; // 0xa0(0x10)
	VerseFunctionProperty __verse_0x18BD46DD__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RDamagedEvent; // 0xb0(0x10)
	VerseFunctionProperty __verse_0x1B4AAA99__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_REliminatedEvent; // 0x90(0x10)
	VerseFunctionProperty __verse_0x3659DA7D__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetHealth; // 0xe0(0x10)
	VerseFunctionProperty __verse_0xB240D835__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetMaxHealth; // 0x100(0x10)
	VerseFunctionProperty __verse_0x4C9CC37D__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetMaxShield; // 0x160(0x10)
	VerseFunctionProperty __verse_0xE3EB0E33__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetPlayer; // 0x40(0x10)
	VerseFunctionProperty __verse_0xC885C135__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetShield; // 0x140(0x10)
	VerseFunctionProperty __verse_0xCCAC92A3__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetTransform; // 0x50(0x10)
	VerseFunctionProperty __verse_0xCC568DBB__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RHeal_L_Nfloat_R; // 0xc0(0x10)
	VerseFunctionProperty __verse_0x5190CB4B__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RHealedEvent; // 0xd0(0x10)
	VerseFunctionProperty __verse_0xA4895306__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsDown; // 0x120(0x10)
	VerseFunctionProperty __verse_0xD3C45C5B__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsDownButNotOut; // 0x130(0x10)
	VerseFunctionProperty __verse_0x454A4B2C__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RJumpedEvent; // 0x70(0x10)
	VerseFunctionProperty __verse_0x1EBF9FFF__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RSetHealth_L_Nfloat_R; // 0xf0(0x10)
	VerseFunctionProperty __verse_0x7D3CEAD6__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RSetMaxHealth_L_Nfloat_R; // 0x110(0x10)
	VerseFunctionProperty __verse_0x3C2AE17C__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RSetMaxShield_L_Nfloat_R; // 0x170(0x10)
	VerseFunctionProperty __verse_0x5FA99455__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RSetShield_L_Nfloat_R; // 0x150(0x10)
	VerseFunctionProperty __verse_0xD90058E7__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RSprintedEvent; // 0x80(0x10)

	struct UObject* _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RSprintedEvent(struct Ftuple_L_R __verse_0xB2CDDD72_Argument); // Function VerseFortnite.fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RSprintedEvent // (Public|HasOutParms|BlueprintCallable) // @ game+0xdef49c
	void _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RSetShield_L_Nfloat_R(double __verse_0xB2CDDD72_Argument); // Function VerseFortnite.fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RSetShield_L_Nfloat_R // (Native|Public|BlueprintCallable) // @ game+0x63a2c54
	void _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RSetMaxShield_L_Nfloat_R(double __verse_0xB2CDDD72_Argument); // Function VerseFortnite.fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RSetMaxShield_L_Nfloat_R // (Native|Public|BlueprintCallable) // @ game+0x63a2c4c
	void _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RSetMaxHealth_L_Nfloat_R(double __verse_0xB2CDDD72_Argument); // Function VerseFortnite.fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RSetMaxHealth_L_Nfloat_R // (Native|Public|BlueprintCallable) // @ game+0x63a2c44
	void _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RSetHealth_L_Nfloat_R(double __verse_0xB2CDDD72_Argument); // Function VerseFortnite.fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RSetHealth_L_Nfloat_R // (Native|Public|BlueprintCallable) // @ game+0x63a2c3c
	struct UObject* _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RJumpedEvent(struct Ftuple_L_R __verse_0xB2CDDD72_Argument); // Function VerseFortnite.fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RJumpedEvent // (Public|HasOutParms|BlueprintCallable) // @ game+0xdef49c
	char _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsDownButNotOut(struct Ftuple_L_R __verse_0xB2CDDD72_Argument); // Function VerseFortnite.fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsDownButNotOut // (Native|Public|HasOutParms|BlueprintCallable) // @ game+0x63a2c2c
	char _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsDown(struct Ftuple_L_R __verse_0xB2CDDD72_Argument); // Function VerseFortnite.fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsDown // (Native|Public|HasOutParms|BlueprintCallable) // @ game+0x63a2c34
	struct UObject* _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RHealedEvent(struct Ftuple_L_R __verse_0xB2CDDD72_Argument); // Function VerseFortnite.fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RHealedEvent // (Public|HasOutParms|BlueprintCallable) // @ game+0xdef49c
	void _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RHeal_L_Nfloat_R(double __verse_0xB2CDDD72_Argument); // Function VerseFortnite.fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RHeal_L_Nfloat_R // (Native|Public|BlueprintCallable) // @ game+0x63a2c24
	struct FTransform _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetTransform(struct Ftuple_L_R __verse_0xB2CDDD72_Argument); // Function VerseFortnite.fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetTransform // (Native|Public|HasOutParms|BlueprintCallable) // @ game+0x63a2c1c
	double _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetShield(struct Ftuple_L_R __verse_0xB2CDDD72_Argument); // Function VerseFortnite.fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetShield // (Native|Public|HasOutParms|BlueprintCallable) // @ game+0x63a2c14
	OptionProperty _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetPlayer(struct Ftuple_L_R __verse_0xB2CDDD72_Argument); // Function VerseFortnite.fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetPlayer // (Native|Public|HasOutParms|BlueprintCallable) // @ game+0x63a2c0c
	double _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetMaxShield(struct Ftuple_L_R __verse_0xB2CDDD72_Argument); // Function VerseFortnite.fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetMaxShield // (Native|Public|HasOutParms|BlueprintCallable) // @ game+0x63a2c04
	double _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetMaxHealth(struct Ftuple_L_R __verse_0xB2CDDD72_Argument); // Function VerseFortnite.fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetMaxHealth // (Native|Public|HasOutParms|BlueprintCallable) // @ game+0x63a2bfc
	double _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetHealth(struct Ftuple_L_R __verse_0xB2CDDD72_Argument); // Function VerseFortnite.fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetHealth // (Native|Public|HasOutParms|BlueprintCallable) // @ game+0x63a2bf4
	struct UObject* _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_REliminatedEvent(struct Ftuple_L_R __verse_0xB2CDDD72_Argument); // Function VerseFortnite.fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_REliminatedEvent // (Public|HasOutParms|BlueprintCallable) // @ game+0xdef49c
	struct UObject* _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RDamagedEvent(struct Ftuple_L_R __verse_0xB2CDDD72_Argument); // Function VerseFortnite.fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RDamagedEvent // (Public|HasOutParms|BlueprintCallable) // @ game+0xdef49c
	void _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RDamage_L_Nfloat_R(double __verse_0xB2CDDD72_Argument); // Function VerseFortnite.fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RDamage_L_Nfloat_R // (Native|Public|BlueprintCallable) // @ game+0x63a2bec
	struct UObject* _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RCrouchedEvent(struct Ftuple_L_R __verse_0xB2CDDD72_Argument); // Function VerseFortnite.fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RCrouchedEvent // (Public|HasOutParms|BlueprintCallable) // @ game+0xdef49c
	void $InitInstance(); // Function VerseFortnite.fort_character_impl.$InitInstance // (None) // @ game+0xdef49c
	void $Block(); // Function VerseFortnite.fort_character_impl.$Block // (None) // @ game+0xdef49c
	void $InitCDO(); // Function VerseFortnite.fort_character_impl.$InitCDO // (HasDefaults) // @ game+0xdef49c
};

// VerseClass VerseFortnite.fort_playspace
// Size: 0x28 (Inherited: 0x28)
struct Ufort_playspace : UObject {

	struct UObject* _L_2fFortnite_2ecom_2fPlayspaces_2ffort__playspace_N_RPlayerRemovedEvent(struct Ftuple_L_R __verse_0xB2CDDD72_Argument); // Function VerseFortnite.fort_playspace._L_2fFortnite_2ecom_2fPlayspaces_2ffort__playspace_N_RPlayerRemovedEvent // (Public|HasOutParms|BlueprintCallable) // @ game+0xdef49c
	struct UObject* _L_2fFortnite_2ecom_2fPlayspaces_2ffort__playspace_N_RPlayerAddedEvent(struct Ftuple_L_R __verse_0xB2CDDD72_Argument); // Function VerseFortnite.fort_playspace._L_2fFortnite_2ecom_2fPlayspaces_2ffort__playspace_N_RPlayerAddedEvent // (Public|HasOutParms|BlueprintCallable) // @ game+0xdef49c
	struct TArray<struct UTeam*> _L_2fFortnite_2ecom_2fPlayspaces_2ffort__playspace_N_RGetTeams(struct Ftuple_L_R __verse_0xB2CDDD72_Argument); // Function VerseFortnite.fort_playspace._L_2fFortnite_2ecom_2fPlayspaces_2ffort__playspace_N_RGetTeams // (Public|HasOutParms|BlueprintCallable) // @ game+0xdef49c
	OptionProperty _L_2fFortnite_2ecom_2fPlayspaces_2ffort__playspace_N_RGetTeamForPlayer_L_Nplayer_R(struct UPlayer* __verse_0xB2CDDD72_Argument); // Function VerseFortnite.fort_playspace._L_2fFortnite_2ecom_2fPlayspaces_2ffort__playspace_N_RGetTeamForPlayer_L_Nplayer_R // (Public|HasOutParms|BlueprintCallable) // @ game+0xdef49c
	struct TArray<struct UPlayer*> _L_2fFortnite_2ecom_2fPlayspaces_2ffort__playspace_N_RGetPlayers(struct Ftuple_L_R __verse_0xB2CDDD72_Argument); // Function VerseFortnite.fort_playspace._L_2fFortnite_2ecom_2fPlayspaces_2ffort__playspace_N_RGetPlayers // (Public|HasOutParms|BlueprintCallable) // @ game+0xdef49c
};

// VerseClass VerseFortnite.fort_playspace_impl
// Size: 0xb8 (Inherited: 0x58)
struct Ufort_playspace_impl : UVerseFortnitePlayspace {
	char pad_58[0x50]; // 0x58(0x50)
	struct Umulticast_delegate(t)* __verse_0xD574E81A_PlayerAddedEventInternal; // 0xa8(0x08)
	struct Umulticast_delegate(t)* __verse_0x91891F4A_PlayerRemovedEventInternal; // 0xb0(0x08)
	VerseFunctionProperty __verse_0x3B43FA74__L_2fFortnite_2ecom_2fPlayspaces_2ffort__playspace_N_RGetPlayers; // 0x58(0x10)
	VerseFunctionProperty __verse_0x6F10F71B__L_2fFortnite_2ecom_2fPlayspaces_2ffort__playspace_N_RGetTeamForPlayer_L_Nplayer_R; // 0x78(0x10)
	VerseFunctionProperty __verse_0x3AAADBFC__L_2fFortnite_2ecom_2fPlayspaces_2ffort__playspace_N_RGetTeams; // 0x68(0x10)
	VerseFunctionProperty __verse_0x5ED7C0BA__L_2fFortnite_2ecom_2fPlayspaces_2ffort__playspace_N_RPlayerAddedEvent; // 0x88(0x10)
	VerseFunctionProperty __verse_0x8B6A4ED9__L_2fFortnite_2ecom_2fPlayspaces_2ffort__playspace_N_RPlayerRemovedEvent; // 0x98(0x10)

	struct UObject* _L_2fFortnite_2ecom_2fPlayspaces_2ffort__playspace_N_RPlayerRemovedEvent(struct Ftuple_L_R __verse_0xB2CDDD72_Argument); // Function VerseFortnite.fort_playspace_impl._L_2fFortnite_2ecom_2fPlayspaces_2ffort__playspace_N_RPlayerRemovedEvent // (Public|HasOutParms|BlueprintCallable) // @ game+0xdef49c
	struct UObject* _L_2fFortnite_2ecom_2fPlayspaces_2ffort__playspace_N_RPlayerAddedEvent(struct Ftuple_L_R __verse_0xB2CDDD72_Argument); // Function VerseFortnite.fort_playspace_impl._L_2fFortnite_2ecom_2fPlayspaces_2ffort__playspace_N_RPlayerAddedEvent // (Public|HasOutParms|BlueprintCallable) // @ game+0xdef49c
	struct TArray<struct UTeam*> _L_2fFortnite_2ecom_2fPlayspaces_2ffort__playspace_N_RGetTeams(struct Ftuple_L_R __verse_0xB2CDDD72_Argument); // Function VerseFortnite.fort_playspace_impl._L_2fFortnite_2ecom_2fPlayspaces_2ffort__playspace_N_RGetTeams // (Native|Public|HasOutParms|BlueprintCallable) // @ game+0x6015648
	OptionProperty _L_2fFortnite_2ecom_2fPlayspaces_2ffort__playspace_N_RGetTeamForPlayer_L_Nplayer_R(struct UPlayer* __verse_0xB2CDDD72_Argument); // Function VerseFortnite.fort_playspace_impl._L_2fFortnite_2ecom_2fPlayspaces_2ffort__playspace_N_RGetTeamForPlayer_L_Nplayer_R // (Native|Public|HasOutParms|BlueprintCallable) // @ game+0x6015640
	struct TArray<struct UPlayer*> _L_2fFortnite_2ecom_2fPlayspaces_2ffort__playspace_N_RGetPlayers(struct Ftuple_L_R __verse_0xB2CDDD72_Argument); // Function VerseFortnite.fort_playspace_impl._L_2fFortnite_2ecom_2fPlayspaces_2ffort__playspace_N_RGetPlayers // (Native|Public|HasOutParms|BlueprintCallable) // @ game+0x6015638
	void $InitInstance(); // Function VerseFortnite.fort_playspace_impl.$InitInstance // (None) // @ game+0xdef49c
	void $Block(); // Function VerseFortnite.fort_playspace_impl.$Block // (None) // @ game+0xdef49c
	void $InitCDO(); // Function VerseFortnite.fort_playspace_impl.$InitCDO // (HasDefaults) // @ game+0xdef49c
};

// VerseClass VerseFortnite.fort_vehicle
// Size: 0x28 (Inherited: 0x28)
struct Ufort_vehicle : UObject {

	void _L_2fFortnite_2ecom_2fVehicles_2ffort__vehicle_N_RSetMaxHealth_L_Nfloat_R(double __verse_0xB2CDDD72_Argument); // Function VerseFortnite.fort_vehicle._L_2fFortnite_2ecom_2fVehicles_2ffort__vehicle_N_RSetMaxHealth_L_Nfloat_R // (Public|BlueprintCallable) // @ game+0xdef49c
	void _L_2fFortnite_2ecom_2fVehicles_2ffort__vehicle_N_RSetHealth_L_Nfloat_R(double __verse_0xB2CDDD72_Argument); // Function VerseFortnite.fort_vehicle._L_2fFortnite_2ecom_2fVehicles_2ffort__vehicle_N_RSetHealth_L_Nfloat_R // (Public|BlueprintCallable) // @ game+0xdef49c
	struct FTransform _L_2fFortnite_2ecom_2fVehicles_2ffort__vehicle_N_RGetTransform(struct Ftuple_L_R __verse_0xB2CDDD72_Argument); // Function VerseFortnite.fort_vehicle._L_2fFortnite_2ecom_2fVehicles_2ffort__vehicle_N_RGetTransform // (Public|HasOutParms|BlueprintCallable) // @ game+0xdef49c
	double _L_2fFortnite_2ecom_2fVehicles_2ffort__vehicle_N_RGetMaxHealth(struct Ftuple_L_R __verse_0xB2CDDD72_Argument); // Function VerseFortnite.fort_vehicle._L_2fFortnite_2ecom_2fVehicles_2ffort__vehicle_N_RGetMaxHealth // (Public|HasOutParms|BlueprintCallable) // @ game+0xdef49c
	double _L_2fFortnite_2ecom_2fVehicles_2ffort__vehicle_N_RGetHealth(struct Ftuple_L_R __verse_0xB2CDDD72_Argument); // Function VerseFortnite.fort_vehicle._L_2fFortnite_2ecom_2fVehicles_2ffort__vehicle_N_RGetHealth // (Public|HasOutParms|BlueprintCallable) // @ game+0xdef49c
	struct UObject* _L_2fFortnite_2ecom_2fVehicles_2ffort__vehicle_N_RDamagedEvent(struct Ftuple_L_R __verse_0xB2CDDD72_Argument); // Function VerseFortnite.fort_vehicle._L_2fFortnite_2ecom_2fVehicles_2ffort__vehicle_N_RDamagedEvent // (Public|HasOutParms|BlueprintCallable) // @ game+0xdef49c
	void _L_2fFortnite_2ecom_2fVehicles_2ffort__vehicle_N_RDamage_L_Nfloat_R(double __verse_0xB2CDDD72_Argument); // Function VerseFortnite.fort_vehicle._L_2fFortnite_2ecom_2fVehicles_2ffort__vehicle_N_RDamage_L_Nfloat_R // (Public|BlueprintCallable) // @ game+0xdef49c
};

// VerseClass VerseFortnite.fort_vehicle_impl
// Size: 0xc0 (Inherited: 0x48)
struct Ufort_vehicle_impl : UVerseFortniteActorWrapper {
	char pad_48[0x70]; // 0x48(0x70)
	struct Umulticast_delegate(t)* __verse_0x4996425D_DamagedEventInternal; // 0xb8(0x08)
	VerseFunctionProperty __verse_0xF71D59A8__L_2fFortnite_2ecom_2fVehicles_2ffort__vehicle_N_RDamage_L_Nfloat_R; // 0x58(0x10)
	VerseFunctionProperty __verse_0x3C18E394__L_2fFortnite_2ecom_2fVehicles_2ffort__vehicle_N_RDamagedEvent; // 0x68(0x10)
	VerseFunctionProperty __verse_0xCDA73D34__L_2fFortnite_2ecom_2fVehicles_2ffort__vehicle_N_RGetHealth; // 0x78(0x10)
	VerseFunctionProperty __verse_0x96E57D7C__L_2fFortnite_2ecom_2fVehicles_2ffort__vehicle_N_RGetMaxHealth; // 0x98(0x10)
	VerseFunctionProperty __verse_0xE80937EA__L_2fFortnite_2ecom_2fVehicles_2ffort__vehicle_N_RGetTransform; // 0x48(0x10)
	VerseFunctionProperty __verse_0x7987B13E__L_2fFortnite_2ecom_2fVehicles_2ffort__vehicle_N_RSetHealth_L_Nfloat_R; // 0x88(0x10)
	VerseFunctionProperty __verse_0xCB37A1E6__L_2fFortnite_2ecom_2fVehicles_2ffort__vehicle_N_RSetMaxHealth_L_Nfloat_R; // 0xa8(0x10)

	void _L_2fFortnite_2ecom_2fVehicles_2ffort__vehicle_N_RSetMaxHealth_L_Nfloat_R(double __verse_0xB2CDDD72_Argument); // Function VerseFortnite.fort_vehicle_impl._L_2fFortnite_2ecom_2fVehicles_2ffort__vehicle_N_RSetMaxHealth_L_Nfloat_R // (Native|Public|BlueprintCallable) // @ game+0x63a2c8c
	void _L_2fFortnite_2ecom_2fVehicles_2ffort__vehicle_N_RSetHealth_L_Nfloat_R(double __verse_0xB2CDDD72_Argument); // Function VerseFortnite.fort_vehicle_impl._L_2fFortnite_2ecom_2fVehicles_2ffort__vehicle_N_RSetHealth_L_Nfloat_R // (Native|Public|BlueprintCallable) // @ game+0x63a2c84
	struct FTransform _L_2fFortnite_2ecom_2fVehicles_2ffort__vehicle_N_RGetTransform(struct Ftuple_L_R __verse_0xB2CDDD72_Argument); // Function VerseFortnite.fort_vehicle_impl._L_2fFortnite_2ecom_2fVehicles_2ffort__vehicle_N_RGetTransform // (Native|Public|HasOutParms|BlueprintCallable) // @ game+0x63a2c7c
	double _L_2fFortnite_2ecom_2fVehicles_2ffort__vehicle_N_RGetMaxHealth(struct Ftuple_L_R __verse_0xB2CDDD72_Argument); // Function VerseFortnite.fort_vehicle_impl._L_2fFortnite_2ecom_2fVehicles_2ffort__vehicle_N_RGetMaxHealth // (Native|Public|HasOutParms|BlueprintCallable) // @ game+0x63a2c74
	double _L_2fFortnite_2ecom_2fVehicles_2ffort__vehicle_N_RGetHealth(struct Ftuple_L_R __verse_0xB2CDDD72_Argument); // Function VerseFortnite.fort_vehicle_impl._L_2fFortnite_2ecom_2fVehicles_2ffort__vehicle_N_RGetHealth // (Native|Public|HasOutParms|BlueprintCallable) // @ game+0x63a2c6c
	struct UObject* _L_2fFortnite_2ecom_2fVehicles_2ffort__vehicle_N_RDamagedEvent(struct Ftuple_L_R __verse_0xB2CDDD72_Argument); // Function VerseFortnite.fort_vehicle_impl._L_2fFortnite_2ecom_2fVehicles_2ffort__vehicle_N_RDamagedEvent // (Public|HasOutParms|BlueprintCallable) // @ game+0xdef49c
	void _L_2fFortnite_2ecom_2fVehicles_2ffort__vehicle_N_RDamage_L_Nfloat_R(double __verse_0xB2CDDD72_Argument); // Function VerseFortnite.fort_vehicle_impl._L_2fFortnite_2ecom_2fVehicles_2ffort__vehicle_N_RDamage_L_Nfloat_R // (Native|Public|BlueprintCallable) // @ game+0x63a2c64
	void $InitInstance(); // Function VerseFortnite.fort_vehicle_impl.$InitInstance // (None) // @ game+0xdef49c
	void $Block(); // Function VerseFortnite.fort_vehicle_impl.$Block // (None) // @ game+0xdef49c
	void $InitCDO(); // Function VerseFortnite.fort_vehicle_impl.$InitCDO // (HasDefaults) // @ game+0xdef49c
};

// VerseClass VerseFortnite.Game
// Size: 0x28 (Inherited: 0x28)
struct UGame : UObject {

	struct Felimination_result elimination_result$Factory(); // Function VerseFortnite.Game.elimination_result$Factory // (Static|HasOutParms) // @ game+0xdef49c
	void $InitCDO(); // Function VerseFortnite.Game.$InitCDO // (None) // @ game+0xdef49c
};

// VerseClass VerseFortnite.Vehicles
// Size: 0x28 (Inherited: 0x28)
struct UVehicles : UObject {

	OptionProperty _L_2fFortnite_2ecom_2fVehicles_N_Roperator_U_2eGetFortVehicle_U_L_Nplayer_M_Ntuple_L_R_R(struct Ftuple_Lplayer_Mtuple_L_R_R __verse_0xB2CDDD72_Argument); // Function VerseFortnite.Vehicles._L_2fFortnite_2ecom_2fVehicles_N_Roperator_U_2eGetFortVehicle_U_L_Nplayer_M_Ntuple_L_R_R // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x63a2c94
	void $InitCDO(); // Function VerseFortnite.Vehicles.$InitCDO // (None) // @ game+0xdef49c
};

