// WidgetBlueprintGeneratedClass XpBarToolTip.XpBarToolTip_C
// Size: 0x358 (Inherited: 0x290)
struct UXpBarToolTip_C : UCommonUserWidget {
	struct UCommonTextBlock* ; // 0x290(0x08)
	struct UCommonTextBlock* ; // 0x298(0x08)
	struct UCommonTextBlock* ; // 0x2a0(0x08)
	struct UCommonTextBlock* ; // 0x2a8(0x08)
	struct UCommonTextBlock* ; // 0x2b0(0x08)
	struct UImage* ; // 0x2b8(0x08)
	struct UImage* ; // 0x2c0(0x08)
	struct UImage* ; // 0x2c8(0x08)
	struct UImage* ; // 0x2d0(0x08)
	struct UImage* ; // 0x2d8(0x08)
	struct FText HeaderText; // 0x2e0(0x18)
	struct FText CommanderXPText; // 0x2f8(0x18)
	struct FText BoostXPText; // 0x310(0x18)
	struct FText RestedXPText; // 0x328(0x18)
	struct FText BodyText; // 0x340(0x18)

	struct FText GetBodyText(); // Function XpBarToolTip.XpBarToolTip_C.GetBodyText // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0xdef49c
	struct FText GetRestedXPText(); // Function XpBarToolTip.XpBarToolTip_C.GetRestedXPText // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0xdef49c
	struct FText GetBoostXPText(); // Function XpBarToolTip.XpBarToolTip_C.GetBoostXPText // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0xdef49c
	struct FText GetCommanderXPText(); // Function XpBarToolTip.XpBarToolTip_C.GetCommanderXPText // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0xdef49c
	struct FText GetHeaderText(); // Function XpBarToolTip.XpBarToolTip_C.GetHeaderText // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0xdef49c
};

